/* automatically generated by rust-bindgen 0.65.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const MAX_ASSIGNED_ACCESS_RIGHTS: u32 = 4;
pub const MAX_ACCESS_DOORS: u32 = 4;
pub const MAX_ACCESS_POINTS: u32 = 4;
pub const MAX_ACCESS_DOORS_COUNT: u32 = 4;
pub const MAX_ACCESS_RIGHTSS: u32 = 4;
pub const MAX_NEGATIVE_ACCESS_RIGHTS_RULES: u32 = 4;
pub const MAX_POSITIVE_ACCESS_RIGHTS_RULES: u32 = 4;
pub const MAX_ACCESS_USERS: u32 = 4;
pub const MAX_ACCESS_USER_CREDENTIALS_COUNT: u32 = 4;
pub const MAX_ACCESS_ZONES: u32 = 4;
pub const MAX_ACCESS_ZONE_ENTRY_POINTS: u32 = 4;
pub const MAX_ACCESS_ZONE_EXIT_POINTS: u32 = 4;
pub const MAX_COMMANDS: u32 = 4;
pub const MAX_COMMAND_ACTIONS: u32 = 8;
pub const MAX_CREDENTIAL_DATA_INPUTS: u32 = 4;
pub const MAX_AUTHENTICATION_FACTOR_FORMAT_COUNT: u32 = 4;
pub const MAX_DEV_NAME_LEN: u32 = 32;
pub const MAX_DEV_LOC_LEN: u32 = 64;
pub const MAX_DEV_MOD_LEN: u32 = 32;
pub const MAX_DEV_VER_LEN: u32 = 16;
pub const MAX_DEV_DESC_LEN: u32 = 64;
pub const NC_RESCAN_RECIPIENTS_SECS: u32 = 60;
pub const NC_MAX_RECIPIENTS: u32 = 10;
pub const BACNET_WEEKLY_SCHEDULE_SIZE: u32 = 8;
pub const BACNET_SCHEDULE_OBJ_PROP_REF_SIZE: u32 = 4;
pub const TL_T_START_WILD: u32 = 1;
pub const TL_T_STOP_WILD: u32 = 2;
pub const TL_MAX_ENTRIES: u32 = 1000;
pub const TL_TYPE_STATUS: u32 = 0;
pub const TL_TYPE_BOOL: u32 = 1;
pub const TL_TYPE_REAL: u32 = 2;
pub const TL_TYPE_ENUM: u32 = 3;
pub const TL_TYPE_UNSIGN: u32 = 4;
pub const TL_TYPE_SIGN: u32 = 5;
pub const TL_TYPE_BITS: u32 = 6;
pub const TL_TYPE_NULL: u32 = 7;
pub const TL_TYPE_ERROR: u32 = 8;
pub const TL_TYPE_DELTA: u32 = 9;
pub const TL_TYPE_ANY: u32 = 10;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__mbstate8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mbstateL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    const UNINIT: ::std::mem::MaybeUninit<__darwin_pthread_handler_rec> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::std::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__routine) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__arg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_attr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_cond_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_condattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutex_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutexattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutexattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutexattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_once_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_once_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_once_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlock_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlock_t>(),
        200usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlockattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
        24usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cleanup_stack) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__cleanup_stack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__opaque)
        )
    );
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub const BACNET_PROPERTY_ID_PROP_ACKED_TRANSITIONS: BACNET_PROPERTY_ID = 0;
pub const BACNET_PROPERTY_ID_PROP_ACK_REQUIRED: BACNET_PROPERTY_ID = 1;
pub const BACNET_PROPERTY_ID_PROP_ACTION: BACNET_PROPERTY_ID = 2;
pub const BACNET_PROPERTY_ID_PROP_ACTION_TEXT: BACNET_PROPERTY_ID = 3;
pub const BACNET_PROPERTY_ID_PROP_ACTIVE_TEXT: BACNET_PROPERTY_ID = 4;
pub const BACNET_PROPERTY_ID_PROP_ACTIVE_VT_SESSIONS: BACNET_PROPERTY_ID = 5;
pub const BACNET_PROPERTY_ID_PROP_ALARM_VALUE: BACNET_PROPERTY_ID = 6;
pub const BACNET_PROPERTY_ID_PROP_ALARM_VALUES: BACNET_PROPERTY_ID = 7;
pub const BACNET_PROPERTY_ID_PROP_ALL: BACNET_PROPERTY_ID = 8;
pub const BACNET_PROPERTY_ID_PROP_ALL_WRITES_SUCCESSFUL: BACNET_PROPERTY_ID = 9;
pub const BACNET_PROPERTY_ID_PROP_APDU_SEGMENT_TIMEOUT: BACNET_PROPERTY_ID = 10;
pub const BACNET_PROPERTY_ID_PROP_APDU_TIMEOUT: BACNET_PROPERTY_ID = 11;
pub const BACNET_PROPERTY_ID_PROP_APPLICATION_SOFTWARE_VERSION: BACNET_PROPERTY_ID = 12;
pub const BACNET_PROPERTY_ID_PROP_ARCHIVE: BACNET_PROPERTY_ID = 13;
pub const BACNET_PROPERTY_ID_PROP_BIAS: BACNET_PROPERTY_ID = 14;
pub const BACNET_PROPERTY_ID_PROP_CHANGE_OF_STATE_COUNT: BACNET_PROPERTY_ID = 15;
pub const BACNET_PROPERTY_ID_PROP_CHANGE_OF_STATE_TIME: BACNET_PROPERTY_ID = 16;
pub const BACNET_PROPERTY_ID_PROP_NOTIFICATION_CLASS: BACNET_PROPERTY_ID = 17;
pub const BACNET_PROPERTY_ID_PROP_BLANK_1: BACNET_PROPERTY_ID = 18;
pub const BACNET_PROPERTY_ID_PROP_CONTROLLED_VARIABLE_REFERENCE: BACNET_PROPERTY_ID = 19;
pub const BACNET_PROPERTY_ID_PROP_CONTROLLED_VARIABLE_UNITS: BACNET_PROPERTY_ID = 20;
pub const BACNET_PROPERTY_ID_PROP_CONTROLLED_VARIABLE_VALUE: BACNET_PROPERTY_ID = 21;
pub const BACNET_PROPERTY_ID_PROP_COV_INCREMENT: BACNET_PROPERTY_ID = 22;
pub const BACNET_PROPERTY_ID_PROP_DATE_LIST: BACNET_PROPERTY_ID = 23;
pub const BACNET_PROPERTY_ID_PROP_DAYLIGHT_SAVINGS_STATUS: BACNET_PROPERTY_ID = 24;
pub const BACNET_PROPERTY_ID_PROP_DEADBAND: BACNET_PROPERTY_ID = 25;
pub const BACNET_PROPERTY_ID_PROP_DERIVATIVE_CONSTANT: BACNET_PROPERTY_ID = 26;
pub const BACNET_PROPERTY_ID_PROP_DERIVATIVE_CONSTANT_UNITS: BACNET_PROPERTY_ID = 27;
pub const BACNET_PROPERTY_ID_PROP_DESCRIPTION: BACNET_PROPERTY_ID = 28;
pub const BACNET_PROPERTY_ID_PROP_DESCRIPTION_OF_HALT: BACNET_PROPERTY_ID = 29;
pub const BACNET_PROPERTY_ID_PROP_DEVICE_ADDRESS_BINDING: BACNET_PROPERTY_ID = 30;
pub const BACNET_PROPERTY_ID_PROP_DEVICE_TYPE: BACNET_PROPERTY_ID = 31;
pub const BACNET_PROPERTY_ID_PROP_EFFECTIVE_PERIOD: BACNET_PROPERTY_ID = 32;
pub const BACNET_PROPERTY_ID_PROP_ELAPSED_ACTIVE_TIME: BACNET_PROPERTY_ID = 33;
pub const BACNET_PROPERTY_ID_PROP_ERROR_LIMIT: BACNET_PROPERTY_ID = 34;
pub const BACNET_PROPERTY_ID_PROP_EVENT_ENABLE: BACNET_PROPERTY_ID = 35;
pub const BACNET_PROPERTY_ID_PROP_EVENT_STATE: BACNET_PROPERTY_ID = 36;
pub const BACNET_PROPERTY_ID_PROP_EVENT_TYPE: BACNET_PROPERTY_ID = 37;
pub const BACNET_PROPERTY_ID_PROP_EXCEPTION_SCHEDULE: BACNET_PROPERTY_ID = 38;
pub const BACNET_PROPERTY_ID_PROP_FAULT_VALUES: BACNET_PROPERTY_ID = 39;
pub const BACNET_PROPERTY_ID_PROP_FEEDBACK_VALUE: BACNET_PROPERTY_ID = 40;
pub const BACNET_PROPERTY_ID_PROP_FILE_ACCESS_METHOD: BACNET_PROPERTY_ID = 41;
pub const BACNET_PROPERTY_ID_PROP_FILE_SIZE: BACNET_PROPERTY_ID = 42;
pub const BACNET_PROPERTY_ID_PROP_FILE_TYPE: BACNET_PROPERTY_ID = 43;
pub const BACNET_PROPERTY_ID_PROP_FIRMWARE_REVISION: BACNET_PROPERTY_ID = 44;
pub const BACNET_PROPERTY_ID_PROP_HIGH_LIMIT: BACNET_PROPERTY_ID = 45;
pub const BACNET_PROPERTY_ID_PROP_INACTIVE_TEXT: BACNET_PROPERTY_ID = 46;
pub const BACNET_PROPERTY_ID_PROP_IN_PROCESS: BACNET_PROPERTY_ID = 47;
pub const BACNET_PROPERTY_ID_PROP_INSTANCE_OF: BACNET_PROPERTY_ID = 48;
pub const BACNET_PROPERTY_ID_PROP_INTEGRAL_CONSTANT: BACNET_PROPERTY_ID = 49;
pub const BACNET_PROPERTY_ID_PROP_INTEGRAL_CONSTANT_UNITS: BACNET_PROPERTY_ID = 50;
pub const BACNET_PROPERTY_ID_PROP_ISSUE_CONFIRMED_NOTIFICATIONS: BACNET_PROPERTY_ID = 51;
pub const BACNET_PROPERTY_ID_PROP_LIMIT_ENABLE: BACNET_PROPERTY_ID = 52;
pub const BACNET_PROPERTY_ID_PROP_LIST_OF_GROUP_MEMBERS: BACNET_PROPERTY_ID = 53;
pub const BACNET_PROPERTY_ID_PROP_LIST_OF_OBJECT_PROPERTY_REFERENCES: BACNET_PROPERTY_ID = 54;
pub const BACNET_PROPERTY_ID_PROP_LIST_OF_SESSION_KEYS: BACNET_PROPERTY_ID = 55;
pub const BACNET_PROPERTY_ID_PROP_LOCAL_DATE: BACNET_PROPERTY_ID = 56;
pub const BACNET_PROPERTY_ID_PROP_LOCAL_TIME: BACNET_PROPERTY_ID = 57;
pub const BACNET_PROPERTY_ID_PROP_LOCATION: BACNET_PROPERTY_ID = 58;
pub const BACNET_PROPERTY_ID_PROP_LOW_LIMIT: BACNET_PROPERTY_ID = 59;
pub const BACNET_PROPERTY_ID_PROP_MANIPULATED_VARIABLE_REFERENCE: BACNET_PROPERTY_ID = 60;
pub const BACNET_PROPERTY_ID_PROP_MAXIMUM_OUTPUT: BACNET_PROPERTY_ID = 61;
pub const BACNET_PROPERTY_ID_PROP_MAX_APDU_LENGTH_ACCEPTED: BACNET_PROPERTY_ID = 62;
pub const BACNET_PROPERTY_ID_PROP_MAX_INFO_FRAMES: BACNET_PROPERTY_ID = 63;
pub const BACNET_PROPERTY_ID_PROP_MAX_MASTER: BACNET_PROPERTY_ID = 64;
pub const BACNET_PROPERTY_ID_PROP_MAX_PRES_VALUE: BACNET_PROPERTY_ID = 65;
pub const BACNET_PROPERTY_ID_PROP_MINIMUM_OFF_TIME: BACNET_PROPERTY_ID = 66;
pub const BACNET_PROPERTY_ID_PROP_MINIMUM_ON_TIME: BACNET_PROPERTY_ID = 67;
pub const BACNET_PROPERTY_ID_PROP_MINIMUM_OUTPUT: BACNET_PROPERTY_ID = 68;
pub const BACNET_PROPERTY_ID_PROP_MIN_PRES_VALUE: BACNET_PROPERTY_ID = 69;
pub const BACNET_PROPERTY_ID_PROP_MODEL_NAME: BACNET_PROPERTY_ID = 70;
pub const BACNET_PROPERTY_ID_PROP_MODIFICATION_DATE: BACNET_PROPERTY_ID = 71;
pub const BACNET_PROPERTY_ID_PROP_NOTIFY_TYPE: BACNET_PROPERTY_ID = 72;
pub const BACNET_PROPERTY_ID_PROP_NUMBER_OF_APDU_RETRIES: BACNET_PROPERTY_ID = 73;
pub const BACNET_PROPERTY_ID_PROP_NUMBER_OF_STATES: BACNET_PROPERTY_ID = 74;
pub const BACNET_PROPERTY_ID_PROP_OBJECT_IDENTIFIER: BACNET_PROPERTY_ID = 75;
pub const BACNET_PROPERTY_ID_PROP_OBJECT_LIST: BACNET_PROPERTY_ID = 76;
pub const BACNET_PROPERTY_ID_PROP_OBJECT_NAME: BACNET_PROPERTY_ID = 77;
pub const BACNET_PROPERTY_ID_PROP_OBJECT_PROPERTY_REFERENCE: BACNET_PROPERTY_ID = 78;
pub const BACNET_PROPERTY_ID_PROP_OBJECT_TYPE: BACNET_PROPERTY_ID = 79;
pub const BACNET_PROPERTY_ID_PROP_OPTIONAL: BACNET_PROPERTY_ID = 80;
pub const BACNET_PROPERTY_ID_PROP_OUT_OF_SERVICE: BACNET_PROPERTY_ID = 81;
pub const BACNET_PROPERTY_ID_PROP_OUTPUT_UNITS: BACNET_PROPERTY_ID = 82;
pub const BACNET_PROPERTY_ID_PROP_EVENT_PARAMETERS: BACNET_PROPERTY_ID = 83;
pub const BACNET_PROPERTY_ID_PROP_POLARITY: BACNET_PROPERTY_ID = 84;
pub const BACNET_PROPERTY_ID_PROP_PRESENT_VALUE: BACNET_PROPERTY_ID = 85;
pub const BACNET_PROPERTY_ID_PROP_PRIORITY: BACNET_PROPERTY_ID = 86;
pub const BACNET_PROPERTY_ID_PROP_PRIORITY_ARRAY: BACNET_PROPERTY_ID = 87;
pub const BACNET_PROPERTY_ID_PROP_PRIORITY_FOR_WRITING: BACNET_PROPERTY_ID = 88;
pub const BACNET_PROPERTY_ID_PROP_PROCESS_IDENTIFIER: BACNET_PROPERTY_ID = 89;
pub const BACNET_PROPERTY_ID_PROP_PROGRAM_CHANGE: BACNET_PROPERTY_ID = 90;
pub const BACNET_PROPERTY_ID_PROP_PROGRAM_LOCATION: BACNET_PROPERTY_ID = 91;
pub const BACNET_PROPERTY_ID_PROP_PROGRAM_STATE: BACNET_PROPERTY_ID = 92;
pub const BACNET_PROPERTY_ID_PROP_PROPORTIONAL_CONSTANT: BACNET_PROPERTY_ID = 93;
pub const BACNET_PROPERTY_ID_PROP_PROPORTIONAL_CONSTANT_UNITS: BACNET_PROPERTY_ID = 94;
pub const BACNET_PROPERTY_ID_PROP_PROTOCOL_CONFORMANCE_CLASS: BACNET_PROPERTY_ID = 95;
pub const BACNET_PROPERTY_ID_PROP_PROTOCOL_OBJECT_TYPES_SUPPORTED: BACNET_PROPERTY_ID = 96;
pub const BACNET_PROPERTY_ID_PROP_PROTOCOL_SERVICES_SUPPORTED: BACNET_PROPERTY_ID = 97;
pub const BACNET_PROPERTY_ID_PROP_PROTOCOL_VERSION: BACNET_PROPERTY_ID = 98;
pub const BACNET_PROPERTY_ID_PROP_READ_ONLY: BACNET_PROPERTY_ID = 99;
pub const BACNET_PROPERTY_ID_PROP_REASON_FOR_HALT: BACNET_PROPERTY_ID = 100;
pub const BACNET_PROPERTY_ID_PROP_RECIPIENT: BACNET_PROPERTY_ID = 101;
pub const BACNET_PROPERTY_ID_PROP_RECIPIENT_LIST: BACNET_PROPERTY_ID = 102;
pub const BACNET_PROPERTY_ID_PROP_RELIABILITY: BACNET_PROPERTY_ID = 103;
pub const BACNET_PROPERTY_ID_PROP_RELINQUISH_DEFAULT: BACNET_PROPERTY_ID = 104;
pub const BACNET_PROPERTY_ID_PROP_REQUIRED: BACNET_PROPERTY_ID = 105;
pub const BACNET_PROPERTY_ID_PROP_RESOLUTION: BACNET_PROPERTY_ID = 106;
pub const BACNET_PROPERTY_ID_PROP_SEGMENTATION_SUPPORTED: BACNET_PROPERTY_ID = 107;
pub const BACNET_PROPERTY_ID_PROP_SETPOINT: BACNET_PROPERTY_ID = 108;
pub const BACNET_PROPERTY_ID_PROP_SETPOINT_REFERENCE: BACNET_PROPERTY_ID = 109;
pub const BACNET_PROPERTY_ID_PROP_STATE_TEXT: BACNET_PROPERTY_ID = 110;
pub const BACNET_PROPERTY_ID_PROP_STATUS_FLAGS: BACNET_PROPERTY_ID = 111;
pub const BACNET_PROPERTY_ID_PROP_SYSTEM_STATUS: BACNET_PROPERTY_ID = 112;
pub const BACNET_PROPERTY_ID_PROP_TIME_DELAY: BACNET_PROPERTY_ID = 113;
pub const BACNET_PROPERTY_ID_PROP_TIME_OF_ACTIVE_TIME_RESET: BACNET_PROPERTY_ID = 114;
pub const BACNET_PROPERTY_ID_PROP_TIME_OF_STATE_COUNT_RESET: BACNET_PROPERTY_ID = 115;
pub const BACNET_PROPERTY_ID_PROP_TIME_SYNCHRONIZATION_RECIPIENTS: BACNET_PROPERTY_ID = 116;
pub const BACNET_PROPERTY_ID_PROP_UNITS: BACNET_PROPERTY_ID = 117;
pub const BACNET_PROPERTY_ID_PROP_UPDATE_INTERVAL: BACNET_PROPERTY_ID = 118;
pub const BACNET_PROPERTY_ID_PROP_UTC_OFFSET: BACNET_PROPERTY_ID = 119;
pub const BACNET_PROPERTY_ID_PROP_VENDOR_IDENTIFIER: BACNET_PROPERTY_ID = 120;
pub const BACNET_PROPERTY_ID_PROP_VENDOR_NAME: BACNET_PROPERTY_ID = 121;
pub const BACNET_PROPERTY_ID_PROP_VT_CLASSES_SUPPORTED: BACNET_PROPERTY_ID = 122;
pub const BACNET_PROPERTY_ID_PROP_WEEKLY_SCHEDULE: BACNET_PROPERTY_ID = 123;
pub const BACNET_PROPERTY_ID_PROP_ATTEMPTED_SAMPLES: BACNET_PROPERTY_ID = 124;
pub const BACNET_PROPERTY_ID_PROP_AVERAGE_VALUE: BACNET_PROPERTY_ID = 125;
pub const BACNET_PROPERTY_ID_PROP_BUFFER_SIZE: BACNET_PROPERTY_ID = 126;
pub const BACNET_PROPERTY_ID_PROP_CLIENT_COV_INCREMENT: BACNET_PROPERTY_ID = 127;
pub const BACNET_PROPERTY_ID_PROP_COV_RESUBSCRIPTION_INTERVAL: BACNET_PROPERTY_ID = 128;
pub const BACNET_PROPERTY_ID_PROP_CURRENT_NOTIFY_TIME: BACNET_PROPERTY_ID = 129;
pub const BACNET_PROPERTY_ID_PROP_EVENT_TIME_STAMPS: BACNET_PROPERTY_ID = 130;
pub const BACNET_PROPERTY_ID_PROP_LOG_BUFFER: BACNET_PROPERTY_ID = 131;
pub const BACNET_PROPERTY_ID_PROP_LOG_DEVICE_OBJECT_PROPERTY: BACNET_PROPERTY_ID = 132;
pub const BACNET_PROPERTY_ID_PROP_ENABLE: BACNET_PROPERTY_ID = 133;
pub const BACNET_PROPERTY_ID_PROP_LOG_INTERVAL: BACNET_PROPERTY_ID = 134;
pub const BACNET_PROPERTY_ID_PROP_MAXIMUM_VALUE: BACNET_PROPERTY_ID = 135;
pub const BACNET_PROPERTY_ID_PROP_MINIMUM_VALUE: BACNET_PROPERTY_ID = 136;
pub const BACNET_PROPERTY_ID_PROP_NOTIFICATION_THRESHOLD: BACNET_PROPERTY_ID = 137;
pub const BACNET_PROPERTY_ID_PROP_PREVIOUS_NOTIFY_TIME: BACNET_PROPERTY_ID = 138;
pub const BACNET_PROPERTY_ID_PROP_PROTOCOL_REVISION: BACNET_PROPERTY_ID = 139;
pub const BACNET_PROPERTY_ID_PROP_RECORDS_SINCE_NOTIFICATION: BACNET_PROPERTY_ID = 140;
pub const BACNET_PROPERTY_ID_PROP_RECORD_COUNT: BACNET_PROPERTY_ID = 141;
pub const BACNET_PROPERTY_ID_PROP_START_TIME: BACNET_PROPERTY_ID = 142;
pub const BACNET_PROPERTY_ID_PROP_STOP_TIME: BACNET_PROPERTY_ID = 143;
pub const BACNET_PROPERTY_ID_PROP_STOP_WHEN_FULL: BACNET_PROPERTY_ID = 144;
pub const BACNET_PROPERTY_ID_PROP_TOTAL_RECORD_COUNT: BACNET_PROPERTY_ID = 145;
pub const BACNET_PROPERTY_ID_PROP_VALID_SAMPLES: BACNET_PROPERTY_ID = 146;
pub const BACNET_PROPERTY_ID_PROP_WINDOW_INTERVAL: BACNET_PROPERTY_ID = 147;
pub const BACNET_PROPERTY_ID_PROP_WINDOW_SAMPLES: BACNET_PROPERTY_ID = 148;
pub const BACNET_PROPERTY_ID_PROP_MAXIMUM_VALUE_TIMESTAMP: BACNET_PROPERTY_ID = 149;
pub const BACNET_PROPERTY_ID_PROP_MINIMUM_VALUE_TIMESTAMP: BACNET_PROPERTY_ID = 150;
pub const BACNET_PROPERTY_ID_PROP_VARIANCE_VALUE: BACNET_PROPERTY_ID = 151;
pub const BACNET_PROPERTY_ID_PROP_ACTIVE_COV_SUBSCRIPTIONS: BACNET_PROPERTY_ID = 152;
pub const BACNET_PROPERTY_ID_PROP_BACKUP_FAILURE_TIMEOUT: BACNET_PROPERTY_ID = 153;
pub const BACNET_PROPERTY_ID_PROP_CONFIGURATION_FILES: BACNET_PROPERTY_ID = 154;
pub const BACNET_PROPERTY_ID_PROP_DATABASE_REVISION: BACNET_PROPERTY_ID = 155;
pub const BACNET_PROPERTY_ID_PROP_DIRECT_READING: BACNET_PROPERTY_ID = 156;
pub const BACNET_PROPERTY_ID_PROP_LAST_RESTORE_TIME: BACNET_PROPERTY_ID = 157;
pub const BACNET_PROPERTY_ID_PROP_MAINTENANCE_REQUIRED: BACNET_PROPERTY_ID = 158;
pub const BACNET_PROPERTY_ID_PROP_MEMBER_OF: BACNET_PROPERTY_ID = 159;
pub const BACNET_PROPERTY_ID_PROP_MODE: BACNET_PROPERTY_ID = 160;
pub const BACNET_PROPERTY_ID_PROP_OPERATION_EXPECTED: BACNET_PROPERTY_ID = 161;
pub const BACNET_PROPERTY_ID_PROP_SETTING: BACNET_PROPERTY_ID = 162;
pub const BACNET_PROPERTY_ID_PROP_SILENCED: BACNET_PROPERTY_ID = 163;
pub const BACNET_PROPERTY_ID_PROP_TRACKING_VALUE: BACNET_PROPERTY_ID = 164;
pub const BACNET_PROPERTY_ID_PROP_ZONE_MEMBERS: BACNET_PROPERTY_ID = 165;
pub const BACNET_PROPERTY_ID_PROP_LIFE_SAFETY_ALARM_VALUES: BACNET_PROPERTY_ID = 166;
pub const BACNET_PROPERTY_ID_PROP_MAX_SEGMENTS_ACCEPTED: BACNET_PROPERTY_ID = 167;
pub const BACNET_PROPERTY_ID_PROP_PROFILE_NAME: BACNET_PROPERTY_ID = 168;
pub const BACNET_PROPERTY_ID_PROP_AUTO_SLAVE_DISCOVERY: BACNET_PROPERTY_ID = 169;
pub const BACNET_PROPERTY_ID_PROP_MANUAL_SLAVE_ADDRESS_BINDING: BACNET_PROPERTY_ID = 170;
pub const BACNET_PROPERTY_ID_PROP_SLAVE_ADDRESS_BINDING: BACNET_PROPERTY_ID = 171;
pub const BACNET_PROPERTY_ID_PROP_SLAVE_PROXY_ENABLE: BACNET_PROPERTY_ID = 172;
pub const BACNET_PROPERTY_ID_PROP_LAST_NOTIFY_RECORD: BACNET_PROPERTY_ID = 173;
pub const BACNET_PROPERTY_ID_PROP_SCHEDULE_DEFAULT: BACNET_PROPERTY_ID = 174;
pub const BACNET_PROPERTY_ID_PROP_ACCEPTED_MODES: BACNET_PROPERTY_ID = 175;
pub const BACNET_PROPERTY_ID_PROP_ADJUST_VALUE: BACNET_PROPERTY_ID = 176;
pub const BACNET_PROPERTY_ID_PROP_COUNT: BACNET_PROPERTY_ID = 177;
pub const BACNET_PROPERTY_ID_PROP_COUNT_BEFORE_CHANGE: BACNET_PROPERTY_ID = 178;
pub const BACNET_PROPERTY_ID_PROP_COUNT_CHANGE_TIME: BACNET_PROPERTY_ID = 179;
pub const BACNET_PROPERTY_ID_PROP_COV_PERIOD: BACNET_PROPERTY_ID = 180;
pub const BACNET_PROPERTY_ID_PROP_INPUT_REFERENCE: BACNET_PROPERTY_ID = 181;
pub const BACNET_PROPERTY_ID_PROP_LIMIT_MONITORING_INTERVAL: BACNET_PROPERTY_ID = 182;
pub const BACNET_PROPERTY_ID_PROP_LOGGING_OBJECT: BACNET_PROPERTY_ID = 183;
pub const BACNET_PROPERTY_ID_PROP_LOGGING_RECORD: BACNET_PROPERTY_ID = 184;
pub const BACNET_PROPERTY_ID_PROP_PRESCALE: BACNET_PROPERTY_ID = 185;
pub const BACNET_PROPERTY_ID_PROP_PULSE_RATE: BACNET_PROPERTY_ID = 186;
pub const BACNET_PROPERTY_ID_PROP_SCALE: BACNET_PROPERTY_ID = 187;
pub const BACNET_PROPERTY_ID_PROP_SCALE_FACTOR: BACNET_PROPERTY_ID = 188;
pub const BACNET_PROPERTY_ID_PROP_UPDATE_TIME: BACNET_PROPERTY_ID = 189;
pub const BACNET_PROPERTY_ID_PROP_VALUE_BEFORE_CHANGE: BACNET_PROPERTY_ID = 190;
pub const BACNET_PROPERTY_ID_PROP_VALUE_SET: BACNET_PROPERTY_ID = 191;
pub const BACNET_PROPERTY_ID_PROP_VALUE_CHANGE_TIME: BACNET_PROPERTY_ID = 192;
pub const BACNET_PROPERTY_ID_PROP_ALIGN_INTERVALS: BACNET_PROPERTY_ID = 193;
pub const BACNET_PROPERTY_ID_PROP_INTERVAL_OFFSET: BACNET_PROPERTY_ID = 195;
pub const BACNET_PROPERTY_ID_PROP_LAST_RESTART_REASON: BACNET_PROPERTY_ID = 196;
pub const BACNET_PROPERTY_ID_PROP_LOGGING_TYPE: BACNET_PROPERTY_ID = 197;
pub const BACNET_PROPERTY_ID_PROP_RESTART_NOTIFICATION_RECIPIENTS: BACNET_PROPERTY_ID = 202;
pub const BACNET_PROPERTY_ID_PROP_TIME_OF_DEVICE_RESTART: BACNET_PROPERTY_ID = 203;
pub const BACNET_PROPERTY_ID_PROP_TIME_SYNCHRONIZATION_INTERVAL: BACNET_PROPERTY_ID = 204;
pub const BACNET_PROPERTY_ID_PROP_TRIGGER: BACNET_PROPERTY_ID = 205;
pub const BACNET_PROPERTY_ID_PROP_UTC_TIME_SYNCHRONIZATION_RECIPIENTS: BACNET_PROPERTY_ID = 206;
pub const BACNET_PROPERTY_ID_PROP_NODE_SUBTYPE: BACNET_PROPERTY_ID = 207;
pub const BACNET_PROPERTY_ID_PROP_NODE_TYPE: BACNET_PROPERTY_ID = 208;
pub const BACNET_PROPERTY_ID_PROP_STRUCTURED_OBJECT_LIST: BACNET_PROPERTY_ID = 209;
pub const BACNET_PROPERTY_ID_PROP_SUBORDINATE_ANNOTATIONS: BACNET_PROPERTY_ID = 210;
pub const BACNET_PROPERTY_ID_PROP_SUBORDINATE_LIST: BACNET_PROPERTY_ID = 211;
pub const BACNET_PROPERTY_ID_PROP_ACTUAL_SHED_LEVEL: BACNET_PROPERTY_ID = 212;
pub const BACNET_PROPERTY_ID_PROP_DUTY_WINDOW: BACNET_PROPERTY_ID = 213;
pub const BACNET_PROPERTY_ID_PROP_EXPECTED_SHED_LEVEL: BACNET_PROPERTY_ID = 214;
pub const BACNET_PROPERTY_ID_PROP_FULL_DUTY_BASELINE: BACNET_PROPERTY_ID = 215;
pub const BACNET_PROPERTY_ID_PROP_REQUESTED_SHED_LEVEL: BACNET_PROPERTY_ID = 218;
pub const BACNET_PROPERTY_ID_PROP_SHED_DURATION: BACNET_PROPERTY_ID = 219;
pub const BACNET_PROPERTY_ID_PROP_SHED_LEVEL_DESCRIPTIONS: BACNET_PROPERTY_ID = 220;
pub const BACNET_PROPERTY_ID_PROP_SHED_LEVELS: BACNET_PROPERTY_ID = 221;
pub const BACNET_PROPERTY_ID_PROP_STATE_DESCRIPTION: BACNET_PROPERTY_ID = 222;
pub const BACNET_PROPERTY_ID_PROP_DOOR_ALARM_STATE: BACNET_PROPERTY_ID = 226;
pub const BACNET_PROPERTY_ID_PROP_DOOR_EXTENDED_PULSE_TIME: BACNET_PROPERTY_ID = 227;
pub const BACNET_PROPERTY_ID_PROP_DOOR_MEMBERS: BACNET_PROPERTY_ID = 228;
pub const BACNET_PROPERTY_ID_PROP_DOOR_OPEN_TOO_LONG_TIME: BACNET_PROPERTY_ID = 229;
pub const BACNET_PROPERTY_ID_PROP_DOOR_PULSE_TIME: BACNET_PROPERTY_ID = 230;
pub const BACNET_PROPERTY_ID_PROP_DOOR_STATUS: BACNET_PROPERTY_ID = 231;
pub const BACNET_PROPERTY_ID_PROP_DOOR_UNLOCK_DELAY_TIME: BACNET_PROPERTY_ID = 232;
pub const BACNET_PROPERTY_ID_PROP_LOCK_STATUS: BACNET_PROPERTY_ID = 233;
pub const BACNET_PROPERTY_ID_PROP_MASKED_ALARM_VALUES: BACNET_PROPERTY_ID = 234;
pub const BACNET_PROPERTY_ID_PROP_SECURED_STATUS: BACNET_PROPERTY_ID = 235;
pub const BACNET_PROPERTY_ID_PROP_ABSENTEE_LIMIT: BACNET_PROPERTY_ID = 244;
pub const BACNET_PROPERTY_ID_PROP_ACCESS_ALARM_EVENTS: BACNET_PROPERTY_ID = 245;
pub const BACNET_PROPERTY_ID_PROP_ACCESS_DOORS: BACNET_PROPERTY_ID = 246;
pub const BACNET_PROPERTY_ID_PROP_ACCESS_EVENT: BACNET_PROPERTY_ID = 247;
pub const BACNET_PROPERTY_ID_PROP_ACCESS_EVENT_AUTHENTICATION_FACTOR: BACNET_PROPERTY_ID = 248;
pub const BACNET_PROPERTY_ID_PROP_ACCESS_EVENT_CREDENTIAL: BACNET_PROPERTY_ID = 249;
pub const BACNET_PROPERTY_ID_PROP_ACCESS_EVENT_TIME: BACNET_PROPERTY_ID = 250;
pub const BACNET_PROPERTY_ID_PROP_ACCESS_TRANSACTION_EVENTS: BACNET_PROPERTY_ID = 251;
pub const BACNET_PROPERTY_ID_PROP_ACCOMPANIMENT: BACNET_PROPERTY_ID = 252;
pub const BACNET_PROPERTY_ID_PROP_ACCOMPANIMENT_TIME: BACNET_PROPERTY_ID = 253;
pub const BACNET_PROPERTY_ID_PROP_ACTIVATION_TIME: BACNET_PROPERTY_ID = 254;
pub const BACNET_PROPERTY_ID_PROP_ACTIVE_AUTHENTICATION_POLICY: BACNET_PROPERTY_ID = 255;
pub const BACNET_PROPERTY_ID_PROP_ASSIGNED_ACCESS_RIGHTS: BACNET_PROPERTY_ID = 256;
pub const BACNET_PROPERTY_ID_PROP_AUTHENTICATION_FACTORS: BACNET_PROPERTY_ID = 257;
pub const BACNET_PROPERTY_ID_PROP_AUTHENTICATION_POLICY_LIST: BACNET_PROPERTY_ID = 258;
pub const BACNET_PROPERTY_ID_PROP_AUTHENTICATION_POLICY_NAMES: BACNET_PROPERTY_ID = 259;
pub const BACNET_PROPERTY_ID_PROP_AUTHENTICATION_STATUS: BACNET_PROPERTY_ID = 260;
pub const BACNET_PROPERTY_ID_PROP_AUTHORIZATION_MODE: BACNET_PROPERTY_ID = 261;
pub const BACNET_PROPERTY_ID_PROP_BELONGS_TO: BACNET_PROPERTY_ID = 262;
pub const BACNET_PROPERTY_ID_PROP_CREDENTIAL_DISABLE: BACNET_PROPERTY_ID = 263;
pub const BACNET_PROPERTY_ID_PROP_CREDENTIAL_STATUS: BACNET_PROPERTY_ID = 264;
pub const BACNET_PROPERTY_ID_PROP_CREDENTIALS: BACNET_PROPERTY_ID = 265;
pub const BACNET_PROPERTY_ID_PROP_CREDENTIALS_IN_ZONE: BACNET_PROPERTY_ID = 266;
pub const BACNET_PROPERTY_ID_PROP_DAYS_REMAINING: BACNET_PROPERTY_ID = 267;
pub const BACNET_PROPERTY_ID_PROP_ENTRY_POINTS: BACNET_PROPERTY_ID = 268;
pub const BACNET_PROPERTY_ID_PROP_EXIT_POINTS: BACNET_PROPERTY_ID = 269;
pub const BACNET_PROPERTY_ID_PROP_EXPIRATION_TIME: BACNET_PROPERTY_ID = 270;
pub const BACNET_PROPERTY_ID_PROP_EXTENDED_TIME_ENABLE: BACNET_PROPERTY_ID = 271;
pub const BACNET_PROPERTY_ID_PROP_FAILED_ATTEMPT_EVENTS: BACNET_PROPERTY_ID = 272;
pub const BACNET_PROPERTY_ID_PROP_FAILED_ATTEMPTS: BACNET_PROPERTY_ID = 273;
pub const BACNET_PROPERTY_ID_PROP_FAILED_ATTEMPTS_TIME: BACNET_PROPERTY_ID = 274;
pub const BACNET_PROPERTY_ID_PROP_LAST_ACCESS_EVENT: BACNET_PROPERTY_ID = 275;
pub const BACNET_PROPERTY_ID_PROP_LAST_ACCESS_POINT: BACNET_PROPERTY_ID = 276;
pub const BACNET_PROPERTY_ID_PROP_LAST_CREDENTIAL_ADDED: BACNET_PROPERTY_ID = 277;
pub const BACNET_PROPERTY_ID_PROP_LAST_CREDENTIAL_ADDED_TIME: BACNET_PROPERTY_ID = 278;
pub const BACNET_PROPERTY_ID_PROP_LAST_CREDENTIAL_REMOVED: BACNET_PROPERTY_ID = 279;
pub const BACNET_PROPERTY_ID_PROP_LAST_CREDENTIAL_REMOVED_TIME: BACNET_PROPERTY_ID = 280;
pub const BACNET_PROPERTY_ID_PROP_LAST_USE_TIME: BACNET_PROPERTY_ID = 281;
pub const BACNET_PROPERTY_ID_PROP_LOCKOUT: BACNET_PROPERTY_ID = 282;
pub const BACNET_PROPERTY_ID_PROP_LOCKOUT_RELINQUISH_TIME: BACNET_PROPERTY_ID = 283;
pub const BACNET_PROPERTY_ID_PROP_MASTER_EXEMPTION: BACNET_PROPERTY_ID = 284;
pub const BACNET_PROPERTY_ID_PROP_MAX_FAILED_ATTEMPTS: BACNET_PROPERTY_ID = 285;
pub const BACNET_PROPERTY_ID_PROP_MEMBERS: BACNET_PROPERTY_ID = 286;
pub const BACNET_PROPERTY_ID_PROP_MUSTER_POINT: BACNET_PROPERTY_ID = 287;
pub const BACNET_PROPERTY_ID_PROP_NEGATIVE_ACCESS_RULES: BACNET_PROPERTY_ID = 288;
pub const BACNET_PROPERTY_ID_PROP_NUMBER_OF_AUTHENTICATION_POLICIES: BACNET_PROPERTY_ID = 289;
pub const BACNET_PROPERTY_ID_PROP_OCCUPANCY_COUNT: BACNET_PROPERTY_ID = 290;
pub const BACNET_PROPERTY_ID_PROP_OCCUPANCY_COUNT_ADJUST: BACNET_PROPERTY_ID = 291;
pub const BACNET_PROPERTY_ID_PROP_OCCUPANCY_COUNT_ENABLE: BACNET_PROPERTY_ID = 292;
pub const BACNET_PROPERTY_ID_PROP_OCCUPANCY_EXEMPTION: BACNET_PROPERTY_ID = 293;
pub const BACNET_PROPERTY_ID_PROP_OCCUPANCY_LOWER_LIMIT: BACNET_PROPERTY_ID = 294;
pub const BACNET_PROPERTY_ID_PROP_OCCUPANCY_LOWER_LIMIT_ENFORCED: BACNET_PROPERTY_ID = 295;
pub const BACNET_PROPERTY_ID_PROP_OCCUPANCY_STATE: BACNET_PROPERTY_ID = 296;
pub const BACNET_PROPERTY_ID_PROP_OCCUPANCY_UPPER_LIMIT: BACNET_PROPERTY_ID = 297;
pub const BACNET_PROPERTY_ID_PROP_OCCUPANCY_UPPER_LIMIT_ENFORCED: BACNET_PROPERTY_ID = 298;
pub const BACNET_PROPERTY_ID_PROP_PASSBACK_EXEMPTION: BACNET_PROPERTY_ID = 299;
pub const BACNET_PROPERTY_ID_PROP_PASSBACK_MODE: BACNET_PROPERTY_ID = 300;
pub const BACNET_PROPERTY_ID_PROP_PASSBACK_TIMEOUT: BACNET_PROPERTY_ID = 301;
pub const BACNET_PROPERTY_ID_PROP_POSITIVE_ACCESS_RULES: BACNET_PROPERTY_ID = 302;
pub const BACNET_PROPERTY_ID_PROP_REASON_FOR_DISABLE: BACNET_PROPERTY_ID = 303;
pub const BACNET_PROPERTY_ID_PROP_SUPPORTED_FORMATS: BACNET_PROPERTY_ID = 304;
pub const BACNET_PROPERTY_ID_PROP_SUPPORTED_FORMAT_CLASSES: BACNET_PROPERTY_ID = 305;
pub const BACNET_PROPERTY_ID_PROP_THREAT_AUTHORITY: BACNET_PROPERTY_ID = 306;
pub const BACNET_PROPERTY_ID_PROP_THREAT_LEVEL: BACNET_PROPERTY_ID = 307;
pub const BACNET_PROPERTY_ID_PROP_TRACE_FLAG: BACNET_PROPERTY_ID = 308;
pub const BACNET_PROPERTY_ID_PROP_TRANSACTION_NOTIFICATION_CLASS: BACNET_PROPERTY_ID = 309;
pub const BACNET_PROPERTY_ID_PROP_USER_EXTERNAL_IDENTIFIER: BACNET_PROPERTY_ID = 310;
pub const BACNET_PROPERTY_ID_PROP_USER_INFORMATION_REFERENCE: BACNET_PROPERTY_ID = 311;
pub const BACNET_PROPERTY_ID_PROP_USER_NAME: BACNET_PROPERTY_ID = 317;
pub const BACNET_PROPERTY_ID_PROP_USER_TYPE: BACNET_PROPERTY_ID = 318;
pub const BACNET_PROPERTY_ID_PROP_USES_REMAINING: BACNET_PROPERTY_ID = 319;
pub const BACNET_PROPERTY_ID_PROP_ZONE_FROM: BACNET_PROPERTY_ID = 320;
pub const BACNET_PROPERTY_ID_PROP_ZONE_TO: BACNET_PROPERTY_ID = 321;
pub const BACNET_PROPERTY_ID_PROP_ACCESS_EVENT_TAG: BACNET_PROPERTY_ID = 322;
pub const BACNET_PROPERTY_ID_PROP_GLOBAL_IDENTIFIER: BACNET_PROPERTY_ID = 323;
pub const BACNET_PROPERTY_ID_PROP_VERIFICATION_TIME: BACNET_PROPERTY_ID = 326;
pub const BACNET_PROPERTY_ID_PROP_BASE_DEVICE_SECURITY_POLICY: BACNET_PROPERTY_ID = 327;
pub const BACNET_PROPERTY_ID_PROP_DISTRIBUTION_KEY_REVISION: BACNET_PROPERTY_ID = 328;
pub const BACNET_PROPERTY_ID_PROP_DO_NOT_HIDE: BACNET_PROPERTY_ID = 329;
pub const BACNET_PROPERTY_ID_PROP_KEY_SETS: BACNET_PROPERTY_ID = 330;
pub const BACNET_PROPERTY_ID_PROP_LAST_KEY_SERVER: BACNET_PROPERTY_ID = 331;
pub const BACNET_PROPERTY_ID_PROP_NETWORK_ACCESS_SECURITY_POLICIES: BACNET_PROPERTY_ID = 332;
pub const BACNET_PROPERTY_ID_PROP_PACKET_REORDER_TIME: BACNET_PROPERTY_ID = 333;
pub const BACNET_PROPERTY_ID_PROP_SECURITY_PDU_TIMEOUT: BACNET_PROPERTY_ID = 334;
pub const BACNET_PROPERTY_ID_PROP_SECURITY_TIME_WINDOW: BACNET_PROPERTY_ID = 335;
pub const BACNET_PROPERTY_ID_PROP_SUPPORTED_SECURITY_ALGORITHM: BACNET_PROPERTY_ID = 336;
pub const BACNET_PROPERTY_ID_PROP_UPDATE_KEY_SET_TIMEOUT: BACNET_PROPERTY_ID = 337;
pub const BACNET_PROPERTY_ID_PROP_BACKUP_AND_RESTORE_STATE: BACNET_PROPERTY_ID = 338;
pub const BACNET_PROPERTY_ID_PROP_BACKUP_PREPARATION_TIME: BACNET_PROPERTY_ID = 339;
pub const BACNET_PROPERTY_ID_PROP_RESTORE_COMPLETION_TIME: BACNET_PROPERTY_ID = 340;
pub const BACNET_PROPERTY_ID_PROP_RESTORE_PREPARATION_TIME: BACNET_PROPERTY_ID = 341;
pub const BACNET_PROPERTY_ID_PROP_BIT_MASK: BACNET_PROPERTY_ID = 342;
pub const BACNET_PROPERTY_ID_PROP_BIT_TEXT: BACNET_PROPERTY_ID = 343;
pub const BACNET_PROPERTY_ID_PROP_IS_UTC: BACNET_PROPERTY_ID = 344;
pub const BACNET_PROPERTY_ID_PROP_GROUP_MEMBERS: BACNET_PROPERTY_ID = 345;
pub const BACNET_PROPERTY_ID_PROP_GROUP_MEMBER_NAMES: BACNET_PROPERTY_ID = 346;
pub const BACNET_PROPERTY_ID_PROP_MEMBER_STATUS_FLAGS: BACNET_PROPERTY_ID = 347;
pub const BACNET_PROPERTY_ID_PROP_REQUESTED_UPDATE_INTERVAL: BACNET_PROPERTY_ID = 348;
pub const BACNET_PROPERTY_ID_PROP_COVU_PERIOD: BACNET_PROPERTY_ID = 349;
pub const BACNET_PROPERTY_ID_PROP_COVU_RECIPIENTS: BACNET_PROPERTY_ID = 350;
pub const BACNET_PROPERTY_ID_PROP_EVENT_MESSAGE_TEXTS: BACNET_PROPERTY_ID = 351;
pub const BACNET_PROPERTY_ID_PROP_EVENT_MESSAGE_TEXTS_CONFIG: BACNET_PROPERTY_ID = 352;
pub const BACNET_PROPERTY_ID_PROP_EVENT_DETECTION_ENABLE: BACNET_PROPERTY_ID = 353;
pub const BACNET_PROPERTY_ID_PROP_EVENT_ALGORITHM_INHIBIT: BACNET_PROPERTY_ID = 354;
pub const BACNET_PROPERTY_ID_PROP_EVENT_ALGORITHM_INHIBIT_REF: BACNET_PROPERTY_ID = 355;
pub const BACNET_PROPERTY_ID_PROP_TIME_DELAY_NORMAL: BACNET_PROPERTY_ID = 356;
pub const BACNET_PROPERTY_ID_PROP_RELIABILITY_EVALUATION_INHIBIT: BACNET_PROPERTY_ID = 357;
pub const BACNET_PROPERTY_ID_PROP_FAULT_PARAMETERS: BACNET_PROPERTY_ID = 358;
pub const BACNET_PROPERTY_ID_PROP_FAULT_TYPE: BACNET_PROPERTY_ID = 359;
pub const BACNET_PROPERTY_ID_PROP_LOCAL_FORWARDING_ONLY: BACNET_PROPERTY_ID = 360;
pub const BACNET_PROPERTY_ID_PROP_PROCESS_IDENTIFIER_FILTER: BACNET_PROPERTY_ID = 361;
pub const BACNET_PROPERTY_ID_PROP_SUBSCRIBED_RECIPIENTS: BACNET_PROPERTY_ID = 362;
pub const BACNET_PROPERTY_ID_PROP_PORT_FILTER: BACNET_PROPERTY_ID = 363;
pub const BACNET_PROPERTY_ID_PROP_AUTHORIZATION_EXEMPTIONS: BACNET_PROPERTY_ID = 364;
pub const BACNET_PROPERTY_ID_PROP_ALLOW_GROUP_DELAY_INHIBIT: BACNET_PROPERTY_ID = 365;
pub const BACNET_PROPERTY_ID_PROP_CHANNEL_NUMBER: BACNET_PROPERTY_ID = 366;
pub const BACNET_PROPERTY_ID_PROP_CONTROL_GROUPS: BACNET_PROPERTY_ID = 367;
pub const BACNET_PROPERTY_ID_PROP_EXECUTION_DELAY: BACNET_PROPERTY_ID = 368;
pub const BACNET_PROPERTY_ID_PROP_LAST_PRIORITY: BACNET_PROPERTY_ID = 369;
pub const BACNET_PROPERTY_ID_PROP_WRITE_STATUS: BACNET_PROPERTY_ID = 370;
pub const BACNET_PROPERTY_ID_PROP_PROPERTY_LIST: BACNET_PROPERTY_ID = 371;
pub const BACNET_PROPERTY_ID_PROP_SERIAL_NUMBER: BACNET_PROPERTY_ID = 372;
pub const BACNET_PROPERTY_ID_PROP_BLINK_WARN_ENABLE: BACNET_PROPERTY_ID = 373;
pub const BACNET_PROPERTY_ID_PROP_DEFAULT_FADE_TIME: BACNET_PROPERTY_ID = 374;
pub const BACNET_PROPERTY_ID_PROP_DEFAULT_RAMP_RATE: BACNET_PROPERTY_ID = 375;
pub const BACNET_PROPERTY_ID_PROP_DEFAULT_STEP_INCREMENT: BACNET_PROPERTY_ID = 376;
pub const BACNET_PROPERTY_ID_PROP_EGRESS_TIME: BACNET_PROPERTY_ID = 377;
pub const BACNET_PROPERTY_ID_PROP_IN_PROGRESS: BACNET_PROPERTY_ID = 378;
pub const BACNET_PROPERTY_ID_PROP_INSTANTANEOUS_POWER: BACNET_PROPERTY_ID = 379;
pub const BACNET_PROPERTY_ID_PROP_LIGHTING_COMMAND: BACNET_PROPERTY_ID = 380;
pub const BACNET_PROPERTY_ID_PROP_LIGHTING_COMMAND_DEFAULT_PRIORITY: BACNET_PROPERTY_ID = 381;
pub const BACNET_PROPERTY_ID_PROP_MAX_ACTUAL_VALUE: BACNET_PROPERTY_ID = 382;
pub const BACNET_PROPERTY_ID_PROP_MIN_ACTUAL_VALUE: BACNET_PROPERTY_ID = 383;
pub const BACNET_PROPERTY_ID_PROP_POWER: BACNET_PROPERTY_ID = 384;
pub const BACNET_PROPERTY_ID_PROP_TRANSITION: BACNET_PROPERTY_ID = 385;
pub const BACNET_PROPERTY_ID_PROP_EGRESS_ACTIVE: BACNET_PROPERTY_ID = 386;
pub const BACNET_PROPERTY_ID_PROP_INTERFACE_VALUE: BACNET_PROPERTY_ID = 387;
pub const BACNET_PROPERTY_ID_PROP_FAULT_HIGH_LIMIT: BACNET_PROPERTY_ID = 388;
pub const BACNET_PROPERTY_ID_PROP_FAULT_LOW_LIMIT: BACNET_PROPERTY_ID = 389;
pub const BACNET_PROPERTY_ID_PROP_LOW_DIFF_LIMIT: BACNET_PROPERTY_ID = 390;
pub const BACNET_PROPERTY_ID_PROP_STRIKE_COUNT: BACNET_PROPERTY_ID = 391;
pub const BACNET_PROPERTY_ID_PROP_TIME_OF_STRIKE_COUNT_RESET: BACNET_PROPERTY_ID = 392;
pub const BACNET_PROPERTY_ID_PROP_DEFAULT_TIMEOUT: BACNET_PROPERTY_ID = 393;
pub const BACNET_PROPERTY_ID_PROP_INITIAL_TIMEOUT: BACNET_PROPERTY_ID = 394;
pub const BACNET_PROPERTY_ID_PROP_LAST_STATE_CHANGE: BACNET_PROPERTY_ID = 395;
pub const BACNET_PROPERTY_ID_PROP_STATE_CHANGE_VALUES: BACNET_PROPERTY_ID = 396;
pub const BACNET_PROPERTY_ID_PROP_TIMER_RUNNING: BACNET_PROPERTY_ID = 397;
pub const BACNET_PROPERTY_ID_PROP_TIMER_STATE: BACNET_PROPERTY_ID = 398;
pub const BACNET_PROPERTY_ID_PROP_APDU_LENGTH: BACNET_PROPERTY_ID = 399;
pub const BACNET_PROPERTY_ID_PROP_IP_ADDRESS: BACNET_PROPERTY_ID = 400;
pub const BACNET_PROPERTY_ID_PROP_IP_DEFAULT_GATEWAY: BACNET_PROPERTY_ID = 401;
pub const BACNET_PROPERTY_ID_PROP_IP_DHCP_ENABLE: BACNET_PROPERTY_ID = 402;
pub const BACNET_PROPERTY_ID_PROP_IP_DHCP_LEASE_TIME: BACNET_PROPERTY_ID = 403;
pub const BACNET_PROPERTY_ID_PROP_IP_DHCP_LEASE_TIME_REMAINING: BACNET_PROPERTY_ID = 404;
pub const BACNET_PROPERTY_ID_PROP_IP_DHCP_SERVER: BACNET_PROPERTY_ID = 405;
pub const BACNET_PROPERTY_ID_PROP_IP_DNS_SERVER: BACNET_PROPERTY_ID = 406;
pub const BACNET_PROPERTY_ID_PROP_BACNET_IP_GLOBAL_ADDRESS: BACNET_PROPERTY_ID = 407;
pub const BACNET_PROPERTY_ID_PROP_BACNET_IP_MODE: BACNET_PROPERTY_ID = 408;
pub const BACNET_PROPERTY_ID_PROP_BACNET_IP_MULTICAST_ADDRESS: BACNET_PROPERTY_ID = 409;
pub const BACNET_PROPERTY_ID_PROP_BACNET_IP_NAT_TRAVERSAL: BACNET_PROPERTY_ID = 410;
pub const BACNET_PROPERTY_ID_PROP_IP_SUBNET_MASK: BACNET_PROPERTY_ID = 411;
pub const BACNET_PROPERTY_ID_PROP_BACNET_IP_UDP_PORT: BACNET_PROPERTY_ID = 412;
pub const BACNET_PROPERTY_ID_PROP_BBMD_ACCEPT_FD_REGISTRATIONS: BACNET_PROPERTY_ID = 413;
pub const BACNET_PROPERTY_ID_PROP_BBMD_BROADCAST_DISTRIBUTION_TABLE: BACNET_PROPERTY_ID = 414;
pub const BACNET_PROPERTY_ID_PROP_BBMD_FOREIGN_DEVICE_TABLE: BACNET_PROPERTY_ID = 415;
pub const BACNET_PROPERTY_ID_PROP_CHANGES_PENDING: BACNET_PROPERTY_ID = 416;
pub const BACNET_PROPERTY_ID_PROP_COMMAND: BACNET_PROPERTY_ID = 417;
pub const BACNET_PROPERTY_ID_PROP_FD_BBMD_ADDRESS: BACNET_PROPERTY_ID = 418;
pub const BACNET_PROPERTY_ID_PROP_FD_SUBSCRIPTION_LIFETIME: BACNET_PROPERTY_ID = 419;
pub const BACNET_PROPERTY_ID_PROP_LINK_SPEED: BACNET_PROPERTY_ID = 420;
pub const BACNET_PROPERTY_ID_PROP_LINK_SPEEDS: BACNET_PROPERTY_ID = 421;
pub const BACNET_PROPERTY_ID_PROP_LINK_SPEED_AUTONEGOTIATE: BACNET_PROPERTY_ID = 422;
pub const BACNET_PROPERTY_ID_PROP_MAC_ADDRESS: BACNET_PROPERTY_ID = 423;
pub const BACNET_PROPERTY_ID_PROP_NETWORK_INTERFACE_NAME: BACNET_PROPERTY_ID = 424;
pub const BACNET_PROPERTY_ID_PROP_NETWORK_NUMBER: BACNET_PROPERTY_ID = 425;
pub const BACNET_PROPERTY_ID_PROP_NETWORK_NUMBER_QUALITY: BACNET_PROPERTY_ID = 426;
pub const BACNET_PROPERTY_ID_PROP_NETWORK_TYPE: BACNET_PROPERTY_ID = 427;
pub const BACNET_PROPERTY_ID_PROP_ROUTING_TABLE: BACNET_PROPERTY_ID = 428;
pub const BACNET_PROPERTY_ID_PROP_VIRTUAL_MAC_ADDRESS_TABLE: BACNET_PROPERTY_ID = 429;
pub const BACNET_PROPERTY_ID_PROP_COMMAND_TIME_ARRAY: BACNET_PROPERTY_ID = 430;
pub const BACNET_PROPERTY_ID_PROP_CURRENT_COMMAND_PRIORITY: BACNET_PROPERTY_ID = 431;
pub const BACNET_PROPERTY_ID_PROP_LAST_COMMAND_TIME: BACNET_PROPERTY_ID = 432;
pub const BACNET_PROPERTY_ID_PROP_VALUE_SOURCE: BACNET_PROPERTY_ID = 433;
pub const BACNET_PROPERTY_ID_PROP_VALUE_SOURCE_ARRAY: BACNET_PROPERTY_ID = 434;
pub const BACNET_PROPERTY_ID_PROP_BACNET_IPV6_MODE: BACNET_PROPERTY_ID = 435;
pub const BACNET_PROPERTY_ID_PROP_IPV6_ADDRESS: BACNET_PROPERTY_ID = 436;
pub const BACNET_PROPERTY_ID_PROP_IPV6_PREFIX_LENGTH: BACNET_PROPERTY_ID = 437;
pub const BACNET_PROPERTY_ID_PROP_BACNET_IPV6_UDP_PORT: BACNET_PROPERTY_ID = 438;
pub const BACNET_PROPERTY_ID_PROP_IPV6_DEFAULT_GATEWAY: BACNET_PROPERTY_ID = 439;
pub const BACNET_PROPERTY_ID_PROP_BACNET_IPV6_MULTICAST_ADDRESS: BACNET_PROPERTY_ID = 440;
pub const BACNET_PROPERTY_ID_PROP_IPV6_DNS_SERVER: BACNET_PROPERTY_ID = 441;
pub const BACNET_PROPERTY_ID_PROP_IPV6_AUTO_ADDRESSING_ENABLE: BACNET_PROPERTY_ID = 442;
pub const BACNET_PROPERTY_ID_PROP_IPV6_DHCP_LEASE_TIME: BACNET_PROPERTY_ID = 443;
pub const BACNET_PROPERTY_ID_PROP_IPV6_DHCP_LEASE_TIME_REMAINING: BACNET_PROPERTY_ID = 444;
pub const BACNET_PROPERTY_ID_PROP_IPV6_DHCP_SERVER: BACNET_PROPERTY_ID = 445;
pub const BACNET_PROPERTY_ID_PROP_IPV6_ZONE_INDEX: BACNET_PROPERTY_ID = 446;
pub const BACNET_PROPERTY_ID_PROP_ASSIGNED_LANDING_CALLS: BACNET_PROPERTY_ID = 447;
pub const BACNET_PROPERTY_ID_PROP_CAR_ASSIGNED_DIRECTION: BACNET_PROPERTY_ID = 448;
pub const BACNET_PROPERTY_ID_PROP_CAR_DOOR_COMMAND: BACNET_PROPERTY_ID = 449;
pub const BACNET_PROPERTY_ID_PROP_CAR_DOOR_STATUS: BACNET_PROPERTY_ID = 450;
pub const BACNET_PROPERTY_ID_PROP_CAR_DOOR_TEXT: BACNET_PROPERTY_ID = 451;
pub const BACNET_PROPERTY_ID_PROP_CAR_DOOR_ZONE: BACNET_PROPERTY_ID = 452;
pub const BACNET_PROPERTY_ID_PROP_CAR_DRIVE_STATUS: BACNET_PROPERTY_ID = 453;
pub const BACNET_PROPERTY_ID_PROP_CAR_LOAD: BACNET_PROPERTY_ID = 454;
pub const BACNET_PROPERTY_ID_PROP_CAR_LOAD_UNITS: BACNET_PROPERTY_ID = 455;
pub const BACNET_PROPERTY_ID_PROP_CAR_MODE: BACNET_PROPERTY_ID = 456;
pub const BACNET_PROPERTY_ID_PROP_CAR_MOVING_DIRECTION: BACNET_PROPERTY_ID = 457;
pub const BACNET_PROPERTY_ID_PROP_CAR_POSITION: BACNET_PROPERTY_ID = 458;
pub const BACNET_PROPERTY_ID_PROP_ELEVATOR_GROUP: BACNET_PROPERTY_ID = 459;
pub const BACNET_PROPERTY_ID_PROP_ENERGY_METER: BACNET_PROPERTY_ID = 460;
pub const BACNET_PROPERTY_ID_PROP_ENERGY_METER_REF: BACNET_PROPERTY_ID = 461;
pub const BACNET_PROPERTY_ID_PROP_ESCALATOR_MODE: BACNET_PROPERTY_ID = 462;
pub const BACNET_PROPERTY_ID_PROP_FAULT_SIGNALS: BACNET_PROPERTY_ID = 463;
pub const BACNET_PROPERTY_ID_PROP_FLOOR_TEXT: BACNET_PROPERTY_ID = 464;
pub const BACNET_PROPERTY_ID_PROP_GROUP_ID: BACNET_PROPERTY_ID = 465;
pub const BACNET_PROPERTY_ID_PROP_GROUP_MODE: BACNET_PROPERTY_ID = 467;
pub const BACNET_PROPERTY_ID_PROP_HIGHER_DECK: BACNET_PROPERTY_ID = 468;
pub const BACNET_PROPERTY_ID_PROP_INSTALLATION_ID: BACNET_PROPERTY_ID = 469;
pub const BACNET_PROPERTY_ID_PROP_LANDING_CALLS: BACNET_PROPERTY_ID = 470;
pub const BACNET_PROPERTY_ID_PROP_LANDING_CALL_CONTROL: BACNET_PROPERTY_ID = 471;
pub const BACNET_PROPERTY_ID_PROP_LANDING_DOOR_STATUS: BACNET_PROPERTY_ID = 472;
pub const BACNET_PROPERTY_ID_PROP_LOWER_DECK: BACNET_PROPERTY_ID = 473;
pub const BACNET_PROPERTY_ID_PROP_MACHINE_ROOM_ID: BACNET_PROPERTY_ID = 474;
pub const BACNET_PROPERTY_ID_PROP_MAKING_CAR_CALL: BACNET_PROPERTY_ID = 475;
pub const BACNET_PROPERTY_ID_PROP_NEXT_STOPPING_FLOOR: BACNET_PROPERTY_ID = 476;
pub const BACNET_PROPERTY_ID_PROP_OPERATION_DIRECTION: BACNET_PROPERTY_ID = 477;
pub const BACNET_PROPERTY_ID_PROP_PASSENGER_ALARM: BACNET_PROPERTY_ID = 478;
pub const BACNET_PROPERTY_ID_PROP_POWER_MODE: BACNET_PROPERTY_ID = 479;
pub const BACNET_PROPERTY_ID_PROP_REGISTERED_CAR_CALL: BACNET_PROPERTY_ID = 480;
pub const BACNET_PROPERTY_ID_PROP_ACTIVE_COV_MULTIPLE_SUBSCRIPTIONS: BACNET_PROPERTY_ID = 481;
pub const BACNET_PROPERTY_ID_PROP_PROTOCOL_LEVEL: BACNET_PROPERTY_ID = 482;
pub const BACNET_PROPERTY_ID_PROP_REFERENCE_PORT: BACNET_PROPERTY_ID = 483;
pub const BACNET_PROPERTY_ID_PROP_DEPLOYED_PROFILE_LOCATION: BACNET_PROPERTY_ID = 484;
pub const BACNET_PROPERTY_ID_PROP_PROFILE_LOCATION: BACNET_PROPERTY_ID = 485;
pub const BACNET_PROPERTY_ID_PROP_TAGS: BACNET_PROPERTY_ID = 486;
pub const BACNET_PROPERTY_ID_PROP_SUBORDINATE_NODE_TYPES: BACNET_PROPERTY_ID = 487;
pub const BACNET_PROPERTY_ID_PROP_SUBORDINATE_TAGS: BACNET_PROPERTY_ID = 488;
pub const BACNET_PROPERTY_ID_PROP_SUBORDINATE_RELATIONSHIPS: BACNET_PROPERTY_ID = 489;
pub const BACNET_PROPERTY_ID_PROP_DEFAULT_SUBORDINATE_RELATIONSHIP: BACNET_PROPERTY_ID = 490;
pub const BACNET_PROPERTY_ID_PROP_REPRESENTS: BACNET_PROPERTY_ID = 491;
pub const BACNET_PROPERTY_ID_PROP_DEFAULT_PRESENT_VALUE: BACNET_PROPERTY_ID = 492;
pub const BACNET_PROPERTY_ID_PROP_PRESENT_STAGE: BACNET_PROPERTY_ID = 493;
pub const BACNET_PROPERTY_ID_PROP_STAGES: BACNET_PROPERTY_ID = 494;
pub const BACNET_PROPERTY_ID_PROP_STAGE_NAMES: BACNET_PROPERTY_ID = 495;
pub const BACNET_PROPERTY_ID_PROP_TARGET_REFERENCES: BACNET_PROPERTY_ID = 496;
pub const BACNET_PROPERTY_ID_PROP_AUDIT_SOURCE_LEVEL: BACNET_PROPERTY_ID = 497;
pub const BACNET_PROPERTY_ID_PROP_AUDIT_LEVEL: BACNET_PROPERTY_ID = 498;
pub const BACNET_PROPERTY_ID_PROP_AUDIT_NOTIFICATION_RECIPIENT: BACNET_PROPERTY_ID = 499;
pub const BACNET_PROPERTY_ID_PROP_AUDIT_PRIORITY_FILTER: BACNET_PROPERTY_ID = 500;
pub const BACNET_PROPERTY_ID_PROP_AUDITABLE_OPERATIONS: BACNET_PROPERTY_ID = 501;
pub const BACNET_PROPERTY_ID_PROP_DELETE_ON_FORWARD: BACNET_PROPERTY_ID = 502;
pub const BACNET_PROPERTY_ID_PROP_MAXIMUM_SEND_DELAY: BACNET_PROPERTY_ID = 503;
pub const BACNET_PROPERTY_ID_PROP_MONITORED_OBJECTS: BACNET_PROPERTY_ID = 504;
pub const BACNET_PROPERTY_ID_PROP_SEND_NOW: BACNET_PROPERTY_ID = 505;
pub const BACNET_PROPERTY_ID_PROP_FLOOR_NUMBER: BACNET_PROPERTY_ID = 506;
pub const BACNET_PROPERTY_ID_PROP_DEVICE_UUID: BACNET_PROPERTY_ID = 507;
pub const BACNET_PROPERTY_ID_PROP_ADDITIONAL_REFERENCE_PORTS: BACNET_PROPERTY_ID = 508;
pub const BACNET_PROPERTY_ID_PROP_CERTIFICATE_SIGNING_REQUEST_FILE: BACNET_PROPERTY_ID = 509;
pub const BACNET_PROPERTY_ID_PROP_COMMAND_VALIDATION_RESULT: BACNET_PROPERTY_ID = 510;
pub const BACNET_PROPERTY_ID_PROP_ISSUER_CERTIFICATE_FILES: BACNET_PROPERTY_ID = 511;
pub const BACNET_PROPERTY_ID_PROP_RESERVED_RANGE_MAX: BACNET_PROPERTY_ID = 511;
pub const BACNET_PROPERTY_ID_PROP_PROPRIETARY_RANGE_MIN: BACNET_PROPERTY_ID = 512;
pub const BACNET_PROPERTY_ID_PROP_PROPRIETARY_RANGE_MAX: BACNET_PROPERTY_ID = 4194303;
pub const BACNET_PROPERTY_ID_PROP_RESERVED_RANGE_MIN2: BACNET_PROPERTY_ID = 4194304;
pub const BACNET_PROPERTY_ID_PROP_MAX_BVLC_LENGTH_ACCEPTED: BACNET_PROPERTY_ID = 4194304;
pub const BACNET_PROPERTY_ID_PROP_MAX_NPDU_LENGTH_ACCEPTED: BACNET_PROPERTY_ID = 4194305;
pub const BACNET_PROPERTY_ID_PROP_OPERATIONAL_CERTIFICATE_FILE: BACNET_PROPERTY_ID = 4194306;
pub const BACNET_PROPERTY_ID_PROP_CURRENT_HEALTH: BACNET_PROPERTY_ID = 4194307;
pub const BACNET_PROPERTY_ID_PROP_SC_CONNECT_WAIT_TIMEOUT: BACNET_PROPERTY_ID = 4194308;
pub const BACNET_PROPERTY_ID_PROP_SC_DIRECT_CONNECT_ACCEPT_ENABLE: BACNET_PROPERTY_ID = 4194309;
pub const BACNET_PROPERTY_ID_PROP_SC_DIRECT_CONNECT_ACCEPT_URIS: BACNET_PROPERTY_ID = 4194310;
pub const BACNET_PROPERTY_ID_PROP_SC_DIRECT_CONNECT_BINDING: BACNET_PROPERTY_ID = 4194311;
pub const BACNET_PROPERTY_ID_PROP_SC_DIRECT_CONNECT_CONNECTION_STATUS: BACNET_PROPERTY_ID = 4194312;
pub const BACNET_PROPERTY_ID_PROP_SC_DIRECT_CONNECT_INITIATE_ENABLE: BACNET_PROPERTY_ID = 4194313;
pub const BACNET_PROPERTY_ID_PROP_SC_DISCONNECT_WAIT_TIMEOUT: BACNET_PROPERTY_ID = 4194314;
pub const BACNET_PROPERTY_ID_PROP_SC_FAILED_CONNECTION_REQUESTS: BACNET_PROPERTY_ID = 4194315;
pub const BACNET_PROPERTY_ID_PROP_SC_FAILOVER_HUB_CONNECTION_STATUS: BACNET_PROPERTY_ID = 4194316;
pub const BACNET_PROPERTY_ID_PROP_SC_FAILOVER_HUB_URI: BACNET_PROPERTY_ID = 4194317;
pub const BACNET_PROPERTY_ID_PROP_SC_HUB_CONNECTOR_STATE: BACNET_PROPERTY_ID = 4194318;
pub const BACNET_PROPERTY_ID_PROP_SC_HUB_FUNCTION_ACCEPT_URIS: BACNET_PROPERTY_ID = 4194319;
pub const BACNET_PROPERTY_ID_PROP_SC_HUB_FUNCTION_BINDING: BACNET_PROPERTY_ID = 4194320;
pub const BACNET_PROPERTY_ID_PROP_SC_HUB_FUNCTION_CONNECTION_STATUS: BACNET_PROPERTY_ID = 4194321;
pub const BACNET_PROPERTY_ID_PROP_SC_HUB_FUNCTION_ENABLE: BACNET_PROPERTY_ID = 4194322;
pub const BACNET_PROPERTY_ID_PROP_SC_HEARTBEAT_TIMEOUT: BACNET_PROPERTY_ID = 4194323;
pub const BACNET_PROPERTY_ID_PROP_SC_PRIMARY_HUB_CONNECTION_STATUS: BACNET_PROPERTY_ID = 4194324;
pub const BACNET_PROPERTY_ID_PROP_SC_PRIMARY_HUB_URI: BACNET_PROPERTY_ID = 4194325;
pub const BACNET_PROPERTY_ID_PROP_SC_MAXIMUM_RECONNECT_TIME: BACNET_PROPERTY_ID = 4194326;
pub const BACNET_PROPERTY_ID_PROP_SC_MINIMUM_RECONNECT_TIME: BACNET_PROPERTY_ID = 4194327;
pub const BACNET_PROPERTY_ID_PROP_COLOR_OVERRIDE: BACNET_PROPERTY_ID = 4194328;
pub const BACNET_PROPERTY_ID_PROP_COLOR_REFERENCE: BACNET_PROPERTY_ID = 4194329;
pub const BACNET_PROPERTY_ID_PROP_DEFAULT_COLOR: BACNET_PROPERTY_ID = 4194330;
pub const BACNET_PROPERTY_ID_PROP_DEFAULT_COLOR_TEMPERATURE: BACNET_PROPERTY_ID = 4194331;
pub const BACNET_PROPERTY_ID_PROP_OVERRIDE_COLOR_REFERENCE: BACNET_PROPERTY_ID = 4194332;
pub const BACNET_PROPERTY_ID_PROP_COLOR_COMMAND: BACNET_PROPERTY_ID = 4194334;
pub const BACNET_PROPERTY_ID_PROP_HIGH_END_TRIM: BACNET_PROPERTY_ID = 4194335;
pub const BACNET_PROPERTY_ID_PROP_LOW_END_TRIM: BACNET_PROPERTY_ID = 4194336;
pub const BACNET_PROPERTY_ID_PROP_TRIM_FADE_TIME: BACNET_PROPERTY_ID = 4194337;
pub const BACNET_PROPERTY_ID_MAX_BACNET_PROPERTY_ID: BACNET_PROPERTY_ID = 16777215;
pub type BACNET_PROPERTY_ID = ::std::os::raw::c_uint;
pub const BACNET_LIMIT_ENABLE_EVENT_LOW_LIMIT_ENABLE: BACNET_LIMIT_ENABLE = 1;
pub const BACNET_LIMIT_ENABLE_EVENT_HIGH_LIMIT_ENABLE: BACNET_LIMIT_ENABLE = 2;
pub type BACNET_LIMIT_ENABLE = ::std::os::raw::c_uint;
pub const BACNET_ACTION_ACTION_DIRECT: BACNET_ACTION = 0;
pub const BACNET_ACTION_ACTION_REVERSE: BACNET_ACTION = 1;
pub type BACNET_ACTION = ::std::os::raw::c_uint;
pub const BACNET_BINARY_PV_MIN_BINARY_PV: BACNET_BINARY_PV = 0;
pub const BACNET_BINARY_PV_BINARY_INACTIVE: BACNET_BINARY_PV = 0;
pub const BACNET_BINARY_PV_BINARY_ACTIVE: BACNET_BINARY_PV = 1;
pub const BACNET_BINARY_PV_MAX_BINARY_PV: BACNET_BINARY_PV = 1;
pub const BACNET_BINARY_PV_BINARY_NULL: BACNET_BINARY_PV = 255;
pub type BACNET_BINARY_PV = ::std::os::raw::c_uint;
pub const BACNET_ACTION_VALUE_TYPE_ACTION_BINARY_PV: BACNET_ACTION_VALUE_TYPE = 0;
pub const BACNET_ACTION_VALUE_TYPE_ACTION_UNSIGNED: BACNET_ACTION_VALUE_TYPE = 1;
pub const BACNET_ACTION_VALUE_TYPE_ACTION_FLOAT: BACNET_ACTION_VALUE_TYPE = 2;
pub type BACNET_ACTION_VALUE_TYPE = ::std::os::raw::c_uint;
pub const BACNET_EVENT_STATE_EVENT_STATE_NORMAL: BACNET_EVENT_STATE = 0;
pub const BACNET_EVENT_STATE_EVENT_STATE_FAULT: BACNET_EVENT_STATE = 1;
pub const BACNET_EVENT_STATE_EVENT_STATE_OFFNORMAL: BACNET_EVENT_STATE = 2;
pub const BACNET_EVENT_STATE_EVENT_STATE_HIGH_LIMIT: BACNET_EVENT_STATE = 3;
pub const BACNET_EVENT_STATE_EVENT_STATE_LOW_LIMIT: BACNET_EVENT_STATE = 4;
pub const BACNET_EVENT_STATE_EVENT_STATE_MAX: BACNET_EVENT_STATE = 5;
pub type BACNET_EVENT_STATE = ::std::os::raw::c_uint;
pub const BACNET_EVENT_ENABLE_EVENT_ENABLE_TO_OFFNORMAL: BACNET_EVENT_ENABLE = 1;
pub const BACNET_EVENT_ENABLE_EVENT_ENABLE_TO_FAULT: BACNET_EVENT_ENABLE = 2;
pub const BACNET_EVENT_ENABLE_EVENT_ENABLE_TO_NORMAL: BACNET_EVENT_ENABLE = 4;
pub type BACNET_EVENT_ENABLE = ::std::os::raw::c_uint;
pub const BACNET_DEVICE_STATUS_STATUS_OPERATIONAL: BACNET_DEVICE_STATUS = 0;
pub const BACNET_DEVICE_STATUS_STATUS_OPERATIONAL_READ_ONLY: BACNET_DEVICE_STATUS = 1;
pub const BACNET_DEVICE_STATUS_STATUS_DOWNLOAD_REQUIRED: BACNET_DEVICE_STATUS = 2;
pub const BACNET_DEVICE_STATUS_STATUS_DOWNLOAD_IN_PROGRESS: BACNET_DEVICE_STATUS = 3;
pub const BACNET_DEVICE_STATUS_STATUS_NON_OPERATIONAL: BACNET_DEVICE_STATUS = 4;
pub const BACNET_DEVICE_STATUS_STATUS_BACKUP_IN_PROGRESS: BACNET_DEVICE_STATUS = 5;
pub const BACNET_DEVICE_STATUS_MAX_DEVICE_STATUS: BACNET_DEVICE_STATUS = 6;
pub type BACNET_DEVICE_STATUS = ::std::os::raw::c_uint;
pub const BACNET_ENGINEERING_UNITS_UNITS_METERS_PER_SECOND_PER_SECOND: BACNET_ENGINEERING_UNITS =
    166;
pub const BACNET_ENGINEERING_UNITS_UNITS_SQUARE_METERS: BACNET_ENGINEERING_UNITS = 0;
pub const BACNET_ENGINEERING_UNITS_UNITS_SQUARE_CENTIMETERS: BACNET_ENGINEERING_UNITS = 116;
pub const BACNET_ENGINEERING_UNITS_UNITS_SQUARE_FEET: BACNET_ENGINEERING_UNITS = 1;
pub const BACNET_ENGINEERING_UNITS_UNITS_SQUARE_INCHES: BACNET_ENGINEERING_UNITS = 115;
pub const BACNET_ENGINEERING_UNITS_UNITS_CURRENCY1: BACNET_ENGINEERING_UNITS = 105;
pub const BACNET_ENGINEERING_UNITS_UNITS_CURRENCY2: BACNET_ENGINEERING_UNITS = 106;
pub const BACNET_ENGINEERING_UNITS_UNITS_CURRENCY3: BACNET_ENGINEERING_UNITS = 107;
pub const BACNET_ENGINEERING_UNITS_UNITS_CURRENCY4: BACNET_ENGINEERING_UNITS = 108;
pub const BACNET_ENGINEERING_UNITS_UNITS_CURRENCY5: BACNET_ENGINEERING_UNITS = 109;
pub const BACNET_ENGINEERING_UNITS_UNITS_CURRENCY6: BACNET_ENGINEERING_UNITS = 110;
pub const BACNET_ENGINEERING_UNITS_UNITS_CURRENCY7: BACNET_ENGINEERING_UNITS = 111;
pub const BACNET_ENGINEERING_UNITS_UNITS_CURRENCY8: BACNET_ENGINEERING_UNITS = 112;
pub const BACNET_ENGINEERING_UNITS_UNITS_CURRENCY9: BACNET_ENGINEERING_UNITS = 113;
pub const BACNET_ENGINEERING_UNITS_UNITS_CURRENCY10: BACNET_ENGINEERING_UNITS = 114;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIAMPERES: BACNET_ENGINEERING_UNITS = 2;
pub const BACNET_ENGINEERING_UNITS_UNITS_AMPERES: BACNET_ENGINEERING_UNITS = 3;
pub const BACNET_ENGINEERING_UNITS_UNITS_AMPERES_PER_METER: BACNET_ENGINEERING_UNITS = 167;
pub const BACNET_ENGINEERING_UNITS_UNITS_AMPERES_PER_SQUARE_METER: BACNET_ENGINEERING_UNITS = 168;
pub const BACNET_ENGINEERING_UNITS_UNITS_AMPERE_SQUARE_METERS: BACNET_ENGINEERING_UNITS = 169;
pub const BACNET_ENGINEERING_UNITS_UNITS_DECIBELS: BACNET_ENGINEERING_UNITS = 199;
pub const BACNET_ENGINEERING_UNITS_UNITS_DECIBELS_MILLIVOLT: BACNET_ENGINEERING_UNITS = 200;
pub const BACNET_ENGINEERING_UNITS_UNITS_DECIBELS_VOLT: BACNET_ENGINEERING_UNITS = 201;
pub const BACNET_ENGINEERING_UNITS_UNITS_FARADS: BACNET_ENGINEERING_UNITS = 170;
pub const BACNET_ENGINEERING_UNITS_UNITS_HENRYS: BACNET_ENGINEERING_UNITS = 171;
pub const BACNET_ENGINEERING_UNITS_UNITS_OHMS: BACNET_ENGINEERING_UNITS = 4;
pub const BACNET_ENGINEERING_UNITS_UNITS_OHM_METERS: BACNET_ENGINEERING_UNITS = 172;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIOHMS: BACNET_ENGINEERING_UNITS = 145;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOHMS: BACNET_ENGINEERING_UNITS = 122;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGOHMS: BACNET_ENGINEERING_UNITS = 123;
pub const BACNET_ENGINEERING_UNITS_UNITS_MICROSIEMENS: BACNET_ENGINEERING_UNITS = 190;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLISIEMENS: BACNET_ENGINEERING_UNITS = 202;
pub const BACNET_ENGINEERING_UNITS_UNITS_SIEMENS: BACNET_ENGINEERING_UNITS = 173;
pub const BACNET_ENGINEERING_UNITS_UNITS_SIEMENS_PER_METER: BACNET_ENGINEERING_UNITS = 174;
pub const BACNET_ENGINEERING_UNITS_UNITS_TESLAS: BACNET_ENGINEERING_UNITS = 175;
pub const BACNET_ENGINEERING_UNITS_UNITS_VOLTS: BACNET_ENGINEERING_UNITS = 5;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIVOLTS: BACNET_ENGINEERING_UNITS = 124;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOVOLTS: BACNET_ENGINEERING_UNITS = 6;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAVOLTS: BACNET_ENGINEERING_UNITS = 7;
pub const BACNET_ENGINEERING_UNITS_UNITS_VOLT_AMPERES: BACNET_ENGINEERING_UNITS = 8;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOVOLT_AMPERES: BACNET_ENGINEERING_UNITS = 9;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAVOLT_AMPERES: BACNET_ENGINEERING_UNITS = 10;
pub const BACNET_ENGINEERING_UNITS_UNITS_VOLT_AMPERES_REACTIVE: BACNET_ENGINEERING_UNITS = 11;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOVOLT_AMPERES_REACTIVE: BACNET_ENGINEERING_UNITS = 12;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAVOLT_AMPERES_REACTIVE: BACNET_ENGINEERING_UNITS = 13;
pub const BACNET_ENGINEERING_UNITS_UNITS_VOLTS_PER_DEGREE_KELVIN: BACNET_ENGINEERING_UNITS = 176;
pub const BACNET_ENGINEERING_UNITS_UNITS_VOLTS_PER_METER: BACNET_ENGINEERING_UNITS = 177;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREES_PHASE: BACNET_ENGINEERING_UNITS = 14;
pub const BACNET_ENGINEERING_UNITS_UNITS_POWER_FACTOR: BACNET_ENGINEERING_UNITS = 15;
pub const BACNET_ENGINEERING_UNITS_UNITS_WEBERS: BACNET_ENGINEERING_UNITS = 178;
pub const BACNET_ENGINEERING_UNITS_UNITS_JOULES: BACNET_ENGINEERING_UNITS = 16;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOJOULES: BACNET_ENGINEERING_UNITS = 17;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOJOULES_PER_KILOGRAM: BACNET_ENGINEERING_UNITS = 125;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAJOULES: BACNET_ENGINEERING_UNITS = 126;
pub const BACNET_ENGINEERING_UNITS_UNITS_WATT_HOURS: BACNET_ENGINEERING_UNITS = 18;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOWATT_HOURS: BACNET_ENGINEERING_UNITS = 19;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAWATT_HOURS: BACNET_ENGINEERING_UNITS = 146;
pub const BACNET_ENGINEERING_UNITS_UNITS_WATT_HOURS_REACTIVE: BACNET_ENGINEERING_UNITS = 203;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOWATT_HOURS_REACTIVE: BACNET_ENGINEERING_UNITS = 204;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAWATT_HOURS_REACTIVE: BACNET_ENGINEERING_UNITS = 205;
pub const BACNET_ENGINEERING_UNITS_UNITS_BTUS: BACNET_ENGINEERING_UNITS = 20;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILO_BTUS: BACNET_ENGINEERING_UNITS = 147;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGA_BTUS: BACNET_ENGINEERING_UNITS = 148;
pub const BACNET_ENGINEERING_UNITS_UNITS_THERMS: BACNET_ENGINEERING_UNITS = 21;
pub const BACNET_ENGINEERING_UNITS_UNITS_TON_HOURS: BACNET_ENGINEERING_UNITS = 22;
pub const BACNET_ENGINEERING_UNITS_UNITS_JOULES_PER_KILOGRAM_DRY_AIR: BACNET_ENGINEERING_UNITS = 23;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOJOULES_PER_KILOGRAM_DRY_AIR: BACNET_ENGINEERING_UNITS =
    149;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAJOULES_PER_KILOGRAM_DRY_AIR: BACNET_ENGINEERING_UNITS =
    150;
pub const BACNET_ENGINEERING_UNITS_UNITS_BTUS_PER_POUND_DRY_AIR: BACNET_ENGINEERING_UNITS = 24;
pub const BACNET_ENGINEERING_UNITS_UNITS_BTUS_PER_POUND: BACNET_ENGINEERING_UNITS = 117;
pub const BACNET_ENGINEERING_UNITS_UNITS_JOULES_PER_DEGREE_KELVIN: BACNET_ENGINEERING_UNITS = 127;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOJOULES_PER_DEGREE_KELVIN: BACNET_ENGINEERING_UNITS =
    151;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAJOULES_PER_DEGREE_KELVIN: BACNET_ENGINEERING_UNITS =
    152;
pub const BACNET_ENGINEERING_UNITS_UNITS_JOULES_PER_KILOGRAM_DEGREE_KELVIN:
    BACNET_ENGINEERING_UNITS = 128;
pub const BACNET_ENGINEERING_UNITS_UNITS_NEWTON: BACNET_ENGINEERING_UNITS = 153;
pub const BACNET_ENGINEERING_UNITS_UNITS_CYCLES_PER_HOUR: BACNET_ENGINEERING_UNITS = 25;
pub const BACNET_ENGINEERING_UNITS_UNITS_CYCLES_PER_MINUTE: BACNET_ENGINEERING_UNITS = 26;
pub const BACNET_ENGINEERING_UNITS_UNITS_HERTZ: BACNET_ENGINEERING_UNITS = 27;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOHERTZ: BACNET_ENGINEERING_UNITS = 129;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAHERTZ: BACNET_ENGINEERING_UNITS = 130;
pub const BACNET_ENGINEERING_UNITS_UNITS_PER_HOUR: BACNET_ENGINEERING_UNITS = 131;
pub const BACNET_ENGINEERING_UNITS_UNITS_GRAMS_OF_WATER_PER_KILOGRAM_DRY_AIR:
    BACNET_ENGINEERING_UNITS = 28;
pub const BACNET_ENGINEERING_UNITS_UNITS_PERCENT_RELATIVE_HUMIDITY: BACNET_ENGINEERING_UNITS = 29;
pub const BACNET_ENGINEERING_UNITS_UNITS_MICROMETERS: BACNET_ENGINEERING_UNITS = 194;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIMETERS: BACNET_ENGINEERING_UNITS = 30;
pub const BACNET_ENGINEERING_UNITS_UNITS_CENTIMETERS: BACNET_ENGINEERING_UNITS = 118;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOMETERS: BACNET_ENGINEERING_UNITS = 193;
pub const BACNET_ENGINEERING_UNITS_UNITS_METERS: BACNET_ENGINEERING_UNITS = 31;
pub const BACNET_ENGINEERING_UNITS_UNITS_INCHES: BACNET_ENGINEERING_UNITS = 32;
pub const BACNET_ENGINEERING_UNITS_UNITS_FEET: BACNET_ENGINEERING_UNITS = 33;
pub const BACNET_ENGINEERING_UNITS_UNITS_CANDELAS: BACNET_ENGINEERING_UNITS = 179;
pub const BACNET_ENGINEERING_UNITS_UNITS_CANDELAS_PER_SQUARE_METER: BACNET_ENGINEERING_UNITS = 180;
pub const BACNET_ENGINEERING_UNITS_UNITS_WATTS_PER_SQUARE_FOOT: BACNET_ENGINEERING_UNITS = 34;
pub const BACNET_ENGINEERING_UNITS_UNITS_WATTS_PER_SQUARE_METER: BACNET_ENGINEERING_UNITS = 35;
pub const BACNET_ENGINEERING_UNITS_UNITS_LUMENS: BACNET_ENGINEERING_UNITS = 36;
pub const BACNET_ENGINEERING_UNITS_UNITS_LUXES: BACNET_ENGINEERING_UNITS = 37;
pub const BACNET_ENGINEERING_UNITS_UNITS_FOOT_CANDLES: BACNET_ENGINEERING_UNITS = 38;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIGRAMS: BACNET_ENGINEERING_UNITS = 196;
pub const BACNET_ENGINEERING_UNITS_UNITS_GRAMS: BACNET_ENGINEERING_UNITS = 195;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOGRAMS: BACNET_ENGINEERING_UNITS = 39;
pub const BACNET_ENGINEERING_UNITS_UNITS_POUNDS_MASS: BACNET_ENGINEERING_UNITS = 40;
pub const BACNET_ENGINEERING_UNITS_UNITS_TONS: BACNET_ENGINEERING_UNITS = 41;
pub const BACNET_ENGINEERING_UNITS_UNITS_GRAMS_PER_SECOND: BACNET_ENGINEERING_UNITS = 154;
pub const BACNET_ENGINEERING_UNITS_UNITS_GRAMS_PER_MINUTE: BACNET_ENGINEERING_UNITS = 155;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOGRAMS_PER_SECOND: BACNET_ENGINEERING_UNITS = 42;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOGRAMS_PER_MINUTE: BACNET_ENGINEERING_UNITS = 43;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOGRAMS_PER_HOUR: BACNET_ENGINEERING_UNITS = 44;
pub const BACNET_ENGINEERING_UNITS_UNITS_POUNDS_MASS_PER_SECOND: BACNET_ENGINEERING_UNITS = 119;
pub const BACNET_ENGINEERING_UNITS_UNITS_POUNDS_MASS_PER_MINUTE: BACNET_ENGINEERING_UNITS = 45;
pub const BACNET_ENGINEERING_UNITS_UNITS_POUNDS_MASS_PER_HOUR: BACNET_ENGINEERING_UNITS = 46;
pub const BACNET_ENGINEERING_UNITS_UNITS_TONS_PER_HOUR: BACNET_ENGINEERING_UNITS = 156;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIWATTS: BACNET_ENGINEERING_UNITS = 132;
pub const BACNET_ENGINEERING_UNITS_UNITS_WATTS: BACNET_ENGINEERING_UNITS = 47;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOWATTS: BACNET_ENGINEERING_UNITS = 48;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAWATTS: BACNET_ENGINEERING_UNITS = 49;
pub const BACNET_ENGINEERING_UNITS_UNITS_BTUS_PER_HOUR: BACNET_ENGINEERING_UNITS = 50;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILO_BTUS_PER_HOUR: BACNET_ENGINEERING_UNITS = 157;
pub const BACNET_ENGINEERING_UNITS_UNITS_HORSEPOWER: BACNET_ENGINEERING_UNITS = 51;
pub const BACNET_ENGINEERING_UNITS_UNITS_TONS_REFRIGERATION: BACNET_ENGINEERING_UNITS = 52;
pub const BACNET_ENGINEERING_UNITS_UNITS_PASCALS: BACNET_ENGINEERING_UNITS = 53;
pub const BACNET_ENGINEERING_UNITS_UNITS_HECTOPASCALS: BACNET_ENGINEERING_UNITS = 133;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOPASCALS: BACNET_ENGINEERING_UNITS = 54;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIBARS: BACNET_ENGINEERING_UNITS = 134;
pub const BACNET_ENGINEERING_UNITS_UNITS_BARS: BACNET_ENGINEERING_UNITS = 55;
pub const BACNET_ENGINEERING_UNITS_UNITS_POUNDS_FORCE_PER_SQUARE_INCH: BACNET_ENGINEERING_UNITS =
    56;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIMETERS_OF_WATER: BACNET_ENGINEERING_UNITS = 206;
pub const BACNET_ENGINEERING_UNITS_UNITS_CENTIMETERS_OF_WATER: BACNET_ENGINEERING_UNITS = 57;
pub const BACNET_ENGINEERING_UNITS_UNITS_INCHES_OF_WATER: BACNET_ENGINEERING_UNITS = 58;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIMETERS_OF_MERCURY: BACNET_ENGINEERING_UNITS = 59;
pub const BACNET_ENGINEERING_UNITS_UNITS_CENTIMETERS_OF_MERCURY: BACNET_ENGINEERING_UNITS = 60;
pub const BACNET_ENGINEERING_UNITS_UNITS_INCHES_OF_MERCURY: BACNET_ENGINEERING_UNITS = 61;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREES_CELSIUS: BACNET_ENGINEERING_UNITS = 62;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREES_KELVIN: BACNET_ENGINEERING_UNITS = 63;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREES_KELVIN_PER_HOUR: BACNET_ENGINEERING_UNITS = 181;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREES_KELVIN_PER_MINUTE: BACNET_ENGINEERING_UNITS = 182;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREES_FAHRENHEIT: BACNET_ENGINEERING_UNITS = 64;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREE_DAYS_CELSIUS: BACNET_ENGINEERING_UNITS = 65;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREE_DAYS_FAHRENHEIT: BACNET_ENGINEERING_UNITS = 66;
pub const BACNET_ENGINEERING_UNITS_UNITS_DELTA_DEGREES_FAHRENHEIT: BACNET_ENGINEERING_UNITS = 120;
pub const BACNET_ENGINEERING_UNITS_UNITS_DELTA_DEGREES_KELVIN: BACNET_ENGINEERING_UNITS = 121;
pub const BACNET_ENGINEERING_UNITS_UNITS_YEARS: BACNET_ENGINEERING_UNITS = 67;
pub const BACNET_ENGINEERING_UNITS_UNITS_MONTHS: BACNET_ENGINEERING_UNITS = 68;
pub const BACNET_ENGINEERING_UNITS_UNITS_WEEKS: BACNET_ENGINEERING_UNITS = 69;
pub const BACNET_ENGINEERING_UNITS_UNITS_DAYS: BACNET_ENGINEERING_UNITS = 70;
pub const BACNET_ENGINEERING_UNITS_UNITS_HOURS: BACNET_ENGINEERING_UNITS = 71;
pub const BACNET_ENGINEERING_UNITS_UNITS_MINUTES: BACNET_ENGINEERING_UNITS = 72;
pub const BACNET_ENGINEERING_UNITS_UNITS_SECONDS: BACNET_ENGINEERING_UNITS = 73;
pub const BACNET_ENGINEERING_UNITS_UNITS_HUNDREDTHS_SECONDS: BACNET_ENGINEERING_UNITS = 158;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLISECONDS: BACNET_ENGINEERING_UNITS = 159;
pub const BACNET_ENGINEERING_UNITS_UNITS_NEWTON_METERS: BACNET_ENGINEERING_UNITS = 160;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIMETERS_PER_SECOND: BACNET_ENGINEERING_UNITS = 161;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIMETERS_PER_MINUTE: BACNET_ENGINEERING_UNITS = 162;
pub const BACNET_ENGINEERING_UNITS_UNITS_METERS_PER_SECOND: BACNET_ENGINEERING_UNITS = 74;
pub const BACNET_ENGINEERING_UNITS_UNITS_METERS_PER_MINUTE: BACNET_ENGINEERING_UNITS = 163;
pub const BACNET_ENGINEERING_UNITS_UNITS_METERS_PER_HOUR: BACNET_ENGINEERING_UNITS = 164;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOMETERS_PER_HOUR: BACNET_ENGINEERING_UNITS = 75;
pub const BACNET_ENGINEERING_UNITS_UNITS_FEET_PER_SECOND: BACNET_ENGINEERING_UNITS = 76;
pub const BACNET_ENGINEERING_UNITS_UNITS_FEET_PER_MINUTE: BACNET_ENGINEERING_UNITS = 77;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILES_PER_HOUR: BACNET_ENGINEERING_UNITS = 78;
pub const BACNET_ENGINEERING_UNITS_UNITS_CUBIC_FEET: BACNET_ENGINEERING_UNITS = 79;
pub const BACNET_ENGINEERING_UNITS_UNITS_CUBIC_METERS: BACNET_ENGINEERING_UNITS = 80;
pub const BACNET_ENGINEERING_UNITS_UNITS_IMPERIAL_GALLONS: BACNET_ENGINEERING_UNITS = 81;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLILITERS: BACNET_ENGINEERING_UNITS = 197;
pub const BACNET_ENGINEERING_UNITS_UNITS_LITERS: BACNET_ENGINEERING_UNITS = 82;
pub const BACNET_ENGINEERING_UNITS_UNITS_US_GALLONS: BACNET_ENGINEERING_UNITS = 83;
pub const BACNET_ENGINEERING_UNITS_UNITS_CUBIC_FEET_PER_SECOND: BACNET_ENGINEERING_UNITS = 142;
pub const BACNET_ENGINEERING_UNITS_UNITS_CUBIC_FEET_PER_MINUTE: BACNET_ENGINEERING_UNITS = 84;
pub const BACNET_ENGINEERING_UNITS_UNITS_CUBIC_FEET_PER_HOUR: BACNET_ENGINEERING_UNITS = 191;
pub const BACNET_ENGINEERING_UNITS_UNITS_CUBIC_METERS_PER_SECOND: BACNET_ENGINEERING_UNITS = 85;
pub const BACNET_ENGINEERING_UNITS_UNITS_CUBIC_METERS_PER_MINUTE: BACNET_ENGINEERING_UNITS = 165;
pub const BACNET_ENGINEERING_UNITS_UNITS_CUBIC_METERS_PER_HOUR: BACNET_ENGINEERING_UNITS = 135;
pub const BACNET_ENGINEERING_UNITS_UNITS_IMPERIAL_GALLONS_PER_MINUTE: BACNET_ENGINEERING_UNITS = 86;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLILITERS_PER_SECOND: BACNET_ENGINEERING_UNITS = 198;
pub const BACNET_ENGINEERING_UNITS_UNITS_LITERS_PER_SECOND: BACNET_ENGINEERING_UNITS = 87;
pub const BACNET_ENGINEERING_UNITS_UNITS_LITERS_PER_MINUTE: BACNET_ENGINEERING_UNITS = 88;
pub const BACNET_ENGINEERING_UNITS_UNITS_LITERS_PER_HOUR: BACNET_ENGINEERING_UNITS = 136;
pub const BACNET_ENGINEERING_UNITS_UNITS_US_GALLONS_PER_MINUTE: BACNET_ENGINEERING_UNITS = 89;
pub const BACNET_ENGINEERING_UNITS_UNITS_US_GALLONS_PER_HOUR: BACNET_ENGINEERING_UNITS = 192;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREES_ANGULAR: BACNET_ENGINEERING_UNITS = 90;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREES_CELSIUS_PER_HOUR: BACNET_ENGINEERING_UNITS = 91;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREES_CELSIUS_PER_MINUTE: BACNET_ENGINEERING_UNITS = 92;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREES_FAHRENHEIT_PER_HOUR: BACNET_ENGINEERING_UNITS = 93;
pub const BACNET_ENGINEERING_UNITS_UNITS_DEGREES_FAHRENHEIT_PER_MINUTE: BACNET_ENGINEERING_UNITS =
    94;
pub const BACNET_ENGINEERING_UNITS_UNITS_JOULE_SECONDS: BACNET_ENGINEERING_UNITS = 183;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOGRAMS_PER_CUBIC_METER: BACNET_ENGINEERING_UNITS = 186;
pub const BACNET_ENGINEERING_UNITS_UNITS_KW_HOURS_PER_SQUARE_METER: BACNET_ENGINEERING_UNITS = 137;
pub const BACNET_ENGINEERING_UNITS_UNITS_KW_HOURS_PER_SQUARE_FOOT: BACNET_ENGINEERING_UNITS = 138;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAJOULES_PER_SQUARE_METER: BACNET_ENGINEERING_UNITS =
    139;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAJOULES_PER_SQUARE_FOOT: BACNET_ENGINEERING_UNITS = 140;
pub const BACNET_ENGINEERING_UNITS_UNITS_NO_UNITS: BACNET_ENGINEERING_UNITS = 95;
pub const BACNET_ENGINEERING_UNITS_UNITS_NEWTON_SECONDS: BACNET_ENGINEERING_UNITS = 187;
pub const BACNET_ENGINEERING_UNITS_UNITS_NEWTONS_PER_METER: BACNET_ENGINEERING_UNITS = 188;
pub const BACNET_ENGINEERING_UNITS_UNITS_PARTS_PER_MILLION: BACNET_ENGINEERING_UNITS = 96;
pub const BACNET_ENGINEERING_UNITS_UNITS_PARTS_PER_BILLION: BACNET_ENGINEERING_UNITS = 97;
pub const BACNET_ENGINEERING_UNITS_UNITS_PERCENT: BACNET_ENGINEERING_UNITS = 98;
pub const BACNET_ENGINEERING_UNITS_UNITS_PERCENT_OBSCURATION_PER_FOOT: BACNET_ENGINEERING_UNITS =
    143;
pub const BACNET_ENGINEERING_UNITS_UNITS_PERCENT_OBSCURATION_PER_METER: BACNET_ENGINEERING_UNITS =
    144;
pub const BACNET_ENGINEERING_UNITS_UNITS_PERCENT_PER_SECOND: BACNET_ENGINEERING_UNITS = 99;
pub const BACNET_ENGINEERING_UNITS_UNITS_PER_MINUTE: BACNET_ENGINEERING_UNITS = 100;
pub const BACNET_ENGINEERING_UNITS_UNITS_PER_SECOND: BACNET_ENGINEERING_UNITS = 101;
pub const BACNET_ENGINEERING_UNITS_UNITS_PSI_PER_DEGREE_FAHRENHEIT: BACNET_ENGINEERING_UNITS = 102;
pub const BACNET_ENGINEERING_UNITS_UNITS_RADIANS: BACNET_ENGINEERING_UNITS = 103;
pub const BACNET_ENGINEERING_UNITS_UNITS_RADIANS_PER_SECOND: BACNET_ENGINEERING_UNITS = 184;
pub const BACNET_ENGINEERING_UNITS_UNITS_REVOLUTIONS_PER_MINUTE: BACNET_ENGINEERING_UNITS = 104;
pub const BACNET_ENGINEERING_UNITS_UNITS_SQUARE_METERS_PER_NEWTON: BACNET_ENGINEERING_UNITS = 185;
pub const BACNET_ENGINEERING_UNITS_UNITS_WATTS_PER_METER_PER_DEGREE_KELVIN:
    BACNET_ENGINEERING_UNITS = 189;
pub const BACNET_ENGINEERING_UNITS_UNITS_WATTS_PER_SQUARE_METER_DEGREE_KELVIN:
    BACNET_ENGINEERING_UNITS = 141;
pub const BACNET_ENGINEERING_UNITS_UNITS_PER_MILLE: BACNET_ENGINEERING_UNITS = 207;
pub const BACNET_ENGINEERING_UNITS_UNITS_GRAMS_PER_GRAM: BACNET_ENGINEERING_UNITS = 208;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOGRAMS_PER_KILOGRAM: BACNET_ENGINEERING_UNITS = 209;
pub const BACNET_ENGINEERING_UNITS_UNITS_GRAMS_PER_KILOGRAM: BACNET_ENGINEERING_UNITS = 210;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIGRAMS_PER_GRAM: BACNET_ENGINEERING_UNITS = 211;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIGRAMS_PER_KILOGRAM: BACNET_ENGINEERING_UNITS = 212;
pub const BACNET_ENGINEERING_UNITS_UNITS_GRAMS_PER_MILLILITER: BACNET_ENGINEERING_UNITS = 213;
pub const BACNET_ENGINEERING_UNITS_UNITS_GRAMS_PER_LITER: BACNET_ENGINEERING_UNITS = 214;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIGRAMS_PER_LITER: BACNET_ENGINEERING_UNITS = 215;
pub const BACNET_ENGINEERING_UNITS_UNITS_MICROGRAMS_PER_LITER: BACNET_ENGINEERING_UNITS = 216;
pub const BACNET_ENGINEERING_UNITS_UNITS_GRAMS_PER_CUBIC_METER: BACNET_ENGINEERING_UNITS = 217;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIGRAMS_PER_CUBIC_METER: BACNET_ENGINEERING_UNITS = 218;
pub const BACNET_ENGINEERING_UNITS_UNITS_MICROGRAMS_PER_CUBIC_METER: BACNET_ENGINEERING_UNITS = 219;
pub const BACNET_ENGINEERING_UNITS_UNITS_NANOGRAMS_PER_CUBIC_METER: BACNET_ENGINEERING_UNITS = 220;
pub const BACNET_ENGINEERING_UNITS_UNITS_GRAMS_PER_CUBIC_CENTIMETER: BACNET_ENGINEERING_UNITS = 221;
pub const BACNET_ENGINEERING_UNITS_UNITS_BECQUERELS: BACNET_ENGINEERING_UNITS = 222;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOBECQUERELS: BACNET_ENGINEERING_UNITS = 223;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGABECQUERELS: BACNET_ENGINEERING_UNITS = 224;
pub const BACNET_ENGINEERING_UNITS_UNITS_GRAY: BACNET_ENGINEERING_UNITS = 225;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIGRAY: BACNET_ENGINEERING_UNITS = 226;
pub const BACNET_ENGINEERING_UNITS_UNITS_MICROGRAY: BACNET_ENGINEERING_UNITS = 227;
pub const BACNET_ENGINEERING_UNITS_UNITS_SIEVERTS: BACNET_ENGINEERING_UNITS = 228;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLISIEVERTS: BACNET_ENGINEERING_UNITS = 229;
pub const BACNET_ENGINEERING_UNITS_UNITS_MICROSIEVERTS: BACNET_ENGINEERING_UNITS = 230;
pub const BACNET_ENGINEERING_UNITS_UNITS_MICROSIEVERTS_PER_HOUR: BACNET_ENGINEERING_UNITS = 231;
pub const BACNET_ENGINEERING_UNITS_UNITS_DECIBELS_A: BACNET_ENGINEERING_UNITS = 232;
pub const BACNET_ENGINEERING_UNITS_UNITS_NEPHELOMETRIC_TURBIDITY_UNIT: BACNET_ENGINEERING_UNITS =
    233;
pub const BACNET_ENGINEERING_UNITS_UNITS_PH: BACNET_ENGINEERING_UNITS = 234;
pub const BACNET_ENGINEERING_UNITS_UNITS_GRAMS_PER_SQUARE_METER: BACNET_ENGINEERING_UNITS = 235;
pub const BACNET_ENGINEERING_UNITS_UNITS_MINUTES_PER_DEGREE_KELVIN: BACNET_ENGINEERING_UNITS = 236;
pub const BACNET_ENGINEERING_UNITS_UNITS_OHM_METER_SQUARED_PER_METER: BACNET_ENGINEERING_UNITS =
    237;
pub const BACNET_ENGINEERING_UNITS_UNITS_AMPERE_SECONDS: BACNET_ENGINEERING_UNITS = 238;
pub const BACNET_ENGINEERING_UNITS_UNITS_VOLT_AMPERE_HOURS: BACNET_ENGINEERING_UNITS = 239;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOVOLT_AMPERE_HOURS: BACNET_ENGINEERING_UNITS = 240;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAVOLT_AMPERE_HOURS: BACNET_ENGINEERING_UNITS = 241;
pub const BACNET_ENGINEERING_UNITS_UNITS_VOLT_AMPERE_HOURS_REACTIVE: BACNET_ENGINEERING_UNITS = 242;
pub const BACNET_ENGINEERING_UNITS_UNITS_KILOVOLT_AMPERE_HOURS_REACTIVE: BACNET_ENGINEERING_UNITS =
    243;
pub const BACNET_ENGINEERING_UNITS_UNITS_MEGAVOLT_AMPERE_HOURS_REACTIVE: BACNET_ENGINEERING_UNITS =
    244;
pub const BACNET_ENGINEERING_UNITS_UNITS_VOLT_SQUARE_HOURS: BACNET_ENGINEERING_UNITS = 245;
pub const BACNET_ENGINEERING_UNITS_UNITS_AMPERE_SQUARE_HOURS: BACNET_ENGINEERING_UNITS = 246;
pub const BACNET_ENGINEERING_UNITS_UNITS_JOULE_PER_HOURS: BACNET_ENGINEERING_UNITS = 247;
pub const BACNET_ENGINEERING_UNITS_UNITS_CUBIC_FEET_PER_DAY: BACNET_ENGINEERING_UNITS = 248;
pub const BACNET_ENGINEERING_UNITS_UNITS_CUBIC_METERS_PER_DAY: BACNET_ENGINEERING_UNITS = 249;
pub const BACNET_ENGINEERING_UNITS_UNITS_WATT_HOURS_PER_CUBIC_METER: BACNET_ENGINEERING_UNITS = 250;
pub const BACNET_ENGINEERING_UNITS_UNITS_JOULES_PER_CUBIC_METER: BACNET_ENGINEERING_UNITS = 251;
pub const BACNET_ENGINEERING_UNITS_UNITS_MOLE_PERCENT: BACNET_ENGINEERING_UNITS = 252;
pub const BACNET_ENGINEERING_UNITS_UNITS_PASCAL_SECONDS: BACNET_ENGINEERING_UNITS = 253;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLION_STANDARD_CUBIC_FEET_PER_MINUTE:
    BACNET_ENGINEERING_UNITS = 254;
pub const BACNET_ENGINEERING_UNITS_UNITS_RESERVED_RANGE_MAX: BACNET_ENGINEERING_UNITS = 255;
pub const BACNET_ENGINEERING_UNITS_UNITS_PROPRIETARY_RANGE_MIN: BACNET_ENGINEERING_UNITS = 256;
pub const BACNET_ENGINEERING_UNITS_UNITS_PROPRIETARY_RANGE_MAX: BACNET_ENGINEERING_UNITS = 47807;
pub const BACNET_ENGINEERING_UNITS_UNITS_RESERVED_RANGE_MIN2: BACNET_ENGINEERING_UNITS = 47808;
pub const BACNET_ENGINEERING_UNITS_UNITS_STANDARD_CUBIC_FEET_PER_DAY: BACNET_ENGINEERING_UNITS =
    47808;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLION_STANDARD_CUBIC_FEET_PER_DAY:
    BACNET_ENGINEERING_UNITS = 47809;
pub const BACNET_ENGINEERING_UNITS_UNITS_THOUSAND_CUBIC_FEET_PER_DAY: BACNET_ENGINEERING_UNITS =
    47810;
pub const BACNET_ENGINEERING_UNITS_UNITS_THOUSAND_STANDARD_CUBIC_FEET_PER_DAY:
    BACNET_ENGINEERING_UNITS = 47811;
pub const BACNET_ENGINEERING_UNITS_UNITS_POUNDS_MASS_PER_DAY: BACNET_ENGINEERING_UNITS = 47812;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIREMS: BACNET_ENGINEERING_UNITS = 47814;
pub const BACNET_ENGINEERING_UNITS_UNITS_MILLIREMS_PER_HOUR: BACNET_ENGINEERING_UNITS = 47815;
pub const BACNET_ENGINEERING_UNITS_UNITS_RESERVED_RANGE_MAX2: BACNET_ENGINEERING_UNITS = 49999;
pub const BACNET_ENGINEERING_UNITS_UNITS_PROPRIETARY_RANGE_MIN2: BACNET_ENGINEERING_UNITS = 50000;
pub const BACNET_ENGINEERING_UNITS_UNITS_PROPRIETARY_RANGE_MAX2: BACNET_ENGINEERING_UNITS = 65535;
pub type BACNET_ENGINEERING_UNITS = ::std::os::raw::c_uint;
pub const BACNET_POLARITY_POLARITY_NORMAL: BACNET_POLARITY = 0;
pub const BACNET_POLARITY_POLARITY_REVERSE: BACNET_POLARITY = 1;
pub const BACNET_POLARITY_MAX_POLARITY: BACNET_POLARITY = 2;
pub type BACNET_POLARITY = ::std::os::raw::c_uint;
pub const BACNET_PROGRAM_REQUEST_PROGRAM_REQUEST_READY: BACNET_PROGRAM_REQUEST = 0;
pub const BACNET_PROGRAM_REQUEST_PROGRAM_REQUEST_LOAD: BACNET_PROGRAM_REQUEST = 1;
pub const BACNET_PROGRAM_REQUEST_PROGRAM_REQUEST_RUN: BACNET_PROGRAM_REQUEST = 2;
pub const BACNET_PROGRAM_REQUEST_PROGRAM_REQUEST_HALT: BACNET_PROGRAM_REQUEST = 3;
pub const BACNET_PROGRAM_REQUEST_PROGRAM_REQUEST_RESTART: BACNET_PROGRAM_REQUEST = 4;
pub const BACNET_PROGRAM_REQUEST_PROGRAM_REQUEST_UNLOAD: BACNET_PROGRAM_REQUEST = 5;
pub type BACNET_PROGRAM_REQUEST = ::std::os::raw::c_uint;
pub const BACNET_PROGRAM_STATE_PROGRAM_STATE_IDLE: BACNET_PROGRAM_STATE = 0;
pub const BACNET_PROGRAM_STATE_PROGRAM_STATE_LOADING: BACNET_PROGRAM_STATE = 1;
pub const BACNET_PROGRAM_STATE_PROGRAM_STATE_RUNNING: BACNET_PROGRAM_STATE = 2;
pub const BACNET_PROGRAM_STATE_PROGRAM_STATE_WAITING: BACNET_PROGRAM_STATE = 3;
pub const BACNET_PROGRAM_STATE_PROGRAM_STATE_HALTED: BACNET_PROGRAM_STATE = 4;
pub const BACNET_PROGRAM_STATE_PROGRAM_STATE_UNLOADING: BACNET_PROGRAM_STATE = 5;
pub type BACNET_PROGRAM_STATE = ::std::os::raw::c_uint;
pub const BACNET_PROGRAM_ERROR_PROGRAM_ERROR_NORMAL: BACNET_PROGRAM_ERROR = 0;
pub const BACNET_PROGRAM_ERROR_PROGRAM_ERROR_LOAD_FAILED: BACNET_PROGRAM_ERROR = 1;
pub const BACNET_PROGRAM_ERROR_PROGRAM_ERROR_INTERNAL: BACNET_PROGRAM_ERROR = 2;
pub const BACNET_PROGRAM_ERROR_PROGRAM_ERROR_PROGRAM: BACNET_PROGRAM_ERROR = 3;
pub const BACNET_PROGRAM_ERROR_PROGRAM_ERROR_OTHER: BACNET_PROGRAM_ERROR = 4;
pub const BACNET_PROGRAM_ERROR_PROGRAM_ERROR_PROPRIETARY_MIN: BACNET_PROGRAM_ERROR = 64;
pub const BACNET_PROGRAM_ERROR_PROGRAM_ERROR_PROPRIETARY_MAX: BACNET_PROGRAM_ERROR = 65535;
pub type BACNET_PROGRAM_ERROR = ::std::os::raw::c_uint;
pub const BACNET_RESTART_REASON_RESTART_REASON_UNKNOWN: BACNET_RESTART_REASON = 0;
pub const BACNET_RESTART_REASON_RESTART_REASON_COLDSTART: BACNET_RESTART_REASON = 1;
pub const BACNET_RESTART_REASON_RESTART_REASON_WARMSTART: BACNET_RESTART_REASON = 2;
pub const BACNET_RESTART_REASON_RESTART_REASON_DETECTED_POWER_LOST: BACNET_RESTART_REASON = 3;
pub const BACNET_RESTART_REASON_RESTART_REASON_DETECTED_POWER_OFF: BACNET_RESTART_REASON = 4;
pub const BACNET_RESTART_REASON_RESTART_REASON_HARDWARE_WATCHDOG: BACNET_RESTART_REASON = 5;
pub const BACNET_RESTART_REASON_RESTART_REASON_SOFTWARE_WATCHDOG: BACNET_RESTART_REASON = 6;
pub const BACNET_RESTART_REASON_RESTART_REASON_SUSPENDED: BACNET_RESTART_REASON = 7;
pub const BACNET_RESTART_REASON_RESTART_REASON_PROPRIETARY_MIN: BACNET_RESTART_REASON = 64;
pub const BACNET_RESTART_REASON_RESTART_REASON_PROPRIETARY_MAX: BACNET_RESTART_REASON = 255;
pub type BACNET_RESTART_REASON = ::std::os::raw::c_uint;
pub const BACNET_PROPERTY_STATES_PROP_STATE_BOOLEAN_VALUE: BACNET_PROPERTY_STATES = 0;
pub const BACNET_PROPERTY_STATES_PROP_STATE_BINARY_VALUE: BACNET_PROPERTY_STATES = 1;
pub const BACNET_PROPERTY_STATES_PROP_STATE_EVENT_TYPE: BACNET_PROPERTY_STATES = 2;
pub const BACNET_PROPERTY_STATES_PROP_STATE_POLARITY: BACNET_PROPERTY_STATES = 3;
pub const BACNET_PROPERTY_STATES_PROP_STATE_PROGRAM_CHANGE: BACNET_PROPERTY_STATES = 4;
pub const BACNET_PROPERTY_STATES_PROP_STATE_PROGRAM_STATE: BACNET_PROPERTY_STATES = 5;
pub const BACNET_PROPERTY_STATES_PROP_STATE_REASON_FOR_HALT: BACNET_PROPERTY_STATES = 6;
pub const BACNET_PROPERTY_STATES_PROP_STATE_RELIABILITY: BACNET_PROPERTY_STATES = 7;
pub const BACNET_PROPERTY_STATES_PROP_STATE_EVENT_STATE: BACNET_PROPERTY_STATES = 8;
pub const BACNET_PROPERTY_STATES_PROP_STATE_SYSTEM_STATUS: BACNET_PROPERTY_STATES = 9;
pub const BACNET_PROPERTY_STATES_PROP_STATE_UNITS: BACNET_PROPERTY_STATES = 10;
pub const BACNET_PROPERTY_STATES_PROP_STATE_UNSIGNED_VALUE: BACNET_PROPERTY_STATES = 11;
pub const BACNET_PROPERTY_STATES_PROP_STATE_LIFE_SAFETY_MODE: BACNET_PROPERTY_STATES = 12;
pub const BACNET_PROPERTY_STATES_PROP_STATE_LIFE_SAFETY_STATE: BACNET_PROPERTY_STATES = 13;
pub const BACNET_PROPERTY_STATES_PROP_STATE_RESTART_REASON: BACNET_PROPERTY_STATES = 14;
pub const BACNET_PROPERTY_STATES_PROP_STATE_DOOR_ALARM_STATE: BACNET_PROPERTY_STATES = 15;
pub const BACNET_PROPERTY_STATES_PROP_STATE_ACTION: BACNET_PROPERTY_STATES = 16;
pub const BACNET_PROPERTY_STATES_PROP_STATE_DOOR_SECURED_STATUS: BACNET_PROPERTY_STATES = 17;
pub const BACNET_PROPERTY_STATES_PROP_STATE_DOOR_STATUS: BACNET_PROPERTY_STATES = 18;
pub const BACNET_PROPERTY_STATES_PROP_STATE_DOOR_VALUE: BACNET_PROPERTY_STATES = 19;
pub const BACNET_PROPERTY_STATES_PROP_STATE_FILE_ACCESS_METHOD: BACNET_PROPERTY_STATES = 20;
pub const BACNET_PROPERTY_STATES_PROP_STATE_LOCK_STATUS: BACNET_PROPERTY_STATES = 21;
pub const BACNET_PROPERTY_STATES_PROP_STATE_LIFE_SAFETY_OPERATION: BACNET_PROPERTY_STATES = 22;
pub const BACNET_PROPERTY_STATES_PROP_STATE_MAINTENANCE: BACNET_PROPERTY_STATES = 23;
pub const BACNET_PROPERTY_STATES_PROP_STATE_NODE_TYPE: BACNET_PROPERTY_STATES = 24;
pub const BACNET_PROPERTY_STATES_PROP_STATE_NOTIFY_TYPE: BACNET_PROPERTY_STATES = 25;
pub const BACNET_PROPERTY_STATES_PROP_STATE_SECURITY_LEVEL: BACNET_PROPERTY_STATES = 26;
pub const BACNET_PROPERTY_STATES_PROP_STATE_SHED_STATE: BACNET_PROPERTY_STATES = 27;
pub const BACNET_PROPERTY_STATES_PROP_STATE_SILENCED_STATE: BACNET_PROPERTY_STATES = 28;
pub const BACNET_PROPERTY_STATES_PROP_STATE_ACCESS_EVENT: BACNET_PROPERTY_STATES = 30;
pub const BACNET_PROPERTY_STATES_PROP_STATE_ZONE_OCCUPANCY_STATE: BACNET_PROPERTY_STATES = 31;
pub const BACNET_PROPERTY_STATES_PROP_STATE_ACCESS_CRED_DISABLE_REASON: BACNET_PROPERTY_STATES = 32;
pub const BACNET_PROPERTY_STATES_PROP_STATE_ACCESS_CRED_DISABLE: BACNET_PROPERTY_STATES = 33;
pub const BACNET_PROPERTY_STATES_PROP_STATE_AUTHENTICATION_STATUS: BACNET_PROPERTY_STATES = 34;
pub type BACNET_PROPERTY_STATES = ::std::os::raw::c_uint;
pub const BACNET_RELIABILITY_RELIABILITY_NO_FAULT_DETECTED: BACNET_RELIABILITY = 0;
pub const BACNET_RELIABILITY_RELIABILITY_NO_SENSOR: BACNET_RELIABILITY = 1;
pub const BACNET_RELIABILITY_RELIABILITY_OVER_RANGE: BACNET_RELIABILITY = 2;
pub const BACNET_RELIABILITY_RELIABILITY_UNDER_RANGE: BACNET_RELIABILITY = 3;
pub const BACNET_RELIABILITY_RELIABILITY_OPEN_LOOP: BACNET_RELIABILITY = 4;
pub const BACNET_RELIABILITY_RELIABILITY_SHORTED_LOOP: BACNET_RELIABILITY = 5;
pub const BACNET_RELIABILITY_RELIABILITY_NO_OUTPUT: BACNET_RELIABILITY = 6;
pub const BACNET_RELIABILITY_RELIABILITY_UNRELIABLE_OTHER: BACNET_RELIABILITY = 7;
pub const BACNET_RELIABILITY_RELIABILITY_PROCESS_ERROR: BACNET_RELIABILITY = 8;
pub const BACNET_RELIABILITY_RELIABILITY_MULTI_STATE_FAULT: BACNET_RELIABILITY = 9;
pub const BACNET_RELIABILITY_RELIABILITY_CONFIGURATION_ERROR: BACNET_RELIABILITY = 10;
pub const BACNET_RELIABILITY_RELIABILITY_RESERVED_11: BACNET_RELIABILITY = 11;
pub const BACNET_RELIABILITY_RELIABILITY_COMMUNICATION_FAILURE: BACNET_RELIABILITY = 12;
pub const BACNET_RELIABILITY_RELIABILITY_MEMBER_FAULT: BACNET_RELIABILITY = 13;
pub const BACNET_RELIABILITY_RELIABILITY_MONITORED_OBJECT_FAULT: BACNET_RELIABILITY = 14;
pub const BACNET_RELIABILITY_RELIABILITY_TRIPPED: BACNET_RELIABILITY = 15;
pub const BACNET_RELIABILITY_RELIABILITY_LAMP_FAILURE: BACNET_RELIABILITY = 16;
pub const BACNET_RELIABILITY_RELIABILITY_ACTIVATION_FAILURE: BACNET_RELIABILITY = 17;
pub const BACNET_RELIABILITY_RELIABILITY_RENEW_DHCP_FAILURE: BACNET_RELIABILITY = 18;
pub const BACNET_RELIABILITY_RELIABILITY_RENEW_FD_REGISTRATION_FAILURE: BACNET_RELIABILITY = 19;
pub const BACNET_RELIABILITY_RELIABILITY_RESTART_AUTO_NEGOTIATION_FAILURE: BACNET_RELIABILITY = 20;
pub const BACNET_RELIABILITY_RELIABILITY_RESTART_FAILURE: BACNET_RELIABILITY = 21;
pub const BACNET_RELIABILITY_RELIABILITY_PROPRIETARY_COMMAND_FAILURE: BACNET_RELIABILITY = 22;
pub const BACNET_RELIABILITY_RELIABILITY_FAULTS_LISTED: BACNET_RELIABILITY = 23;
pub const BACNET_RELIABILITY_RELIABILITY_REFERENCED_OBJECT_FAULT: BACNET_RELIABILITY = 24;
pub const BACNET_RELIABILITY_RELIABILITY_MULTI_STATE_OUT_OF_RANGE: BACNET_RELIABILITY = 25;
pub const BACNET_RELIABILITY_RELIABILITY_PROPRIETARY_MIN: BACNET_RELIABILITY = 64;
pub const BACNET_RELIABILITY_RELIABILITY_PROPRIETARY_MAX: BACNET_RELIABILITY = 65535;
pub type BACNET_RELIABILITY = ::std::os::raw::c_uint;
pub const BACNET_EVENT_TYPE_EVENT_CHANGE_OF_BITSTRING: BACNET_EVENT_TYPE = 0;
pub const BACNET_EVENT_TYPE_EVENT_CHANGE_OF_STATE: BACNET_EVENT_TYPE = 1;
pub const BACNET_EVENT_TYPE_EVENT_CHANGE_OF_VALUE: BACNET_EVENT_TYPE = 2;
pub const BACNET_EVENT_TYPE_EVENT_COMMAND_FAILURE: BACNET_EVENT_TYPE = 3;
pub const BACNET_EVENT_TYPE_EVENT_FLOATING_LIMIT: BACNET_EVENT_TYPE = 4;
pub const BACNET_EVENT_TYPE_EVENT_OUT_OF_RANGE: BACNET_EVENT_TYPE = 5;
pub const BACNET_EVENT_TYPE_EVENT_CHANGE_OF_LIFE_SAFETY: BACNET_EVENT_TYPE = 8;
pub const BACNET_EVENT_TYPE_EVENT_EXTENDED: BACNET_EVENT_TYPE = 9;
pub const BACNET_EVENT_TYPE_EVENT_BUFFER_READY: BACNET_EVENT_TYPE = 10;
pub const BACNET_EVENT_TYPE_EVENT_UNSIGNED_RANGE: BACNET_EVENT_TYPE = 11;
pub const BACNET_EVENT_TYPE_EVENT_ACCESS_EVENT: BACNET_EVENT_TYPE = 13;
pub const BACNET_EVENT_TYPE_EVENT_DOUBLE_OUT_OF_RANGE: BACNET_EVENT_TYPE = 14;
pub const BACNET_EVENT_TYPE_EVENT_SIGNED_OUT_OF_RANGE: BACNET_EVENT_TYPE = 15;
pub const BACNET_EVENT_TYPE_EVENT_UNSIGNED_OUT_OF_RANGE: BACNET_EVENT_TYPE = 16;
pub const BACNET_EVENT_TYPE_EVENT_CHANGE_OF_CHARACTERSTRING: BACNET_EVENT_TYPE = 17;
pub const BACNET_EVENT_TYPE_EVENT_CHANGE_OF_STATUS_FLAGS: BACNET_EVENT_TYPE = 18;
pub const BACNET_EVENT_TYPE_EVENT_CHANGE_OF_RELIABILITY: BACNET_EVENT_TYPE = 19;
pub const BACNET_EVENT_TYPE_EVENT_NONE: BACNET_EVENT_TYPE = 20;
pub const BACNET_EVENT_TYPE_EVENT_CHANGE_OF_DISCRETE_VALUE: BACNET_EVENT_TYPE = 21;
pub const BACNET_EVENT_TYPE_EVENT_CHANGE_OF_TIMER: BACNET_EVENT_TYPE = 22;
pub const BACNET_EVENT_TYPE_EVENT_PROPRIETARY_MIN: BACNET_EVENT_TYPE = 64;
pub const BACNET_EVENT_TYPE_EVENT_PROPRIETARY_MAX: BACNET_EVENT_TYPE = 65535;
pub type BACNET_EVENT_TYPE = ::std::os::raw::c_uint;
pub const BACNET_FILE_ACCESS_METHOD_FILE_RECORD_ACCESS: BACNET_FILE_ACCESS_METHOD = 0;
pub const BACNET_FILE_ACCESS_METHOD_FILE_STREAM_ACCESS: BACNET_FILE_ACCESS_METHOD = 1;
pub const BACNET_FILE_ACCESS_METHOD_FILE_RECORD_AND_STREAM_ACCESS: BACNET_FILE_ACCESS_METHOD = 2;
pub type BACNET_FILE_ACCESS_METHOD = ::std::os::raw::c_uint;
pub const BACNET_LIFE_SAFETY_MODE_MIN_LIFE_SAFETY_MODE: BACNET_LIFE_SAFETY_MODE = 0;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_OFF: BACNET_LIFE_SAFETY_MODE = 0;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_ON: BACNET_LIFE_SAFETY_MODE = 1;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_TEST: BACNET_LIFE_SAFETY_MODE = 2;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_MANNED: BACNET_LIFE_SAFETY_MODE = 3;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_UNMANNED: BACNET_LIFE_SAFETY_MODE = 4;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_ARMED: BACNET_LIFE_SAFETY_MODE = 5;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_DISARMED: BACNET_LIFE_SAFETY_MODE = 6;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_PREARMED: BACNET_LIFE_SAFETY_MODE = 7;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_SLOW: BACNET_LIFE_SAFETY_MODE = 8;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_FAST: BACNET_LIFE_SAFETY_MODE = 9;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_DISCONNECTED: BACNET_LIFE_SAFETY_MODE = 10;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_ENABLED: BACNET_LIFE_SAFETY_MODE = 11;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_DISABLED: BACNET_LIFE_SAFETY_MODE = 12;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_AUTOMATIC_RELEASE_DISABLED:
    BACNET_LIFE_SAFETY_MODE = 13;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_DEFAULT: BACNET_LIFE_SAFETY_MODE = 14;
pub const BACNET_LIFE_SAFETY_MODE_MAX_LIFE_SAFETY_MODE: BACNET_LIFE_SAFETY_MODE = 15;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_PROPRIETARY_MIN: BACNET_LIFE_SAFETY_MODE = 256;
pub const BACNET_LIFE_SAFETY_MODE_LIFE_SAFETY_MODE_PROPRIETARY_MAX: BACNET_LIFE_SAFETY_MODE = 65535;
pub type BACNET_LIFE_SAFETY_MODE = ::std::os::raw::c_uint;
pub const BACNET_LIFE_SAFETY_OPERATION_LIFE_SAFETY_OP_NONE: BACNET_LIFE_SAFETY_OPERATION = 0;
pub const BACNET_LIFE_SAFETY_OPERATION_LIFE_SAFETY_OP_SILENCE: BACNET_LIFE_SAFETY_OPERATION = 1;
pub const BACNET_LIFE_SAFETY_OPERATION_LIFE_SAFETY_OP_SILENCE_AUDIBLE:
    BACNET_LIFE_SAFETY_OPERATION = 2;
pub const BACNET_LIFE_SAFETY_OPERATION_LIFE_SAFETY_OP_SILENCE_VISUAL: BACNET_LIFE_SAFETY_OPERATION =
    3;
pub const BACNET_LIFE_SAFETY_OPERATION_LIFE_SAFETY_OP_RESET: BACNET_LIFE_SAFETY_OPERATION = 4;
pub const BACNET_LIFE_SAFETY_OPERATION_LIFE_SAFETY_OP_RESET_ALARM: BACNET_LIFE_SAFETY_OPERATION = 5;
pub const BACNET_LIFE_SAFETY_OPERATION_LIFE_SAFETY_OP_RESET_FAULT: BACNET_LIFE_SAFETY_OPERATION = 6;
pub const BACNET_LIFE_SAFETY_OPERATION_LIFE_SAFETY_OP_UNSILENCE: BACNET_LIFE_SAFETY_OPERATION = 7;
pub const BACNET_LIFE_SAFETY_OPERATION_LIFE_SAFETY_OP_UNSILENCE_AUDIBLE:
    BACNET_LIFE_SAFETY_OPERATION = 8;
pub const BACNET_LIFE_SAFETY_OPERATION_LIFE_SAFETY_OP_UNSILENCE_VISUAL:
    BACNET_LIFE_SAFETY_OPERATION = 9;
pub const BACNET_LIFE_SAFETY_OPERATION_LIFE_SAFETY_OP_PROPRIETARY_MIN:
    BACNET_LIFE_SAFETY_OPERATION = 64;
pub const BACNET_LIFE_SAFETY_OPERATION_LIFE_SAFETY_OP_PROPRIETARY_MAX:
    BACNET_LIFE_SAFETY_OPERATION = 65535;
pub type BACNET_LIFE_SAFETY_OPERATION = ::std::os::raw::c_uint;
pub const BACNET_LIFE_SAFETY_STATE_MIN_LIFE_SAFETY_STATE: BACNET_LIFE_SAFETY_STATE = 0;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_QUIET: BACNET_LIFE_SAFETY_STATE = 0;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_PRE_ALARM: BACNET_LIFE_SAFETY_STATE = 1;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_ALARM: BACNET_LIFE_SAFETY_STATE = 2;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_FAULT: BACNET_LIFE_SAFETY_STATE = 3;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_FAULT_PRE_ALARM: BACNET_LIFE_SAFETY_STATE = 4;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_FAULT_ALARM: BACNET_LIFE_SAFETY_STATE = 5;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_NOT_READY: BACNET_LIFE_SAFETY_STATE = 6;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_ACTIVE: BACNET_LIFE_SAFETY_STATE = 7;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_TAMPER: BACNET_LIFE_SAFETY_STATE = 8;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_TEST_ALARM: BACNET_LIFE_SAFETY_STATE = 9;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_TEST_ACTIVE: BACNET_LIFE_SAFETY_STATE = 10;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_TEST_FAULT: BACNET_LIFE_SAFETY_STATE = 11;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_TEST_FAULT_ALARM: BACNET_LIFE_SAFETY_STATE =
    12;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_HOLDUP: BACNET_LIFE_SAFETY_STATE = 13;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_DURESS: BACNET_LIFE_SAFETY_STATE = 14;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_TAMPER_ALARM: BACNET_LIFE_SAFETY_STATE = 15;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_ABNORMAL: BACNET_LIFE_SAFETY_STATE = 16;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_EMERGENCY_POWER: BACNET_LIFE_SAFETY_STATE = 17;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_DELAYED: BACNET_LIFE_SAFETY_STATE = 18;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_BLOCKED: BACNET_LIFE_SAFETY_STATE = 19;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_LOCAL_ALARM: BACNET_LIFE_SAFETY_STATE = 20;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_GENERAL_ALARM: BACNET_LIFE_SAFETY_STATE = 21;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_SUPERVISORY: BACNET_LIFE_SAFETY_STATE = 22;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_TEST_SUPERVISORY: BACNET_LIFE_SAFETY_STATE =
    23;
pub const BACNET_LIFE_SAFETY_STATE_MAX_LIFE_SAFETY_STATE: BACNET_LIFE_SAFETY_STATE = 24;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_PROPRIETARY_MIN: BACNET_LIFE_SAFETY_STATE =
    256;
pub const BACNET_LIFE_SAFETY_STATE_LIFE_SAFETY_STATE_PROPRIETARY_MAX: BACNET_LIFE_SAFETY_STATE =
    65535;
pub type BACNET_LIFE_SAFETY_STATE = ::std::os::raw::c_uint;
pub const BACNET_SILENCED_STATE_SILENCED_STATE_UNSILENCED: BACNET_SILENCED_STATE = 0;
pub const BACNET_SILENCED_STATE_SILENCED_STATE_AUDIBLE_SILENCED: BACNET_SILENCED_STATE = 1;
pub const BACNET_SILENCED_STATE_SILENCED_STATE_VISIBLE_SILENCED: BACNET_SILENCED_STATE = 2;
pub const BACNET_SILENCED_STATE_SILENCED_STATE_ALL_SILENCED: BACNET_SILENCED_STATE = 3;
pub const BACNET_SILENCED_STATE_SILENCED_STATE_PROPRIETARY_MIN: BACNET_SILENCED_STATE = 64;
pub const BACNET_SILENCED_STATE_SILENCED_STATE_PROPRIETARY_MAX: BACNET_SILENCED_STATE = 65535;
pub type BACNET_SILENCED_STATE = ::std::os::raw::c_uint;
pub const BACNET_MAINTENANCE_MAINTENANCE_NONE: BACNET_MAINTENANCE = 0;
pub const BACNET_MAINTENANCE_MAINTENANCE_PERIODIC_TEST: BACNET_MAINTENANCE = 1;
pub const BACNET_MAINTENANCE_MAINTENANCE_NEED_SERVICE_OPERATIONAL: BACNET_MAINTENANCE = 2;
pub const BACNET_MAINTENANCE_MAINTENANCE_NEED_SERVICE_INOPERATIVE: BACNET_MAINTENANCE = 3;
pub const BACNET_MAINTENANCE_MAINTENANCE_PROPRIETARY_MIN: BACNET_MAINTENANCE = 256;
pub const BACNET_MAINTENANCE_MAINTENANCE_PROPRIETARY_MAX: BACNET_MAINTENANCE = 65535;
pub type BACNET_MAINTENANCE = ::std::os::raw::c_uint;
pub const BACNET_NOTIFY_TYPE_NOTIFY_ALARM: BACNET_NOTIFY_TYPE = 0;
pub const BACNET_NOTIFY_TYPE_NOTIFY_EVENT: BACNET_NOTIFY_TYPE = 1;
pub const BACNET_NOTIFY_TYPE_NOTIFY_ACK_NOTIFICATION: BACNET_NOTIFY_TYPE = 2;
pub const BACNET_NOTIFY_TYPE_NOTIFY_MAX: BACNET_NOTIFY_TYPE = 3;
pub type BACNET_NOTIFY_TYPE = ::std::os::raw::c_uint;
pub const BACnetObjectType_OBJECT_ANALOG_INPUT: BACnetObjectType = 0;
pub const BACnetObjectType_OBJECT_ANALOG_OUTPUT: BACnetObjectType = 1;
pub const BACnetObjectType_OBJECT_ANALOG_VALUE: BACnetObjectType = 2;
pub const BACnetObjectType_OBJECT_BINARY_INPUT: BACnetObjectType = 3;
pub const BACnetObjectType_OBJECT_BINARY_OUTPUT: BACnetObjectType = 4;
pub const BACnetObjectType_OBJECT_BINARY_VALUE: BACnetObjectType = 5;
pub const BACnetObjectType_OBJECT_CALENDAR: BACnetObjectType = 6;
pub const BACnetObjectType_OBJECT_COMMAND: BACnetObjectType = 7;
pub const BACnetObjectType_OBJECT_DEVICE: BACnetObjectType = 8;
pub const BACnetObjectType_OBJECT_EVENT_ENROLLMENT: BACnetObjectType = 9;
pub const BACnetObjectType_OBJECT_FILE: BACnetObjectType = 10;
pub const BACnetObjectType_OBJECT_GROUP: BACnetObjectType = 11;
pub const BACnetObjectType_OBJECT_LOOP: BACnetObjectType = 12;
pub const BACnetObjectType_OBJECT_MULTI_STATE_INPUT: BACnetObjectType = 13;
pub const BACnetObjectType_OBJECT_MULTI_STATE_OUTPUT: BACnetObjectType = 14;
pub const BACnetObjectType_OBJECT_NOTIFICATION_CLASS: BACnetObjectType = 15;
pub const BACnetObjectType_OBJECT_PROGRAM: BACnetObjectType = 16;
pub const BACnetObjectType_OBJECT_SCHEDULE: BACnetObjectType = 17;
pub const BACnetObjectType_OBJECT_AVERAGING: BACnetObjectType = 18;
pub const BACnetObjectType_OBJECT_MULTI_STATE_VALUE: BACnetObjectType = 19;
pub const BACnetObjectType_OBJECT_TRENDLOG: BACnetObjectType = 20;
pub const BACnetObjectType_OBJECT_LIFE_SAFETY_POINT: BACnetObjectType = 21;
pub const BACnetObjectType_OBJECT_LIFE_SAFETY_ZONE: BACnetObjectType = 22;
pub const BACnetObjectType_OBJECT_ACCUMULATOR: BACnetObjectType = 23;
pub const BACnetObjectType_OBJECT_PULSE_CONVERTER: BACnetObjectType = 24;
pub const BACnetObjectType_OBJECT_EVENT_LOG: BACnetObjectType = 25;
pub const BACnetObjectType_OBJECT_GLOBAL_GROUP: BACnetObjectType = 26;
pub const BACnetObjectType_OBJECT_TREND_LOG_MULTIPLE: BACnetObjectType = 27;
pub const BACnetObjectType_OBJECT_LOAD_CONTROL: BACnetObjectType = 28;
pub const BACnetObjectType_OBJECT_STRUCTURED_VIEW: BACnetObjectType = 29;
pub const BACnetObjectType_OBJECT_ACCESS_DOOR: BACnetObjectType = 30;
pub const BACnetObjectType_OBJECT_TIMER: BACnetObjectType = 31;
pub const BACnetObjectType_OBJECT_ACCESS_CREDENTIAL: BACnetObjectType = 32;
pub const BACnetObjectType_OBJECT_ACCESS_POINT: BACnetObjectType = 33;
pub const BACnetObjectType_OBJECT_ACCESS_RIGHTS: BACnetObjectType = 34;
pub const BACnetObjectType_OBJECT_ACCESS_USER: BACnetObjectType = 35;
pub const BACnetObjectType_OBJECT_ACCESS_ZONE: BACnetObjectType = 36;
pub const BACnetObjectType_OBJECT_CREDENTIAL_DATA_INPUT: BACnetObjectType = 37;
pub const BACnetObjectType_OBJECT_NETWORK_SECURITY: BACnetObjectType = 38;
pub const BACnetObjectType_OBJECT_BITSTRING_VALUE: BACnetObjectType = 39;
pub const BACnetObjectType_OBJECT_CHARACTERSTRING_VALUE: BACnetObjectType = 40;
pub const BACnetObjectType_OBJECT_DATE_PATTERN_VALUE: BACnetObjectType = 41;
pub const BACnetObjectType_OBJECT_DATE_VALUE: BACnetObjectType = 42;
pub const BACnetObjectType_OBJECT_DATETIME_PATTERN_VALUE: BACnetObjectType = 43;
pub const BACnetObjectType_OBJECT_DATETIME_VALUE: BACnetObjectType = 44;
pub const BACnetObjectType_OBJECT_INTEGER_VALUE: BACnetObjectType = 45;
pub const BACnetObjectType_OBJECT_LARGE_ANALOG_VALUE: BACnetObjectType = 46;
pub const BACnetObjectType_OBJECT_OCTETSTRING_VALUE: BACnetObjectType = 47;
pub const BACnetObjectType_OBJECT_POSITIVE_INTEGER_VALUE: BACnetObjectType = 48;
pub const BACnetObjectType_OBJECT_TIME_PATTERN_VALUE: BACnetObjectType = 49;
pub const BACnetObjectType_OBJECT_TIME_VALUE: BACnetObjectType = 50;
pub const BACnetObjectType_OBJECT_NOTIFICATION_FORWARDER: BACnetObjectType = 51;
pub const BACnetObjectType_OBJECT_ALERT_ENROLLMENT: BACnetObjectType = 52;
pub const BACnetObjectType_OBJECT_CHANNEL: BACnetObjectType = 53;
pub const BACnetObjectType_OBJECT_LIGHTING_OUTPUT: BACnetObjectType = 54;
pub const BACnetObjectType_OBJECT_BINARY_LIGHTING_OUTPUT: BACnetObjectType = 55;
pub const BACnetObjectType_OBJECT_NETWORK_PORT: BACnetObjectType = 56;
pub const BACnetObjectType_OBJECT_ELEVATOR_GROUP: BACnetObjectType = 57;
pub const BACnetObjectType_OBJECT_ESCALATOR: BACnetObjectType = 58;
pub const BACnetObjectType_OBJECT_LIFT: BACnetObjectType = 59;
pub const BACnetObjectType_OBJECT_STAGING: BACnetObjectType = 60;
pub const BACnetObjectType_OBJECT_AUDIT_LOG: BACnetObjectType = 61;
pub const BACnetObjectType_OBJECT_AUDIT_REPORTER: BACnetObjectType = 62;
pub const BACnetObjectType_OBJECT_COLOR: BACnetObjectType = 63;
pub const BACnetObjectType_OBJECT_COLOR_TEMPERATURE: BACnetObjectType = 64;
pub const BACnetObjectType_BACNET_OBJECT_TYPE_LAST: BACnetObjectType = 64;
pub const BACnetObjectType_BACNET_OBJECT_TYPE_RESERVED_MAX: BACnetObjectType = 127;
pub const BACnetObjectType_OBJECT_PROPRIETARY_MIN: BACnetObjectType = 128;
pub const BACnetObjectType_OBJECT_PROPRIETARY_MAX: BACnetObjectType = 1023;
pub const BACnetObjectType_MAX_BACNET_OBJECT_TYPE: BACnetObjectType = 1024;
pub const BACnetObjectType_OBJECT_NONE: BACnetObjectType = 65535;
pub type BACnetObjectType = ::std::os::raw::c_uint;
pub use self::BACnetObjectType as BACNET_OBJECT_TYPE;
pub const BACNET_SEGMENTATION_SEGMENTATION_BOTH: BACNET_SEGMENTATION = 0;
pub const BACNET_SEGMENTATION_SEGMENTATION_TRANSMIT: BACNET_SEGMENTATION = 1;
pub const BACNET_SEGMENTATION_SEGMENTATION_RECEIVE: BACNET_SEGMENTATION = 2;
pub const BACNET_SEGMENTATION_SEGMENTATION_NONE: BACNET_SEGMENTATION = 3;
pub const BACNET_SEGMENTATION_MAX_BACNET_SEGMENTATION: BACNET_SEGMENTATION = 4;
pub type BACNET_SEGMENTATION = ::std::os::raw::c_uint;
pub const BACNET_VT_CLASS_VT_CLASS_DEFAULT: BACNET_VT_CLASS = 0;
pub const BACNET_VT_CLASS_VT_CLASS_ANSI_X34: BACNET_VT_CLASS = 1;
pub const BACNET_VT_CLASS_VT_CLASS_DEC_VT52: BACNET_VT_CLASS = 2;
pub const BACNET_VT_CLASS_VT_CLASS_DEC_VT100: BACNET_VT_CLASS = 3;
pub const BACNET_VT_CLASS_VT_CLASS_DEC_VT220: BACNET_VT_CLASS = 4;
pub const BACNET_VT_CLASS_VT_CLASS_HP_700_94: BACNET_VT_CLASS = 5;
pub const BACNET_VT_CLASS_VT_CLASS_IBM_3130: BACNET_VT_CLASS = 6;
pub const BACNET_VT_CLASS_VT_CLASS_PROPRIETARY_MIN: BACNET_VT_CLASS = 64;
pub const BACNET_VT_CLASS_VT_CLASS_PROPRIETARY_MAX: BACNET_VT_CLASS = 65535;
pub type BACNET_VT_CLASS = ::std::os::raw::c_uint;
pub const BACNET_CHARACTER_STRING_ENCODING_CHARACTER_ANSI_X34: BACNET_CHARACTER_STRING_ENCODING = 0;
pub const BACNET_CHARACTER_STRING_ENCODING_CHARACTER_UTF8: BACNET_CHARACTER_STRING_ENCODING = 0;
pub const BACNET_CHARACTER_STRING_ENCODING_CHARACTER_MS_DBCS: BACNET_CHARACTER_STRING_ENCODING = 1;
pub const BACNET_CHARACTER_STRING_ENCODING_CHARACTER_JISC_6226: BACNET_CHARACTER_STRING_ENCODING =
    2;
pub const BACNET_CHARACTER_STRING_ENCODING_CHARACTER_UCS4: BACNET_CHARACTER_STRING_ENCODING = 3;
pub const BACNET_CHARACTER_STRING_ENCODING_CHARACTER_UCS2: BACNET_CHARACTER_STRING_ENCODING = 4;
pub const BACNET_CHARACTER_STRING_ENCODING_CHARACTER_ISO8859: BACNET_CHARACTER_STRING_ENCODING = 5;
pub const BACNET_CHARACTER_STRING_ENCODING_MAX_CHARACTER_STRING_ENCODING:
    BACNET_CHARACTER_STRING_ENCODING = 6;
pub type BACNET_CHARACTER_STRING_ENCODING = ::std::os::raw::c_uint;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_NULL: BACNET_APPLICATION_TAG = 0;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_BOOLEAN: BACNET_APPLICATION_TAG = 1;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_UNSIGNED_INT: BACNET_APPLICATION_TAG = 2;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_SIGNED_INT: BACNET_APPLICATION_TAG = 3;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_REAL: BACNET_APPLICATION_TAG = 4;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_DOUBLE: BACNET_APPLICATION_TAG = 5;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_OCTET_STRING: BACNET_APPLICATION_TAG = 6;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_CHARACTER_STRING: BACNET_APPLICATION_TAG =
    7;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_BIT_STRING: BACNET_APPLICATION_TAG = 8;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_ENUMERATED: BACNET_APPLICATION_TAG = 9;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_DATE: BACNET_APPLICATION_TAG = 10;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_TIME: BACNET_APPLICATION_TAG = 11;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_OBJECT_ID: BACNET_APPLICATION_TAG = 12;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_RESERVE1: BACNET_APPLICATION_TAG = 13;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_RESERVE2: BACNET_APPLICATION_TAG = 14;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_RESERVE3: BACNET_APPLICATION_TAG = 15;
pub const BACNET_APPLICATION_TAG_MAX_BACNET_APPLICATION_TAG: BACNET_APPLICATION_TAG = 16;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_EMPTYLIST: BACNET_APPLICATION_TAG = 17;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_WEEKNDAY: BACNET_APPLICATION_TAG = 18;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_DATERANGE: BACNET_APPLICATION_TAG = 19;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_DATETIME: BACNET_APPLICATION_TAG = 20;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_TIMESTAMP: BACNET_APPLICATION_TAG = 21;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_ERROR: BACNET_APPLICATION_TAG = 22;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_DEVICE_OBJECT_PROPERTY_REFERENCE:
    BACNET_APPLICATION_TAG = 23;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_DEVICE_OBJECT_REFERENCE:
    BACNET_APPLICATION_TAG = 24;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_OBJECT_PROPERTY_REFERENCE:
    BACNET_APPLICATION_TAG = 25;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_DESTINATION: BACNET_APPLICATION_TAG = 26;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_RECIPIENT: BACNET_APPLICATION_TAG = 27;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_COV_SUBSCRIPTION: BACNET_APPLICATION_TAG =
    28;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_CALENDAR_ENTRY: BACNET_APPLICATION_TAG = 29;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_WEEKLY_SCHEDULE: BACNET_APPLICATION_TAG =
    30;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_SPECIAL_EVENT: BACNET_APPLICATION_TAG = 31;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_READ_ACCESS_SPECIFICATION:
    BACNET_APPLICATION_TAG = 32;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_LIGHTING_COMMAND: BACNET_APPLICATION_TAG =
    33;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_HOST_N_PORT: BACNET_APPLICATION_TAG = 34;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_XY_COLOR: BACNET_APPLICATION_TAG = 35;
pub const BACNET_APPLICATION_TAG_BACNET_APPLICATION_TAG_COLOR_COMMAND: BACNET_APPLICATION_TAG = 36;
pub type BACNET_APPLICATION_TAG = ::std::os::raw::c_uint;
pub const BACNET_PDU_TYPE_PDU_TYPE_CONFIRMED_SERVICE_REQUEST: BACNET_PDU_TYPE = 0;
pub const BACNET_PDU_TYPE_PDU_TYPE_UNCONFIRMED_SERVICE_REQUEST: BACNET_PDU_TYPE = 16;
pub const BACNET_PDU_TYPE_PDU_TYPE_SIMPLE_ACK: BACNET_PDU_TYPE = 32;
pub const BACNET_PDU_TYPE_PDU_TYPE_COMPLEX_ACK: BACNET_PDU_TYPE = 48;
pub const BACNET_PDU_TYPE_PDU_TYPE_SEGMENT_ACK: BACNET_PDU_TYPE = 64;
pub const BACNET_PDU_TYPE_PDU_TYPE_ERROR: BACNET_PDU_TYPE = 80;
pub const BACNET_PDU_TYPE_PDU_TYPE_REJECT: BACNET_PDU_TYPE = 96;
pub const BACNET_PDU_TYPE_PDU_TYPE_ABORT: BACNET_PDU_TYPE = 112;
pub type BACNET_PDU_TYPE = ::std::os::raw::c_uint;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_ACKNOWLEDGE_ALARM:
    BACnet_Confirmed_Service_Choice = 0;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_AUDIT_NOTIFICATION:
    BACnet_Confirmed_Service_Choice = 32;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_COV_NOTIFICATION:
    BACnet_Confirmed_Service_Choice = 1;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_COV_NOTIFICATION_MULTIPLE:
    BACnet_Confirmed_Service_Choice = 31;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_EVENT_NOTIFICATION:
    BACnet_Confirmed_Service_Choice = 2;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_GET_ALARM_SUMMARY:
    BACnet_Confirmed_Service_Choice = 3;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_GET_ENROLLMENT_SUMMARY:
    BACnet_Confirmed_Service_Choice = 4;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_GET_EVENT_INFORMATION:
    BACnet_Confirmed_Service_Choice = 29;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_LIFE_SAFETY_OPERATION:
    BACnet_Confirmed_Service_Choice = 27;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_SUBSCRIBE_COV:
    BACnet_Confirmed_Service_Choice = 5;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_SUBSCRIBE_COV_PROPERTY:
    BACnet_Confirmed_Service_Choice = 28;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_SUBSCRIBE_COV_PROPERTY_MULTIPLE:
    BACnet_Confirmed_Service_Choice = 30;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_ATOMIC_READ_FILE:
    BACnet_Confirmed_Service_Choice = 6;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_ATOMIC_WRITE_FILE:
    BACnet_Confirmed_Service_Choice = 7;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_ADD_LIST_ELEMENT:
    BACnet_Confirmed_Service_Choice = 8;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_REMOVE_LIST_ELEMENT:
    BACnet_Confirmed_Service_Choice = 9;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_CREATE_OBJECT:
    BACnet_Confirmed_Service_Choice = 10;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_DELETE_OBJECT:
    BACnet_Confirmed_Service_Choice = 11;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_READ_PROPERTY:
    BACnet_Confirmed_Service_Choice = 12;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_READ_PROP_CONDITIONAL:
    BACnet_Confirmed_Service_Choice = 13;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_READ_PROP_MULTIPLE:
    BACnet_Confirmed_Service_Choice = 14;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_READ_RANGE:
    BACnet_Confirmed_Service_Choice = 26;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_WRITE_PROPERTY:
    BACnet_Confirmed_Service_Choice = 15;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_WRITE_PROP_MULTIPLE:
    BACnet_Confirmed_Service_Choice = 16;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_AUDIT_LOG_QUERY:
    BACnet_Confirmed_Service_Choice = 33;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_DEVICE_COMMUNICATION_CONTROL:
    BACnet_Confirmed_Service_Choice = 17;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_PRIVATE_TRANSFER:
    BACnet_Confirmed_Service_Choice = 18;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_TEXT_MESSAGE:
    BACnet_Confirmed_Service_Choice = 19;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_REINITIALIZE_DEVICE:
    BACnet_Confirmed_Service_Choice = 20;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_VT_OPEN:
    BACnet_Confirmed_Service_Choice = 21;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_VT_CLOSE:
    BACnet_Confirmed_Service_Choice = 22;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_VT_DATA:
    BACnet_Confirmed_Service_Choice = 23;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_AUTHENTICATE:
    BACnet_Confirmed_Service_Choice = 24;
pub const BACnet_Confirmed_Service_Choice_SERVICE_CONFIRMED_REQUEST_KEY:
    BACnet_Confirmed_Service_Choice = 25;
pub const BACnet_Confirmed_Service_Choice_MAX_BACNET_CONFIRMED_SERVICE:
    BACnet_Confirmed_Service_Choice = 34;
pub type BACnet_Confirmed_Service_Choice = ::std::os::raw::c_uint;
pub use self::BACnet_Confirmed_Service_Choice as BACNET_CONFIRMED_SERVICE;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_I_AM:
    BACnet_Unconfirmed_Service_Choice = 0;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_I_HAVE:
    BACnet_Unconfirmed_Service_Choice = 1;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_COV_NOTIFICATION:
    BACnet_Unconfirmed_Service_Choice = 2;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_EVENT_NOTIFICATION:
    BACnet_Unconfirmed_Service_Choice = 3;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_PRIVATE_TRANSFER:
    BACnet_Unconfirmed_Service_Choice = 4;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_TEXT_MESSAGE:
    BACnet_Unconfirmed_Service_Choice = 5;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_TIME_SYNCHRONIZATION:
    BACnet_Unconfirmed_Service_Choice = 6;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_WHO_HAS:
    BACnet_Unconfirmed_Service_Choice = 7;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_WHO_IS:
    BACnet_Unconfirmed_Service_Choice = 8;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_UTC_TIME_SYNCHRONIZATION:
    BACnet_Unconfirmed_Service_Choice = 9;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_WRITE_GROUP:
    BACnet_Unconfirmed_Service_Choice = 10;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_COV_NOTIFICATION_MULTIPLE:
    BACnet_Unconfirmed_Service_Choice = 11;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_AUDIT_NOTIFICATION:
    BACnet_Unconfirmed_Service_Choice = 12;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_WHO_AM_I:
    BACnet_Unconfirmed_Service_Choice = 13;
pub const BACnet_Unconfirmed_Service_Choice_SERVICE_UNCONFIRMED_YOU_ARE:
    BACnet_Unconfirmed_Service_Choice = 14;
pub const BACnet_Unconfirmed_Service_Choice_MAX_BACNET_UNCONFIRMED_SERVICE:
    BACnet_Unconfirmed_Service_Choice = 15;
pub type BACnet_Unconfirmed_Service_Choice = ::std::os::raw::c_uint;
pub use self::BACnet_Unconfirmed_Service_Choice as BACNET_UNCONFIRMED_SERVICE;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_ACKNOWLEDGE_ALARM: BACnet_Services_Supported =
    0;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_CONFIRMED_COV_NOTIFICATION:
    BACnet_Services_Supported = 1;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_CONFIRMED_COV_NOTIFICATION_MULTIPLE:
    BACnet_Services_Supported = 42;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_CONFIRMED_EVENT_NOTIFICATION:
    BACnet_Services_Supported = 2;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_GET_ALARM_SUMMARY: BACnet_Services_Supported =
    3;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_GET_ENROLLMENT_SUMMARY:
    BACnet_Services_Supported = 4;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_GET_EVENT_INFORMATION:
    BACnet_Services_Supported = 39;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_SUBSCRIBE_COV: BACnet_Services_Supported = 5;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_SUBSCRIBE_COV_PROPERTY:
    BACnet_Services_Supported = 38;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_SUBSCRIBE_COV_PROPERTY_MULTIPLE:
    BACnet_Services_Supported = 41;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_LIFE_SAFETY_OPERATION:
    BACnet_Services_Supported = 37;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_CONFIRMED_AUDIT_NOTIFICATION:
    BACnet_Services_Supported = 44;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_AUDIT_LOG_QUERY: BACnet_Services_Supported =
    45;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_ATOMIC_READ_FILE: BACnet_Services_Supported =
    6;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_ATOMIC_WRITE_FILE: BACnet_Services_Supported =
    7;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_ADD_LIST_ELEMENT: BACnet_Services_Supported =
    8;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_REMOVE_LIST_ELEMENT:
    BACnet_Services_Supported = 9;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_CREATE_OBJECT: BACnet_Services_Supported = 10;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_DELETE_OBJECT: BACnet_Services_Supported = 11;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_READ_PROPERTY: BACnet_Services_Supported = 12;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_READ_PROP_CONDITIONAL:
    BACnet_Services_Supported = 13;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_READ_PROP_MULTIPLE:
    BACnet_Services_Supported = 14;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_READ_RANGE: BACnet_Services_Supported = 35;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_WRITE_PROPERTY: BACnet_Services_Supported =
    15;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_WRITE_PROP_MULTIPLE:
    BACnet_Services_Supported = 16;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_WRITE_GROUP: BACnet_Services_Supported = 40;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_DEVICE_COMMUNICATION_CONTROL:
    BACnet_Services_Supported = 17;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_PRIVATE_TRANSFER: BACnet_Services_Supported =
    18;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_TEXT_MESSAGE: BACnet_Services_Supported = 19;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_REINITIALIZE_DEVICE:
    BACnet_Services_Supported = 20;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_WHO_AM_I: BACnet_Services_Supported = 47;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_YOU_ARE: BACnet_Services_Supported = 48;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_VT_OPEN: BACnet_Services_Supported = 21;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_VT_CLOSE: BACnet_Services_Supported = 22;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_VT_DATA: BACnet_Services_Supported = 23;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_AUTHENTICATE: BACnet_Services_Supported = 24;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_REQUEST_KEY: BACnet_Services_Supported = 25;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_I_AM: BACnet_Services_Supported = 26;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_I_HAVE: BACnet_Services_Supported = 27;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_UNCONFIRMED_COV_NOTIFICATION:
    BACnet_Services_Supported = 28;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_UNCONFIRMED_COV_NOTIFICATION_MULTIPLE:
    BACnet_Services_Supported = 43;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_UNCONFIRMED_EVENT_NOTIFICATION:
    BACnet_Services_Supported = 29;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_UNCONFIRMED_PRIVATE_TRANSFER:
    BACnet_Services_Supported = 30;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_UNCONFIRMED_TEXT_MESSAGE:
    BACnet_Services_Supported = 31;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_TIME_SYNCHRONIZATION:
    BACnet_Services_Supported = 32;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_UTC_TIME_SYNCHRONIZATION:
    BACnet_Services_Supported = 36;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_WHO_HAS: BACnet_Services_Supported = 33;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_WHO_IS: BACnet_Services_Supported = 34;
pub const BACnet_Services_Supported_SERVICE_SUPPORTED_UNCONFIRMED_AUDIT_NOTIFICATION:
    BACnet_Services_Supported = 46;
pub const BACnet_Services_Supported_BACNET_SERVICES_SUPPORTED_MAX: BACnet_Services_Supported = 47;
pub type BACnet_Services_Supported = ::std::os::raw::c_uint;
pub use self::BACnet_Services_Supported as BACNET_SERVICES_SUPPORTED;
pub const BACNET_STATUS_FLAGS_STATUS_FLAG_IN_ALARM: BACNET_STATUS_FLAGS = 0;
pub const BACNET_STATUS_FLAGS_STATUS_FLAG_FAULT: BACNET_STATUS_FLAGS = 1;
pub const BACNET_STATUS_FLAGS_STATUS_FLAG_OVERRIDDEN: BACNET_STATUS_FLAGS = 2;
pub const BACNET_STATUS_FLAGS_STATUS_FLAG_OUT_OF_SERVICE: BACNET_STATUS_FLAGS = 3;
pub type BACNET_STATUS_FLAGS = ::std::os::raw::c_uint;
pub const BACNET_LOG_STATUS_LOG_STATUS_LOG_DISABLED: BACNET_LOG_STATUS = 0;
pub const BACNET_LOG_STATUS_LOG_STATUS_BUFFER_PURGED: BACNET_LOG_STATUS = 1;
pub const BACNET_LOG_STATUS_LOG_STATUS_LOG_INTERRUPTED: BACNET_LOG_STATUS = 2;
pub type BACNET_LOG_STATUS = ::std::os::raw::c_uint;
pub const BACNET_LOGGING_TYPE_LOGGING_TYPE_POLLED: BACNET_LOGGING_TYPE = 0;
pub const BACNET_LOGGING_TYPE_LOGGING_TYPE_COV: BACNET_LOGGING_TYPE = 1;
pub const BACNET_LOGGING_TYPE_LOGGING_TYPE_TRIGGERED: BACNET_LOGGING_TYPE = 2;
pub type BACNET_LOGGING_TYPE = ::std::os::raw::c_uint;
pub const BACNET_ACKNOWLEDGMENT_FILTER_ACKNOWLEDGMENT_FILTER_ALL: BACNET_ACKNOWLEDGMENT_FILTER = 0;
pub const BACNET_ACKNOWLEDGMENT_FILTER_ACKNOWLEDGMENT_FILTER_ACKED: BACNET_ACKNOWLEDGMENT_FILTER =
    1;
pub const BACNET_ACKNOWLEDGMENT_FILTER_ACKNOWLEDGMENT_FILTER_NOT_ACKED:
    BACNET_ACKNOWLEDGMENT_FILTER = 2;
pub type BACNET_ACKNOWLEDGMENT_FILTER = ::std::os::raw::c_uint;
pub const BACNET_EVENT_STATE_FILTER_EVENT_STATE_FILTER_OFFNORMAL: BACNET_EVENT_STATE_FILTER = 0;
pub const BACNET_EVENT_STATE_FILTER_EVENT_STATE_FILTER_FAULT: BACNET_EVENT_STATE_FILTER = 1;
pub const BACNET_EVENT_STATE_FILTER_EVENT_STATE_FILTER_NORMAL: BACNET_EVENT_STATE_FILTER = 2;
pub const BACNET_EVENT_STATE_FILTER_EVENT_STATE_FILTER_ALL: BACNET_EVENT_STATE_FILTER = 3;
pub const BACNET_EVENT_STATE_FILTER_EVENT_STATE_FILTER_ACTIVE: BACNET_EVENT_STATE_FILTER = 4;
pub type BACNET_EVENT_STATE_FILTER = ::std::os::raw::c_uint;
pub const BACNET_SELECTION_LOGIC_SELECTION_LOGIC_AND: BACNET_SELECTION_LOGIC = 0;
pub const BACNET_SELECTION_LOGIC_SELECTION_LOGIC_OR: BACNET_SELECTION_LOGIC = 1;
pub const BACNET_SELECTION_LOGIC_SELECTION_LOGIC_ALL: BACNET_SELECTION_LOGIC = 2;
pub type BACNET_SELECTION_LOGIC = ::std::os::raw::c_uint;
pub const BACNET_RELATION_SPECIFIER_RELATION_SPECIFIER_EQUAL: BACNET_RELATION_SPECIFIER = 0;
pub const BACNET_RELATION_SPECIFIER_RELATION_SPECIFIER_NOT_EQUAL: BACNET_RELATION_SPECIFIER = 1;
pub const BACNET_RELATION_SPECIFIER_RELATION_SPECIFIER_LESS_THAN: BACNET_RELATION_SPECIFIER = 2;
pub const BACNET_RELATION_SPECIFIER_RELATION_SPECIFIER_GREATER_THAN: BACNET_RELATION_SPECIFIER = 3;
pub const BACNET_RELATION_SPECIFIER_RELATION_SPECIFIER_LESS_THAN_OR_EQUAL:
    BACNET_RELATION_SPECIFIER = 4;
pub const BACNET_RELATION_SPECIFIER_RELATION_SPECIFIER_GREATER_THAN_OR_EQUAL:
    BACNET_RELATION_SPECIFIER = 5;
pub type BACNET_RELATION_SPECIFIER = ::std::os::raw::c_uint;
pub const BACNET_COMMUNICATION_ENABLE_DISABLE_COMMUNICATION_ENABLE:
    BACNET_COMMUNICATION_ENABLE_DISABLE = 0;
pub const BACNET_COMMUNICATION_ENABLE_DISABLE_COMMUNICATION_DISABLE:
    BACNET_COMMUNICATION_ENABLE_DISABLE = 1;
pub const BACNET_COMMUNICATION_ENABLE_DISABLE_COMMUNICATION_DISABLE_INITIATION:
    BACNET_COMMUNICATION_ENABLE_DISABLE = 2;
pub const BACNET_COMMUNICATION_ENABLE_DISABLE_MAX_BACNET_COMMUNICATION_ENABLE_DISABLE:
    BACNET_COMMUNICATION_ENABLE_DISABLE = 3;
pub type BACNET_COMMUNICATION_ENABLE_DISABLE = ::std::os::raw::c_uint;
pub const BACNET_MESSAGE_PRIORITY_MESSAGE_PRIORITY_NORMAL: BACNET_MESSAGE_PRIORITY = 0;
pub const BACNET_MESSAGE_PRIORITY_MESSAGE_PRIORITY_URGENT: BACNET_MESSAGE_PRIORITY = 1;
pub const BACNET_MESSAGE_PRIORITY_MESSAGE_PRIORITY_CRITICAL_EQUIPMENT: BACNET_MESSAGE_PRIORITY = 2;
pub const BACNET_MESSAGE_PRIORITY_MESSAGE_PRIORITY_LIFE_SAFETY: BACNET_MESSAGE_PRIORITY = 3;
pub type BACNET_MESSAGE_PRIORITY = ::std::os::raw::c_uint;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_WHO_IS_ROUTER_TO_NETWORK:
    BACNET_NETWORK_MESSAGE_TYPE = 0;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_I_AM_ROUTER_TO_NETWORK:
    BACNET_NETWORK_MESSAGE_TYPE = 1;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_I_COULD_BE_ROUTER_TO_NETWORK:
    BACNET_NETWORK_MESSAGE_TYPE = 2;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_REJECT_MESSAGE_TO_NETWORK:
    BACNET_NETWORK_MESSAGE_TYPE = 3;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_ROUTER_BUSY_TO_NETWORK:
    BACNET_NETWORK_MESSAGE_TYPE = 4;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_ROUTER_AVAILABLE_TO_NETWORK:
    BACNET_NETWORK_MESSAGE_TYPE = 5;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_INIT_RT_TABLE: BACNET_NETWORK_MESSAGE_TYPE =
    6;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_INIT_RT_TABLE_ACK:
    BACNET_NETWORK_MESSAGE_TYPE = 7;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_ESTABLISH_CONNECTION_TO_NETWORK:
    BACNET_NETWORK_MESSAGE_TYPE = 8;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_DISCONNECT_CONNECTION_TO_NETWORK:
    BACNET_NETWORK_MESSAGE_TYPE = 9;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_CHALLENGE_REQUEST:
    BACNET_NETWORK_MESSAGE_TYPE = 10;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_SECURITY_PAYLOAD:
    BACNET_NETWORK_MESSAGE_TYPE = 11;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_SECURITY_RESPONSE:
    BACNET_NETWORK_MESSAGE_TYPE = 12;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_REQUEST_KEY_UPDATE:
    BACNET_NETWORK_MESSAGE_TYPE = 13;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_UPDATE_KEY_SET: BACNET_NETWORK_MESSAGE_TYPE =
    14;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_UPDATE_DISTRIBUTION_KEY:
    BACNET_NETWORK_MESSAGE_TYPE = 15;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_REQUEST_MASTER_KEY:
    BACNET_NETWORK_MESSAGE_TYPE = 16;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_SET_MASTER_KEY: BACNET_NETWORK_MESSAGE_TYPE =
    17;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_WHAT_IS_NETWORK_NUMBER:
    BACNET_NETWORK_MESSAGE_TYPE = 18;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_NETWORK_NUMBER_IS:
    BACNET_NETWORK_MESSAGE_TYPE = 19;
pub const BACNET_NETWORK_MESSAGE_TYPE_NETWORK_MESSAGE_INVALID: BACNET_NETWORK_MESSAGE_TYPE = 256;
pub type BACNET_NETWORK_MESSAGE_TYPE = ::std::os::raw::c_uint;
pub const BACNET_ABORT_REASON_ABORT_REASON_OTHER: BACNET_ABORT_REASON = 0;
pub const BACNET_ABORT_REASON_ABORT_REASON_BUFFER_OVERFLOW: BACNET_ABORT_REASON = 1;
pub const BACNET_ABORT_REASON_ABORT_REASON_INVALID_APDU_IN_THIS_STATE: BACNET_ABORT_REASON = 2;
pub const BACNET_ABORT_REASON_ABORT_REASON_PREEMPTED_BY_HIGHER_PRIORITY_TASK: BACNET_ABORT_REASON =
    3;
pub const BACNET_ABORT_REASON_ABORT_REASON_SEGMENTATION_NOT_SUPPORTED: BACNET_ABORT_REASON = 4;
pub const BACNET_ABORT_REASON_ABORT_REASON_SECURITY_ERROR: BACNET_ABORT_REASON = 5;
pub const BACNET_ABORT_REASON_ABORT_REASON_INSUFFICIENT_SECURITY: BACNET_ABORT_REASON = 6;
pub const BACNET_ABORT_REASON_MAX_BACNET_ABORT_REASON: BACNET_ABORT_REASON = 7;
pub const BACNET_ABORT_REASON_ABORT_REASON_PROPRIETARY_FIRST: BACNET_ABORT_REASON = 64;
pub const BACNET_ABORT_REASON_ABORT_REASON_PROPRIETARY_LAST: BACNET_ABORT_REASON = 255;
pub type BACNET_ABORT_REASON = ::std::os::raw::c_uint;
pub const BACNET_REJECT_REASON_REJECT_REASON_OTHER: BACNET_REJECT_REASON = 0;
pub const BACNET_REJECT_REASON_REJECT_REASON_BUFFER_OVERFLOW: BACNET_REJECT_REASON = 1;
pub const BACNET_REJECT_REASON_REJECT_REASON_INCONSISTENT_PARAMETERS: BACNET_REJECT_REASON = 2;
pub const BACNET_REJECT_REASON_REJECT_REASON_INVALID_PARAMETER_DATA_TYPE: BACNET_REJECT_REASON = 3;
pub const BACNET_REJECT_REASON_REJECT_REASON_INVALID_TAG: BACNET_REJECT_REASON = 4;
pub const BACNET_REJECT_REASON_REJECT_REASON_MISSING_REQUIRED_PARAMETER: BACNET_REJECT_REASON = 5;
pub const BACNET_REJECT_REASON_REJECT_REASON_PARAMETER_OUT_OF_RANGE: BACNET_REJECT_REASON = 6;
pub const BACNET_REJECT_REASON_REJECT_REASON_TOO_MANY_ARGUMENTS: BACNET_REJECT_REASON = 7;
pub const BACNET_REJECT_REASON_REJECT_REASON_UNDEFINED_ENUMERATION: BACNET_REJECT_REASON = 8;
pub const BACNET_REJECT_REASON_REJECT_REASON_UNRECOGNIZED_SERVICE: BACNET_REJECT_REASON = 9;
pub const BACNET_REJECT_REASON_MAX_BACNET_REJECT_REASON: BACNET_REJECT_REASON = 10;
pub const BACNET_REJECT_REASON_REJECT_REASON_PROPRIETARY_FIRST: BACNET_REJECT_REASON = 64;
pub const BACNET_REJECT_REASON_REJECT_REASON_PROPRIETARY_LAST: BACNET_REJECT_REASON = 255;
pub type BACNET_REJECT_REASON = ::std::os::raw::c_uint;
pub const BACNET_ERROR_CLASS_ERROR_CLASS_DEVICE: BACNET_ERROR_CLASS = 0;
pub const BACNET_ERROR_CLASS_ERROR_CLASS_OBJECT: BACNET_ERROR_CLASS = 1;
pub const BACNET_ERROR_CLASS_ERROR_CLASS_PROPERTY: BACNET_ERROR_CLASS = 2;
pub const BACNET_ERROR_CLASS_ERROR_CLASS_RESOURCES: BACNET_ERROR_CLASS = 3;
pub const BACNET_ERROR_CLASS_ERROR_CLASS_SECURITY: BACNET_ERROR_CLASS = 4;
pub const BACNET_ERROR_CLASS_ERROR_CLASS_SERVICES: BACNET_ERROR_CLASS = 5;
pub const BACNET_ERROR_CLASS_ERROR_CLASS_VT: BACNET_ERROR_CLASS = 6;
pub const BACNET_ERROR_CLASS_ERROR_CLASS_COMMUNICATION: BACNET_ERROR_CLASS = 7;
pub const BACNET_ERROR_CLASS_MAX_BACNET_ERROR_CLASS: BACNET_ERROR_CLASS = 8;
pub const BACNET_ERROR_CLASS_ERROR_CLASS_PROPRIETARY_FIRST: BACNET_ERROR_CLASS = 64;
pub const BACNET_ERROR_CLASS_ERROR_CLASS_PROPRIETARY_LAST: BACNET_ERROR_CLASS = 65535;
pub type BACNET_ERROR_CLASS = ::std::os::raw::c_uint;
pub const BACNET_ERROR_CODE_ERROR_CODE_OTHER: BACNET_ERROR_CODE = 0;
pub const BACNET_ERROR_CODE_ERROR_CODE_DEVICE_BUSY: BACNET_ERROR_CODE = 3;
pub const BACNET_ERROR_CODE_ERROR_CODE_CONFIGURATION_IN_PROGRESS: BACNET_ERROR_CODE = 2;
pub const BACNET_ERROR_CODE_ERROR_CODE_OPERATIONAL_PROBLEM: BACNET_ERROR_CODE = 25;
pub const BACNET_ERROR_CODE_ERROR_CODE_DYNAMIC_CREATION_NOT_SUPPORTED: BACNET_ERROR_CODE = 4;
pub const BACNET_ERROR_CODE_ERROR_CODE_NO_OBJECTS_OF_SPECIFIED_TYPE: BACNET_ERROR_CODE = 17;
pub const BACNET_ERROR_CODE_ERROR_CODE_OBJECT_DELETION_NOT_PERMITTED: BACNET_ERROR_CODE = 23;
pub const BACNET_ERROR_CODE_ERROR_CODE_OBJECT_IDENTIFIER_ALREADY_EXISTS: BACNET_ERROR_CODE = 24;
pub const BACNET_ERROR_CODE_ERROR_CODE_READ_ACCESS_DENIED: BACNET_ERROR_CODE = 27;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_OBJECT: BACNET_ERROR_CODE = 31;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNSUPPORTED_OBJECT_TYPE: BACNET_ERROR_CODE = 36;
pub const BACNET_ERROR_CODE_ERROR_CODE_CHARACTER_SET_NOT_SUPPORTED: BACNET_ERROR_CODE = 41;
pub const BACNET_ERROR_CODE_ERROR_CODE_DATATYPE_NOT_SUPPORTED: BACNET_ERROR_CODE = 47;
pub const BACNET_ERROR_CODE_ERROR_CODE_INCONSISTENT_SELECTION_CRITERION: BACNET_ERROR_CODE = 8;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_ARRAY_INDEX: BACNET_ERROR_CODE = 42;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_DATA_TYPE: BACNET_ERROR_CODE = 9;
pub const BACNET_ERROR_CODE_ERROR_CODE_NOT_COV_PROPERTY: BACNET_ERROR_CODE = 44;
pub const BACNET_ERROR_CODE_ERROR_CODE_OPTIONAL_FUNCTIONALITY_NOT_SUPPORTED: BACNET_ERROR_CODE = 45;
pub const BACNET_ERROR_CODE_ERROR_CODE_PROPERTY_IS_NOT_AN_ARRAY: BACNET_ERROR_CODE = 50;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_PROPERTY: BACNET_ERROR_CODE = 32;
pub const BACNET_ERROR_CODE_ERROR_CODE_VALUE_OUT_OF_RANGE: BACNET_ERROR_CODE = 37;
pub const BACNET_ERROR_CODE_ERROR_CODE_WRITE_ACCESS_DENIED: BACNET_ERROR_CODE = 40;
pub const BACNET_ERROR_CODE_ERROR_CODE_NO_SPACE_FOR_OBJECT: BACNET_ERROR_CODE = 18;
pub const BACNET_ERROR_CODE_ERROR_CODE_NO_SPACE_TO_ADD_LIST_ELEMENT: BACNET_ERROR_CODE = 19;
pub const BACNET_ERROR_CODE_ERROR_CODE_NO_SPACE_TO_WRITE_PROPERTY: BACNET_ERROR_CODE = 20;
pub const BACNET_ERROR_CODE_ERROR_CODE_AUTHENTICATION_FAILED: BACNET_ERROR_CODE = 1;
pub const BACNET_ERROR_CODE_ERROR_CODE_INCOMPATIBLE_SECURITY_LEVELS: BACNET_ERROR_CODE = 6;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_OPERATOR_NAME: BACNET_ERROR_CODE = 12;
pub const BACNET_ERROR_CODE_ERROR_CODE_KEY_GENERATION_ERROR: BACNET_ERROR_CODE = 15;
pub const BACNET_ERROR_CODE_ERROR_CODE_PASSWORD_FAILURE: BACNET_ERROR_CODE = 26;
pub const BACNET_ERROR_CODE_ERROR_CODE_SECURITY_NOT_SUPPORTED: BACNET_ERROR_CODE = 28;
pub const BACNET_ERROR_CODE_ERROR_CODE_TIMEOUT: BACNET_ERROR_CODE = 30;
pub const BACNET_ERROR_CODE_ERROR_CODE_COV_SUBSCRIPTION_FAILED: BACNET_ERROR_CODE = 43;
pub const BACNET_ERROR_CODE_ERROR_CODE_DUPLICATE_NAME: BACNET_ERROR_CODE = 48;
pub const BACNET_ERROR_CODE_ERROR_CODE_DUPLICATE_OBJECT_ID: BACNET_ERROR_CODE = 49;
pub const BACNET_ERROR_CODE_ERROR_CODE_FILE_ACCESS_DENIED: BACNET_ERROR_CODE = 5;
pub const BACNET_ERROR_CODE_ERROR_CODE_INCONSISTENT_PARAMETERS: BACNET_ERROR_CODE = 7;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_CONFIGURATION_DATA: BACNET_ERROR_CODE = 46;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_FILE_ACCESS_METHOD: BACNET_ERROR_CODE = 10;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_FILE_START_POSITION: BACNET_ERROR_CODE = 11;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_PARAMETER_DATA_TYPE: BACNET_ERROR_CODE = 13;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_TIME_STAMP: BACNET_ERROR_CODE = 14;
pub const BACNET_ERROR_CODE_ERROR_CODE_MISSING_REQUIRED_PARAMETER: BACNET_ERROR_CODE = 16;
pub const BACNET_ERROR_CODE_ERROR_CODE_PROPERTY_IS_NOT_A_LIST: BACNET_ERROR_CODE = 22;
pub const BACNET_ERROR_CODE_ERROR_CODE_SERVICE_REQUEST_DENIED: BACNET_ERROR_CODE = 29;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_VT_CLASS: BACNET_ERROR_CODE = 34;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_VT_SESSION: BACNET_ERROR_CODE = 35;
pub const BACNET_ERROR_CODE_ERROR_CODE_NO_VT_SESSIONS_AVAILABLE: BACNET_ERROR_CODE = 21;
pub const BACNET_ERROR_CODE_ERROR_CODE_VT_SESSION_ALREADY_CLOSED: BACNET_ERROR_CODE = 38;
pub const BACNET_ERROR_CODE_ERROR_CODE_VT_SESSION_TERMINATION_FAILURE: BACNET_ERROR_CODE = 39;
pub const BACNET_ERROR_CODE_ERROR_CODE_RESERVED1: BACNET_ERROR_CODE = 33;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_BUFFER_OVERFLOW: BACNET_ERROR_CODE = 51;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_INVALID_APDU_IN_THIS_STATE: BACNET_ERROR_CODE = 52;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_PREEMPTED_BY_HIGHER_PRIORITY_TASK: BACNET_ERROR_CODE =
    53;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_SEGMENTATION_NOT_SUPPORTED: BACNET_ERROR_CODE = 54;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_PROPRIETARY: BACNET_ERROR_CODE = 55;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_OTHER: BACNET_ERROR_CODE = 56;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_TAG: BACNET_ERROR_CODE = 57;
pub const BACNET_ERROR_CODE_ERROR_CODE_NETWORK_DOWN: BACNET_ERROR_CODE = 58;
pub const BACNET_ERROR_CODE_ERROR_CODE_REJECT_BUFFER_OVERFLOW: BACNET_ERROR_CODE = 59;
pub const BACNET_ERROR_CODE_ERROR_CODE_REJECT_INCONSISTENT_PARAMETERS: BACNET_ERROR_CODE = 60;
pub const BACNET_ERROR_CODE_ERROR_CODE_REJECT_INVALID_PARAMETER_DATA_TYPE: BACNET_ERROR_CODE = 61;
pub const BACNET_ERROR_CODE_ERROR_CODE_REJECT_INVALID_TAG: BACNET_ERROR_CODE = 62;
pub const BACNET_ERROR_CODE_ERROR_CODE_REJECT_MISSING_REQUIRED_PARAMETER: BACNET_ERROR_CODE = 63;
pub const BACNET_ERROR_CODE_ERROR_CODE_REJECT_PARAMETER_OUT_OF_RANGE: BACNET_ERROR_CODE = 64;
pub const BACNET_ERROR_CODE_ERROR_CODE_REJECT_TOO_MANY_ARGUMENTS: BACNET_ERROR_CODE = 65;
pub const BACNET_ERROR_CODE_ERROR_CODE_REJECT_UNDEFINED_ENUMERATION: BACNET_ERROR_CODE = 66;
pub const BACNET_ERROR_CODE_ERROR_CODE_REJECT_UNRECOGNIZED_SERVICE: BACNET_ERROR_CODE = 67;
pub const BACNET_ERROR_CODE_ERROR_CODE_REJECT_PROPRIETARY: BACNET_ERROR_CODE = 68;
pub const BACNET_ERROR_CODE_ERROR_CODE_REJECT_OTHER: BACNET_ERROR_CODE = 69;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_DEVICE: BACNET_ERROR_CODE = 70;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_ROUTE: BACNET_ERROR_CODE = 71;
pub const BACNET_ERROR_CODE_ERROR_CODE_VALUE_NOT_INITIALIZED: BACNET_ERROR_CODE = 72;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_EVENT_STATE: BACNET_ERROR_CODE = 73;
pub const BACNET_ERROR_CODE_ERROR_CODE_NO_ALARM_CONFIGURED: BACNET_ERROR_CODE = 74;
pub const BACNET_ERROR_CODE_ERROR_CODE_LOG_BUFFER_FULL: BACNET_ERROR_CODE = 75;
pub const BACNET_ERROR_CODE_ERROR_CODE_LOGGED_VALUE_PURGED: BACNET_ERROR_CODE = 76;
pub const BACNET_ERROR_CODE_ERROR_CODE_NO_PROPERTY_SPECIFIED: BACNET_ERROR_CODE = 77;
pub const BACNET_ERROR_CODE_ERROR_CODE_NOT_CONFIGURED_FOR_TRIGGERED_LOGGING: BACNET_ERROR_CODE = 78;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_SUBSCRIPTION: BACNET_ERROR_CODE = 79;
pub const BACNET_ERROR_CODE_ERROR_CODE_PARAMETER_OUT_OF_RANGE: BACNET_ERROR_CODE = 80;
pub const BACNET_ERROR_CODE_ERROR_CODE_LIST_ELEMENT_NOT_FOUND: BACNET_ERROR_CODE = 81;
pub const BACNET_ERROR_CODE_ERROR_CODE_BUSY: BACNET_ERROR_CODE = 82;
pub const BACNET_ERROR_CODE_ERROR_CODE_COMMUNICATION_DISABLED: BACNET_ERROR_CODE = 83;
pub const BACNET_ERROR_CODE_ERROR_CODE_SUCCESS: BACNET_ERROR_CODE = 84;
pub const BACNET_ERROR_CODE_ERROR_CODE_ACCESS_DENIED: BACNET_ERROR_CODE = 85;
pub const BACNET_ERROR_CODE_ERROR_CODE_BAD_DESTINATION_ADDRESS: BACNET_ERROR_CODE = 86;
pub const BACNET_ERROR_CODE_ERROR_CODE_BAD_DESTINATION_DEVICE_ID: BACNET_ERROR_CODE = 87;
pub const BACNET_ERROR_CODE_ERROR_CODE_BAD_SIGNATURE: BACNET_ERROR_CODE = 88;
pub const BACNET_ERROR_CODE_ERROR_CODE_BAD_SOURCE_ADDRESS: BACNET_ERROR_CODE = 89;
pub const BACNET_ERROR_CODE_ERROR_CODE_BAD_TIMESTAMP: BACNET_ERROR_CODE = 90;
pub const BACNET_ERROR_CODE_ERROR_CODE_CANNOT_USE_KEY: BACNET_ERROR_CODE = 91;
pub const BACNET_ERROR_CODE_ERROR_CODE_CANNOT_VERIFY_MESSAGE_ID: BACNET_ERROR_CODE = 92;
pub const BACNET_ERROR_CODE_ERROR_CODE_CORRECT_KEY_REVISION: BACNET_ERROR_CODE = 93;
pub const BACNET_ERROR_CODE_ERROR_CODE_DESTINATION_DEVICE_ID_REQUIRED: BACNET_ERROR_CODE = 94;
pub const BACNET_ERROR_CODE_ERROR_CODE_DUPLICATE_MESSAGE: BACNET_ERROR_CODE = 95;
pub const BACNET_ERROR_CODE_ERROR_CODE_ENCRYPTION_NOT_CONFIGURED: BACNET_ERROR_CODE = 96;
pub const BACNET_ERROR_CODE_ERROR_CODE_ENCRYPTION_REQUIRED: BACNET_ERROR_CODE = 97;
pub const BACNET_ERROR_CODE_ERROR_CODE_INCORRECT_KEY: BACNET_ERROR_CODE = 98;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_KEY_DATA: BACNET_ERROR_CODE = 99;
pub const BACNET_ERROR_CODE_ERROR_CODE_KEY_UPDATE_IN_PROGRESS: BACNET_ERROR_CODE = 100;
pub const BACNET_ERROR_CODE_ERROR_CODE_MALFORMED_MESSAGE: BACNET_ERROR_CODE = 101;
pub const BACNET_ERROR_CODE_ERROR_CODE_NOT_KEY_SERVER: BACNET_ERROR_CODE = 102;
pub const BACNET_ERROR_CODE_ERROR_CODE_SECURITY_NOT_CONFIGURED: BACNET_ERROR_CODE = 103;
pub const BACNET_ERROR_CODE_ERROR_CODE_SOURCE_SECURITY_REQUIRED: BACNET_ERROR_CODE = 104;
pub const BACNET_ERROR_CODE_ERROR_CODE_TOO_MANY_KEYS: BACNET_ERROR_CODE = 105;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_AUTHENTICATION_TYPE: BACNET_ERROR_CODE = 106;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_KEY: BACNET_ERROR_CODE = 107;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_KEY_REVISION: BACNET_ERROR_CODE = 108;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_SOURCE_MESSAGE: BACNET_ERROR_CODE = 109;
pub const BACNET_ERROR_CODE_ERROR_CODE_NOT_ROUTER_TO_DNET: BACNET_ERROR_CODE = 110;
pub const BACNET_ERROR_CODE_ERROR_CODE_ROUTER_BUSY: BACNET_ERROR_CODE = 111;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_NETWORK_MESSAGE: BACNET_ERROR_CODE = 112;
pub const BACNET_ERROR_CODE_ERROR_CODE_MESSAGE_TOO_LONG: BACNET_ERROR_CODE = 113;
pub const BACNET_ERROR_CODE_ERROR_CODE_SECURITY_ERROR: BACNET_ERROR_CODE = 114;
pub const BACNET_ERROR_CODE_ERROR_CODE_ADDRESSING_ERROR: BACNET_ERROR_CODE = 115;
pub const BACNET_ERROR_CODE_ERROR_CODE_WRITE_BDT_FAILED: BACNET_ERROR_CODE = 116;
pub const BACNET_ERROR_CODE_ERROR_CODE_READ_BDT_FAILED: BACNET_ERROR_CODE = 117;
pub const BACNET_ERROR_CODE_ERROR_CODE_REGISTER_FOREIGN_DEVICE_FAILED: BACNET_ERROR_CODE = 118;
pub const BACNET_ERROR_CODE_ERROR_CODE_READ_FDT_FAILED: BACNET_ERROR_CODE = 119;
pub const BACNET_ERROR_CODE_ERROR_CODE_DELETE_FDT_ENTRY_FAILED: BACNET_ERROR_CODE = 120;
pub const BACNET_ERROR_CODE_ERROR_CODE_DISTRIBUTE_BROADCAST_FAILED: BACNET_ERROR_CODE = 121;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_FILE_SIZE: BACNET_ERROR_CODE = 122;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_APDU_TOO_LONG: BACNET_ERROR_CODE = 123;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_APPLICATION_EXCEEDED_REPLY_TIME: BACNET_ERROR_CODE =
    124;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_OUT_OF_RESOURCES: BACNET_ERROR_CODE = 125;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_TSM_TIMEOUT: BACNET_ERROR_CODE = 126;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_WINDOW_SIZE_OUT_OF_RANGE: BACNET_ERROR_CODE = 127;
pub const BACNET_ERROR_CODE_ERROR_CODE_FILE_FULL: BACNET_ERROR_CODE = 128;
pub const BACNET_ERROR_CODE_ERROR_CODE_INCONSISTENT_CONFIGURATION: BACNET_ERROR_CODE = 129;
pub const BACNET_ERROR_CODE_ERROR_CODE_INCONSISTENT_OBJECT_TYPE: BACNET_ERROR_CODE = 130;
pub const BACNET_ERROR_CODE_ERROR_CODE_INTERNAL_ERROR: BACNET_ERROR_CODE = 131;
pub const BACNET_ERROR_CODE_ERROR_CODE_NOT_CONFIGURED: BACNET_ERROR_CODE = 132;
pub const BACNET_ERROR_CODE_ERROR_CODE_OUT_OF_MEMORY: BACNET_ERROR_CODE = 133;
pub const BACNET_ERROR_CODE_ERROR_CODE_VALUE_TOO_LONG: BACNET_ERROR_CODE = 134;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_INSUFFICIENT_SECURITY: BACNET_ERROR_CODE = 135;
pub const BACNET_ERROR_CODE_ERROR_CODE_ABORT_SECURITY_ERROR: BACNET_ERROR_CODE = 136;
pub const BACNET_ERROR_CODE_ERROR_CODE_DUPLICATE_ENTRY: BACNET_ERROR_CODE = 137;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_VALUE_IN_THIS_STATE: BACNET_ERROR_CODE = 138;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_OPERATION_IN_THIS_STATE: BACNET_ERROR_CODE = 139;
pub const BACNET_ERROR_CODE_ERROR_CODE_LIST_ITEM_NOT_NUMBERED: BACNET_ERROR_CODE = 140;
pub const BACNET_ERROR_CODE_ERROR_CODE_LIST_ITEM_NOT_TIMESTAMPED: BACNET_ERROR_CODE = 141;
pub const BACNET_ERROR_CODE_ERROR_CODE_INVALID_DATA_ENCODING: BACNET_ERROR_CODE = 142;
pub const BACNET_ERROR_CODE_ERROR_CODE_BVLC_FUNCTION_UNKNOWN: BACNET_ERROR_CODE = 143;
pub const BACNET_ERROR_CODE_ERROR_CODE_BVLC_PROPRIETARY_FUNCTION_UNKNOWN: BACNET_ERROR_CODE = 144;
pub const BACNET_ERROR_CODE_ERROR_CODE_HEADER_ENCODING_ERROR: BACNET_ERROR_CODE = 145;
pub const BACNET_ERROR_CODE_ERROR_CODE_HEADER_NOT_UNDERSTOOD: BACNET_ERROR_CODE = 146;
pub const BACNET_ERROR_CODE_ERROR_CODE_MESSAGE_INCOMPLETE: BACNET_ERROR_CODE = 147;
pub const BACNET_ERROR_CODE_ERROR_CODE_NOT_A_BACNET_SC_HUB: BACNET_ERROR_CODE = 148;
pub const BACNET_ERROR_CODE_ERROR_CODE_PAYLOAD_EXPECTED: BACNET_ERROR_CODE = 149;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNEXPECTED_DATA: BACNET_ERROR_CODE = 150;
pub const BACNET_ERROR_CODE_ERROR_CODE_NODE_DUPLICATE_VMAC: BACNET_ERROR_CODE = 151;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_UNEXPECTED_RESPONSE_CODE: BACNET_ERROR_CODE = 152;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_NO_UPGRADE: BACNET_ERROR_CODE = 153;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_RESOURCE_NOT_LOCAL: BACNET_ERROR_CODE = 154;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_PROXY_AUTHENTICATION_FAILED: BACNET_ERROR_CODE = 155;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_RESPONSE_TIMEOUT: BACNET_ERROR_CODE = 156;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_RESPONSE_SYNTAX_ERROR: BACNET_ERROR_CODE = 157;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_RESPONSE_VALUE_ERROR: BACNET_ERROR_CODE = 158;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_RESPONSE_MISSING_HEADER: BACNET_ERROR_CODE = 159;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_WEBSOCKET_HEADER_ERROR: BACNET_ERROR_CODE = 160;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_UPGRADE_REQUIRED: BACNET_ERROR_CODE = 161;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_UPGRADE_ERROR: BACNET_ERROR_CODE = 162;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_TEMPORARY_UNAVAILABLE: BACNET_ERROR_CODE = 163;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_NOT_A_SERVER: BACNET_ERROR_CODE = 164;
pub const BACNET_ERROR_CODE_ERROR_CODE_HTTP_ERROR: BACNET_ERROR_CODE = 165;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_SCHEME_NOT_SUPPORTED: BACNET_ERROR_CODE = 166;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_UNKNOWN_CONTROL_MESSAGE: BACNET_ERROR_CODE = 167;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_CLOSE_ERROR: BACNET_ERROR_CODE = 168;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_CLOSED_BY_PEER: BACNET_ERROR_CODE = 169;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_ENDPOINT_LEAVES: BACNET_ERROR_CODE = 170;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_PROTOCOL_ERROR: BACNET_ERROR_CODE = 171;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_DATA_NOT_ACCEPTED: BACNET_ERROR_CODE = 172;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_CLOSED_ABNORMALLY: BACNET_ERROR_CODE = 173;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_DATA_INCONSISTENT: BACNET_ERROR_CODE = 174;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_DATA_AGAINST_POLICY: BACNET_ERROR_CODE = 175;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_FRAME_TOO_LONG: BACNET_ERROR_CODE = 176;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_EXTENSION_MISSING: BACNET_ERROR_CODE = 177;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_REQUEST_UNAVAILABLE: BACNET_ERROR_CODE = 178;
pub const BACNET_ERROR_CODE_ERROR_CODE_WEBSOCKET_ERROR: BACNET_ERROR_CODE = 179;
pub const BACNET_ERROR_CODE_ERROR_CODE_TLS_CLIENT_CERTIFICATE_ERROR: BACNET_ERROR_CODE = 180;
pub const BACNET_ERROR_CODE_ERROR_CODE_TLS_SERVER_CERTIFICATE_ERROR: BACNET_ERROR_CODE = 181;
pub const BACNET_ERROR_CODE_ERROR_CODE_TLS_CLIENT_AUTHENTICATION_FAILED: BACNET_ERROR_CODE = 182;
pub const BACNET_ERROR_CODE_ERROR_CODE_TLS_SERVER_AUTHENTICATION_FAILED: BACNET_ERROR_CODE = 183;
pub const BACNET_ERROR_CODE_ERROR_CODE_TLS_CLIENT_CERTIFICATE_EXPIRED: BACNET_ERROR_CODE = 184;
pub const BACNET_ERROR_CODE_ERROR_CODE_TLS_SERVER_CERTIFICATE_EXPIRED: BACNET_ERROR_CODE = 185;
pub const BACNET_ERROR_CODE_ERROR_CODE_TLS_CLIENT_CERTIFICATE_REVOKED: BACNET_ERROR_CODE = 186;
pub const BACNET_ERROR_CODE_ERROR_CODE_TLS_SERVER_CERTIFICATE_REVOKED: BACNET_ERROR_CODE = 187;
pub const BACNET_ERROR_CODE_ERROR_CODE_TLS_ERROR: BACNET_ERROR_CODE = 188;
pub const BACNET_ERROR_CODE_ERROR_CODE_DNS_UNAVAILABLE: BACNET_ERROR_CODE = 189;
pub const BACNET_ERROR_CODE_ERROR_CODE_DNS_NAME_RESOLUTION_FAILED: BACNET_ERROR_CODE = 190;
pub const BACNET_ERROR_CODE_ERROR_CODE_DNS_RESOLVER_FAILURE: BACNET_ERROR_CODE = 191;
pub const BACNET_ERROR_CODE_ERROR_CODE_DNS_ERROR: BACNET_ERROR_CODE = 192;
pub const BACNET_ERROR_CODE_ERROR_CODE_TCP_CONNECT_TIMEOUT: BACNET_ERROR_CODE = 193;
pub const BACNET_ERROR_CODE_ERROR_CODE_TCP_CONNECTION_REFUSED: BACNET_ERROR_CODE = 194;
pub const BACNET_ERROR_CODE_ERROR_CODE_TCP_CLOSED_BY_LOCAL: BACNET_ERROR_CODE = 195;
pub const BACNET_ERROR_CODE_ERROR_CODE_TCP_CLOSED_OTHER: BACNET_ERROR_CODE = 196;
pub const BACNET_ERROR_CODE_ERROR_CODE_TCP_ERROR: BACNET_ERROR_CODE = 197;
pub const BACNET_ERROR_CODE_ERROR_CODE_IP_ADDRESS_NOT_REACHABLE: BACNET_ERROR_CODE = 198;
pub const BACNET_ERROR_CODE_ERROR_CODE_IP_ERROR: BACNET_ERROR_CODE = 199;
pub const BACNET_ERROR_CODE_ERROR_CODE_CERTIFICATE_EXPIRED: BACNET_ERROR_CODE = 200;
pub const BACNET_ERROR_CODE_ERROR_CODE_CERTIFICATE_INVALID: BACNET_ERROR_CODE = 201;
pub const BACNET_ERROR_CODE_ERROR_CODE_CERTIFICATE_MALFORMED: BACNET_ERROR_CODE = 202;
pub const BACNET_ERROR_CODE_ERROR_CODE_CERTIFICATE_REVOKED: BACNET_ERROR_CODE = 203;
pub const BACNET_ERROR_CODE_ERROR_CODE_UNKNOWN_SECURITY_KEY: BACNET_ERROR_CODE = 204;
pub const BACNET_ERROR_CODE_ERROR_CODE_REFERENCED_PORT_IN_ERROR: BACNET_ERROR_CODE = 205;
pub const BACNET_ERROR_CODE_ERROR_CODE_RESERVED_MAX: BACNET_ERROR_CODE = 255;
pub const BACNET_ERROR_CODE_ERROR_CODE_PROPRIETARY_FIRST: BACNET_ERROR_CODE = 256;
pub const BACNET_ERROR_CODE_ERROR_CODE_PROPRIETARY_LAST: BACNET_ERROR_CODE = 65535;
pub type BACNET_ERROR_CODE = ::std::os::raw::c_uint;
pub const BACNET_REINITIALIZED_STATE_BACNET_REINIT_COLDSTART: BACNET_REINITIALIZED_STATE = 0;
pub const BACNET_REINITIALIZED_STATE_BACNET_REINIT_WARMSTART: BACNET_REINITIALIZED_STATE = 1;
pub const BACNET_REINITIALIZED_STATE_BACNET_REINIT_STARTBACKUP: BACNET_REINITIALIZED_STATE = 2;
pub const BACNET_REINITIALIZED_STATE_BACNET_REINIT_ENDBACKUP: BACNET_REINITIALIZED_STATE = 3;
pub const BACNET_REINITIALIZED_STATE_BACNET_REINIT_STARTRESTORE: BACNET_REINITIALIZED_STATE = 4;
pub const BACNET_REINITIALIZED_STATE_BACNET_REINIT_ENDRESTORE: BACNET_REINITIALIZED_STATE = 5;
pub const BACNET_REINITIALIZED_STATE_BACNET_REINIT_ABORTRESTORE: BACNET_REINITIALIZED_STATE = 6;
pub const BACNET_REINITIALIZED_STATE_BACNET_REINIT_ACTIVATE_CHANGES: BACNET_REINITIALIZED_STATE = 7;
pub const BACNET_REINITIALIZED_STATE_BACNET_REINIT_IDLE: BACNET_REINITIALIZED_STATE = 255;
pub const BACNET_REINITIALIZED_STATE_BACNET_REINIT_MAX: BACNET_REINITIALIZED_STATE = 255;
pub type BACNET_REINITIALIZED_STATE = ::std::os::raw::c_uint;
pub const BACnetNodeType_BACNET_NODE_UNKNOWN: BACnetNodeType = 0;
pub const BACnetNodeType_BACNET_NODE_SYSTEM: BACnetNodeType = 1;
pub const BACnetNodeType_BACNET_NODE_NETWORK: BACnetNodeType = 2;
pub const BACnetNodeType_BACNET_NODE_DEVICE: BACnetNodeType = 3;
pub const BACnetNodeType_BACNET_NODE_ORGANIZATIONAL: BACnetNodeType = 4;
pub const BACnetNodeType_BACNET_NODE_AREA: BACnetNodeType = 5;
pub const BACnetNodeType_BACNET_NODE_EQUIPMENT: BACnetNodeType = 6;
pub const BACnetNodeType_BACNET_NODE_POINT: BACnetNodeType = 7;
pub const BACnetNodeType_BACNET_NODE_COLLECTION: BACnetNodeType = 8;
pub const BACnetNodeType_BACNET_NODE_PROPERTY: BACnetNodeType = 9;
pub const BACnetNodeType_BACNET_NODE_FUNCTIONAL: BACnetNodeType = 10;
pub const BACnetNodeType_BACNET_NODE_OTHER: BACnetNodeType = 11;
pub type BACnetNodeType = ::std::os::raw::c_uint;
pub use self::BACnetNodeType as BACNET_NODE_TYPE;
pub const BACnetShedState_BACNET_SHED_INACTIVE: BACnetShedState = 0;
pub const BACnetShedState_BACNET_SHED_REQUEST_PENDING: BACnetShedState = 1;
pub const BACnetShedState_BACNET_SHED_COMPLIANT: BACnetShedState = 2;
pub const BACnetShedState_BACNET_SHED_NON_COMPLIANT: BACnetShedState = 3;
pub type BACnetShedState = ::std::os::raw::c_uint;
pub use self::BACnetShedState as BACNET_SHED_STATE;
pub const BACnetLightingOperation_BACNET_LIGHTS_NONE: BACnetLightingOperation = 0;
pub const BACnetLightingOperation_BACNET_LIGHTS_FADE_TO: BACnetLightingOperation = 1;
pub const BACnetLightingOperation_BACNET_LIGHTS_RAMP_TO: BACnetLightingOperation = 2;
pub const BACnetLightingOperation_BACNET_LIGHTS_STEP_UP: BACnetLightingOperation = 3;
pub const BACnetLightingOperation_BACNET_LIGHTS_STEP_DOWN: BACnetLightingOperation = 4;
pub const BACnetLightingOperation_BACNET_LIGHTS_STEP_ON: BACnetLightingOperation = 5;
pub const BACnetLightingOperation_BACNET_LIGHTS_STEP_OFF: BACnetLightingOperation = 6;
pub const BACnetLightingOperation_BACNET_LIGHTS_WARN: BACnetLightingOperation = 7;
pub const BACnetLightingOperation_BACNET_LIGHTS_WARN_OFF: BACnetLightingOperation = 8;
pub const BACnetLightingOperation_BACNET_LIGHTS_WARN_RELINQUISH: BACnetLightingOperation = 9;
pub const BACnetLightingOperation_BACNET_LIGHTS_STOP: BACnetLightingOperation = 10;
pub const BACnetLightingOperation_MAX_BACNET_LIGHTING_OPERATION: BACnetLightingOperation = 11;
pub const BACnetLightingOperation_BACNET_LIGHTS_PROPRIETARY_FIRST: BACnetLightingOperation = 256;
pub const BACnetLightingOperation_BACNET_LIGHTS_PROPRIETARY_LAST: BACnetLightingOperation = 65535;
pub type BACnetLightingOperation = ::std::os::raw::c_uint;
pub use self::BACnetLightingOperation as BACNET_LIGHTING_OPERATION;
pub const BACnetLightingInProgress_BACNET_LIGHTING_IDLE: BACnetLightingInProgress = 0;
pub const BACnetLightingInProgress_BACNET_LIGHTING_FADE_ACTIVE: BACnetLightingInProgress = 1;
pub const BACnetLightingInProgress_BACNET_LIGHTING_RAMP_ACTIVE: BACnetLightingInProgress = 2;
pub const BACnetLightingInProgress_BACNET_LIGHTING_NOT_CONTROLLED: BACnetLightingInProgress = 3;
pub const BACnetLightingInProgress_BACNET_LIGHTING_OTHER: BACnetLightingInProgress = 4;
pub const BACnetLightingInProgress_BACNET_LIGHTING_TRIM_ACTIVE: BACnetLightingInProgress = 5;
pub const BACnetLightingInProgress_MAX_BACNET_LIGHTING_IN_PROGRESS: BACnetLightingInProgress = 6;
pub type BACnetLightingInProgress = ::std::os::raw::c_uint;
pub use self::BACnetLightingInProgress as BACNET_LIGHTING_IN_PROGRESS;
pub const BACnetLightingTransition_BACNET_LIGHTING_TRANSITION_IDLE: BACnetLightingTransition = 0;
pub const BACnetLightingTransition_BACNET_LIGHTING_TRANSITION_FADE: BACnetLightingTransition = 1;
pub const BACnetLightingTransition_BACNET_LIGHTING_TRANSITION_RAMP: BACnetLightingTransition = 2;
pub const BACnetLightingTransition_MAX_BACNET_LIGHTING_TRANSITION: BACnetLightingTransition = 3;
pub const BACnetLightingTransition_BACNET_LIGHTING_TRANSITION_PROPRIETARY_FIRST:
    BACnetLightingTransition = 64;
pub const BACnetLightingTransition_BACNET_LIGHTING_TRANSITION_PROPRIETARY_LAST:
    BACnetLightingTransition = 255;
pub type BACnetLightingTransition = ::std::os::raw::c_uint;
pub use self::BACnetLightingTransition as BACNET_LIGHTING_TRANSITION;
pub const BACnetColorOperation_BACNET_COLOR_OPERATION_NONE: BACnetColorOperation = 0;
pub const BACnetColorOperation_BACNET_COLOR_OPERATION_FADE_TO_COLOR: BACnetColorOperation = 1;
pub const BACnetColorOperation_BACNET_COLOR_OPERATION_FADE_TO_CCT: BACnetColorOperation = 2;
pub const BACnetColorOperation_BACNET_COLOR_OPERATION_RAMP_TO_CCT: BACnetColorOperation = 3;
pub const BACnetColorOperation_BACNET_COLOR_OPERATION_STEP_UP_CCT: BACnetColorOperation = 4;
pub const BACnetColorOperation_BACNET_COLOR_OPERATION_STEP_DOWN_CCT: BACnetColorOperation = 5;
pub const BACnetColorOperation_BACNET_COLOR_OPERATION_STOP: BACnetColorOperation = 6;
pub const BACnetColorOperation_BACNET_COLOR_OPERATION_MAX: BACnetColorOperation = 7;
pub type BACnetColorOperation = ::std::os::raw::c_uint;
pub use self::BACnetColorOperation as BACNET_COLOR_OPERATION;
pub const BACnetColorOperationInProgress_BACNET_COLOR_OPERATION_IN_PROGRESS_IDLE:
    BACnetColorOperationInProgress = 0;
pub const BACnetColorOperationInProgress_BACNET_COLOR_OPERATION_IN_PROGRESS_FADE_ACTIVE:
    BACnetColorOperationInProgress = 1;
pub const BACnetColorOperationInProgress_BACNET_COLOR_OPERATION_IN_PROGRESS_RAMP_ACTIVE:
    BACnetColorOperationInProgress = 2;
pub const BACnetColorOperationInProgress_BACNET_COLOR_OPERATION_IN_PROGRESS_NOT_CONTROLLED:
    BACnetColorOperationInProgress = 3;
pub const BACnetColorOperationInProgress_BACNET_COLOR_OPERATION_IN_PROGRESS_OTHER:
    BACnetColorOperationInProgress = 4;
pub const BACnetColorOperationInProgress_BACNET_COLOR_OPERATION_IN_PROGRESS_MAX:
    BACnetColorOperationInProgress = 5;
pub type BACnetColorOperationInProgress = ::std::os::raw::c_uint;
pub use self::BACnetColorOperationInProgress as BACNET_COLOR_OPERATION_IN_PROGRESS;
pub const BACnetColorTransition_BACNET_COLOR_TRANSITION_NONE: BACnetColorTransition = 0;
pub const BACnetColorTransition_BACNET_COLOR_TRANSITION_FADE: BACnetColorTransition = 1;
pub const BACnetColorTransition_BACNET_COLOR_TRANSITION_RAMP: BACnetColorTransition = 2;
pub const BACnetColorTransition_BACNET_COLOR_TRANSITION_MAX: BACnetColorTransition = 3;
pub type BACnetColorTransition = ::std::os::raw::c_uint;
pub use self::BACnetColorTransition as BACNET_COLOR_TRANSITION;
pub const BACnetDaysOfWeek_BACNET_DAYS_OF_WEEK_MONDAY: BACnetDaysOfWeek = 0;
pub const BACnetDaysOfWeek_BACNET_DAYS_OF_WEEK_TUESDAY: BACnetDaysOfWeek = 1;
pub const BACnetDaysOfWeek_BACNET_DAYS_OF_WEEK_WEDNESDAY: BACnetDaysOfWeek = 2;
pub const BACnetDaysOfWeek_BACNET_DAYS_OF_WEEK_THURSDAY: BACnetDaysOfWeek = 3;
pub const BACnetDaysOfWeek_BACNET_DAYS_OF_WEEK_FRIDAY: BACnetDaysOfWeek = 4;
pub const BACnetDaysOfWeek_BACNET_DAYS_OF_WEEK_SATURDAY: BACnetDaysOfWeek = 5;
pub const BACnetDaysOfWeek_BACNET_DAYS_OF_WEEK_SUNDAY: BACnetDaysOfWeek = 6;
pub const BACnetDaysOfWeek_MAX_BACNET_DAYS_OF_WEEK: BACnetDaysOfWeek = 7;
pub type BACnetDaysOfWeek = ::std::os::raw::c_uint;
pub use self::BACnetDaysOfWeek as BACNET_DAYS_OF_WEEK;
pub const BACnetEventTransitionBits_TRANSITION_TO_OFFNORMAL: BACnetEventTransitionBits = 0;
pub const BACnetEventTransitionBits_TRANSITION_TO_FAULT: BACnetEventTransitionBits = 1;
pub const BACnetEventTransitionBits_TRANSITION_TO_NORMAL: BACnetEventTransitionBits = 2;
pub const BACnetEventTransitionBits_MAX_BACNET_EVENT_TRANSITION: BACnetEventTransitionBits = 3;
pub type BACnetEventTransitionBits = ::std::os::raw::c_uint;
pub use self::BACnetEventTransitionBits as BACNET_EVENT_TRANSITION_BITS;
pub const BACnetEventTransitionMask_TRANSITION_TO_OFFNORMAL_MASKED: BACnetEventTransitionMask = 1;
pub const BACnetEventTransitionMask_TRANSITION_TO_FAULT_MASKED: BACnetEventTransitionMask = 2;
pub const BACnetEventTransitionMask_TRANSITION_TO_NORMAL_MASKED: BACnetEventTransitionMask = 4;
pub type BACnetEventTransitionMask = ::std::os::raw::c_uint;
pub use self::BACnetEventTransitionMask as BACNET_EVENT_TRANSITION_MASK;
pub const BACNET_DOOR_ALARM_STATE_DOOR_ALARM_STATE_NORMAL: BACNET_DOOR_ALARM_STATE = 0;
pub const BACNET_DOOR_ALARM_STATE_DOOR_ALARM_STATE_ALARM: BACNET_DOOR_ALARM_STATE = 1;
pub const BACNET_DOOR_ALARM_STATE_DOOR_ALARM_STATE_DOOR_OPEN_TOO_LONG: BACNET_DOOR_ALARM_STATE = 2;
pub const BACNET_DOOR_ALARM_STATE_DOOR_ALARM_STATE_FORCED_OPEN: BACNET_DOOR_ALARM_STATE = 3;
pub const BACNET_DOOR_ALARM_STATE_DOOR_ALARM_STATE_TAMPER: BACNET_DOOR_ALARM_STATE = 4;
pub const BACNET_DOOR_ALARM_STATE_DOOR_ALARM_STATE_DOOR_FAULT: BACNET_DOOR_ALARM_STATE = 5;
pub const BACNET_DOOR_ALARM_STATE_DOOR_ALARM_STATE_LOCK_DOWN: BACNET_DOOR_ALARM_STATE = 6;
pub const BACNET_DOOR_ALARM_STATE_DOOR_ALARM_STATE_FREE_ACCESS: BACNET_DOOR_ALARM_STATE = 7;
pub const BACNET_DOOR_ALARM_STATE_DOOR_ALARM_STATE_EGRESS_OPEN: BACNET_DOOR_ALARM_STATE = 8;
pub type BACNET_DOOR_ALARM_STATE = ::std::os::raw::c_uint;
pub const BACNET_DOOR_SECURED_STATUS_DOOR_SECURED_STATUS_SECURED: BACNET_DOOR_SECURED_STATUS = 0;
pub const BACNET_DOOR_SECURED_STATUS_DOOR_SECURED_STATUS_UNSECURED: BACNET_DOOR_SECURED_STATUS = 1;
pub const BACNET_DOOR_SECURED_STATUS_DOOR_SECURED_STATUS_UNKNOWN: BACNET_DOOR_SECURED_STATUS = 2;
pub type BACNET_DOOR_SECURED_STATUS = ::std::os::raw::c_uint;
pub const BACNET_DOOR_STATUS_DOOR_STATUS_CLOSED: BACNET_DOOR_STATUS = 0;
pub const BACNET_DOOR_STATUS_DOOR_STATUS_OPENED: BACNET_DOOR_STATUS = 1;
pub const BACNET_DOOR_STATUS_DOOR_STATUS_UNKNOWN: BACNET_DOOR_STATUS = 2;
pub const BACNET_DOOR_STATUS_DOOR_STATUS_DOOR_FAULT: BACNET_DOOR_STATUS = 3;
pub const BACNET_DOOR_STATUS_DOOR_STATUS_UNUSED: BACNET_DOOR_STATUS = 4;
pub const BACNET_DOOR_STATUS_DOOR_STATUS_NONE: BACNET_DOOR_STATUS = 5;
pub const BACNET_DOOR_STATUS_DOOR_STATUS_CLOSING: BACNET_DOOR_STATUS = 6;
pub const BACNET_DOOR_STATUS_DOOR_STATUS_OPENING: BACNET_DOOR_STATUS = 7;
pub const BACNET_DOOR_STATUS_DOOR_STATUS_SAFETY_LOCKED: BACNET_DOOR_STATUS = 8;
pub const BACNET_DOOR_STATUS_DOOR_STATUS_LIMITED_OPENED: BACNET_DOOR_STATUS = 9;
pub type BACNET_DOOR_STATUS = ::std::os::raw::c_uint;
pub const BACNET_DOOR_VALUE_DOOR_VALUE_LOCK: BACNET_DOOR_VALUE = 0;
pub const BACNET_DOOR_VALUE_DOOR_VALUE_UNLOCK: BACNET_DOOR_VALUE = 1;
pub const BACNET_DOOR_VALUE_DOOR_VALUE_PULSE_UNLOCK: BACNET_DOOR_VALUE = 2;
pub const BACNET_DOOR_VALUE_DOOR_VALUE_EXTENDED_PULSE_UNLOCK: BACNET_DOOR_VALUE = 3;
pub type BACNET_DOOR_VALUE = ::std::os::raw::c_uint;
pub const BACNET_LOCK_STATUS_LOCK_STATUS_LOCKED: BACNET_LOCK_STATUS = 0;
pub const BACNET_LOCK_STATUS_LOCK_STATUS_UNLOCKED: BACNET_LOCK_STATUS = 1;
pub const BACNET_LOCK_STATUS_LOCK_STATUS_LOCK_FAULT: BACNET_LOCK_STATUS = 2;
pub const BACNET_LOCK_STATUS_LOCK_STATUS_UNUSED: BACNET_LOCK_STATUS = 3;
pub const BACNET_LOCK_STATUS_LOCK_STATUS_UNKNOWN: BACNET_LOCK_STATUS = 4;
pub type BACNET_LOCK_STATUS = ::std::os::raw::c_uint;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_NONE: BACNET_ACCESS_EVENT = 0;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_GRANTED: BACNET_ACCESS_EVENT = 1;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_MUSTER: BACNET_ACCESS_EVENT = 2;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_PASSBACK_DETECTED: BACNET_ACCESS_EVENT = 3;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DURESS: BACNET_ACCESS_EVENT = 4;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_TRACE: BACNET_ACCESS_EVENT = 5;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_LOCKOUT_MAX_ATTEMPTS: BACNET_ACCESS_EVENT = 6;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_LOCKOUT_OTHER: BACNET_ACCESS_EVENT = 7;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_LOCKOUT_RELINQUISHED: BACNET_ACCESS_EVENT = 8;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_LOCKED_BY_HIGHER_AUTHORITY: BACNET_ACCESS_EVENT = 9;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_OUT_OF_SERVICE: BACNET_ACCESS_EVENT = 10;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_OUT_OF_SERVICE_RELINQUISHED: BACNET_ACCESS_EVENT = 11;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_ACCOMPANIMENT_BY: BACNET_ACCESS_EVENT = 12;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_AUTHENTICATION_FACTOR_READ: BACNET_ACCESS_EVENT = 13;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_AUTHORIZATION_DELAYED: BACNET_ACCESS_EVENT = 14;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_VERIFICATION_REQUIRED: BACNET_ACCESS_EVENT = 15;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_DENY_ALL: BACNET_ACCESS_EVENT = 128;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_UNKNOWN_CREDENTIAL: BACNET_ACCESS_EVENT = 129;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_AUTHENTICATION_UNAVAILABLE: BACNET_ACCESS_EVENT =
    130;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_AUTHENTICATION_FACTOR_TIMEOUT:
    BACNET_ACCESS_EVENT = 131;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_INCORRECT_AUTHENTICATION_FACTOR:
    BACNET_ACCESS_EVENT = 132;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_ZONE_NO_ACCESS_RIGHTS: BACNET_ACCESS_EVENT = 133;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_POINT_NO_ACCESS_RIGHTS: BACNET_ACCESS_EVENT = 134;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_NO_ACCESS_RIGHTS: BACNET_ACCESS_EVENT = 135;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_OUT_OF_TIME_RANGE: BACNET_ACCESS_EVENT = 136;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_THREAT_LEVEL: BACNET_ACCESS_EVENT = 137;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_PASSBACK: BACNET_ACCESS_EVENT = 138;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_UNEXPECTED_LOCATION_USAGE: BACNET_ACCESS_EVENT =
    139;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_MAX_ATTEMPTS: BACNET_ACCESS_EVENT = 140;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_LOWER_OCCUPANCY_LIMIT: BACNET_ACCESS_EVENT = 141;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_UPPER_OCCUPANCY_LIMIT: BACNET_ACCESS_EVENT = 142;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_AUTHENTICATION_FACTOR_LOST: BACNET_ACCESS_EVENT =
    143;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_AUTHENTICATION_FACTOR_STOLEN:
    BACNET_ACCESS_EVENT = 144;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_AUTHENTICATION_FACTOR_DAMAGED:
    BACNET_ACCESS_EVENT = 145;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_AUTHENTICATION_FACTOR_DESTROYED:
    BACNET_ACCESS_EVENT = 146;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_AUTHENTICATION_FACTOR_DISABLED:
    BACNET_ACCESS_EVENT = 147;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_AUTHENTICATION_FACTOR_ERROR: BACNET_ACCESS_EVENT =
    148;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_CREDENTIAL_UNASSIGNED: BACNET_ACCESS_EVENT = 149;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_CREDENTIAL_NOT_PROVISIONED: BACNET_ACCESS_EVENT =
    150;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_CREDENTIAL_NOT_YET_ACTIVE: BACNET_ACCESS_EVENT =
    151;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_CREDENTIAL_EXPIRED: BACNET_ACCESS_EVENT = 152;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_CREDENTIAL_MANUAL_DISABLE: BACNET_ACCESS_EVENT =
    153;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_CREDENTIAL_LOCKOUT: BACNET_ACCESS_EVENT = 154;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_CREDENTIAL_MAX_DAYS: BACNET_ACCESS_EVENT = 155;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_CREDENTIAL_MAX_USES: BACNET_ACCESS_EVENT = 156;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_CREDENTIAL_INACTIVITY: BACNET_ACCESS_EVENT = 157;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_CREDENTIAL_DISABLED: BACNET_ACCESS_EVENT = 158;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_NO_ACCOMPANIMENT: BACNET_ACCESS_EVENT = 159;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_INCORRECT_ACCOMPANIMENT: BACNET_ACCESS_EVENT =
    160;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_LOCKOUT: BACNET_ACCESS_EVENT = 161;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_VERIFICATION_FAILED: BACNET_ACCESS_EVENT = 162;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_VERIFICATION_TIMEOUT: BACNET_ACCESS_EVENT = 163;
pub const BACNET_ACCESS_EVENT_ACCESS_EVENT_DENIED_OTHER: BACNET_ACCESS_EVENT = 164;
pub type BACNET_ACCESS_EVENT = ::std::os::raw::c_uint;
pub const BACNET_AUTHENTICATION_STATUS_AUTHENTICATION_STATUS_NOT_READY:
    BACNET_AUTHENTICATION_STATUS = 0;
pub const BACNET_AUTHENTICATION_STATUS_AUTHENTICATION_STATUS_READY: BACNET_AUTHENTICATION_STATUS =
    1;
pub const BACNET_AUTHENTICATION_STATUS_AUTHENTICATION_STATUS_DISABLED:
    BACNET_AUTHENTICATION_STATUS = 2;
pub const BACNET_AUTHENTICATION_STATUS_AUTHENTICATION_STATUS_WAITING_FOR_AUTHENTICATION_FACTOR:
    BACNET_AUTHENTICATION_STATUS = 3;
pub const BACNET_AUTHENTICATION_STATUS_AUTHENTICATION_STATUS_WAITING_FOR_ACCOMPANIMENT:
    BACNET_AUTHENTICATION_STATUS = 4;
pub const BACNET_AUTHENTICATION_STATUS_AUTHENTICATION_STATUS_WAITING_FOR_VERIFICATION:
    BACNET_AUTHENTICATION_STATUS = 5;
pub const BACNET_AUTHENTICATION_STATUS_AUTHENTICATION_STATUS_IN_PROGRESS:
    BACNET_AUTHENTICATION_STATUS = 6;
pub type BACNET_AUTHENTICATION_STATUS = ::std::os::raw::c_uint;
pub const BACNET_AUTHORIZATION_MODE_AUTHORIZATION_MODE_AUTHORIZE: BACNET_AUTHORIZATION_MODE = 0;
pub const BACNET_AUTHORIZATION_MODE_AUTHORIZATION_MODE_GRANT_ACTIVE: BACNET_AUTHORIZATION_MODE = 1;
pub const BACNET_AUTHORIZATION_MODE_AUTHORIZATION_MODE_DENY_ALL: BACNET_AUTHORIZATION_MODE = 2;
pub const BACNET_AUTHORIZATION_MODE_AUTHORIZATION_MODE_VERIFICATION_REQUIRED:
    BACNET_AUTHORIZATION_MODE = 3;
pub const BACNET_AUTHORIZATION_MODE_AUTHORIZATION_MODE_AUTHORIZATION_DELAYED:
    BACNET_AUTHORIZATION_MODE = 4;
pub const BACNET_AUTHORIZATION_MODE_AUTHORIZATION_MODE_NONE: BACNET_AUTHORIZATION_MODE = 5;
pub type BACNET_AUTHORIZATION_MODE = ::std::os::raw::c_uint;
pub const BACNET_ACCESS_PASSBACK_MODE_ACCESS_PASSBACK_MODE_PASSBACK_OFF:
    BACNET_ACCESS_PASSBACK_MODE = 0;
pub const BACNET_ACCESS_PASSBACK_MODE_ACCESS_PASSBACK_MODE_HARD_PASSBACK:
    BACNET_ACCESS_PASSBACK_MODE = 1;
pub const BACNET_ACCESS_PASSBACK_MODE_ACCESS_PASSBACK_MODE_SOFT_PASSBACK:
    BACNET_ACCESS_PASSBACK_MODE = 2;
pub type BACNET_ACCESS_PASSBACK_MODE = ::std::os::raw::c_uint;
pub const BACNET_ACCESS_ZONE_OCCUPANCY_STATE_ACCESS_ZONE_OCCUPANCY_STATE_NORMAL:
    BACNET_ACCESS_ZONE_OCCUPANCY_STATE = 0;
pub const BACNET_ACCESS_ZONE_OCCUPANCY_STATE_ACCESS_ZONE_OCCUPANCY_STATE_BELOW_LOWER_LIMIT:
    BACNET_ACCESS_ZONE_OCCUPANCY_STATE = 1;
pub const BACNET_ACCESS_ZONE_OCCUPANCY_STATE_ACCESS_ZONE_OCCUPANCY_STATE_AT_LOWER_LIMIT:
    BACNET_ACCESS_ZONE_OCCUPANCY_STATE = 2;
pub const BACNET_ACCESS_ZONE_OCCUPANCY_STATE_ACCESS_ZONE_OCCUPANCY_STATE_AT_UPPER_LIMIT:
    BACNET_ACCESS_ZONE_OCCUPANCY_STATE = 3;
pub const BACNET_ACCESS_ZONE_OCCUPANCY_STATE_ACCESS_ZONE_OCCUPANCY_STATE_ABOVE_UPPER_LIMIT:
    BACNET_ACCESS_ZONE_OCCUPANCY_STATE = 4;
pub const BACNET_ACCESS_ZONE_OCCUPANCY_STATE_ACCESS_ZONE_OCCUPANCY_STATE_DISABLED:
    BACNET_ACCESS_ZONE_OCCUPANCY_STATE = 5;
pub const BACNET_ACCESS_ZONE_OCCUPANCY_STATE_ACCESS_ZONE_OCCUPANCY_STATE_NOT_SUPPORTED:
    BACNET_ACCESS_ZONE_OCCUPANCY_STATE = 6;
pub type BACNET_ACCESS_ZONE_OCCUPANCY_STATE = ::std::os::raw::c_uint;
pub const BACNET_ACCESS_USER_TYPE_ACCESS_USER_TYPE_ASSET: BACNET_ACCESS_USER_TYPE = 0;
pub const BACNET_ACCESS_USER_TYPE_ACCESS_USER_TYPE_GROUP: BACNET_ACCESS_USER_TYPE = 1;
pub const BACNET_ACCESS_USER_TYPE_ACCESS_USER_TYPE_PERSON: BACNET_ACCESS_USER_TYPE = 2;
pub type BACNET_ACCESS_USER_TYPE = ::std::os::raw::c_uint;
pub const BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE_ACCESS_AUTHENTICATION_FACTOR_DISABLE_NONE:
    BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE = 0;
pub const BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE_ACCESS_AUTHENTICATION_FACTOR_DISABLE_DISABLED : BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE = 1 ;
pub const BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE_ACCESS_AUTHENTICATION_FACTOR_DISABLE_DISABLED_LOST : BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE = 2 ;
pub const BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE_ACCESS_AUTHENTICATION_FACTOR_DISABLE_DISABLED_STOLEN : BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE = 3 ;
pub const BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE_ACCESS_AUTHENTICATION_FACTOR_DISABLE_DISABLED_DAMAGED : BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE = 4 ;
pub const BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE_ACCESS_AUTHENTICATION_FACTOR_DISABLE_DISABLED_DESTROYED : BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE = 5 ;
pub const BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE_ACCESS_AUTHENTICATION_FACTOR_DISABLE_MAX:
    BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE = 6;
pub type BACNET_ACCESS_AUTHENTICATION_FACTOR_DISABLE = ::std::os::raw::c_uint;
pub const BACNET_AUTHORIZATION_EXEMPTION_AUTHORIZATION_EXEMPTION_PASSBACK:
    BACNET_AUTHORIZATION_EXEMPTION = 0;
pub const BACNET_AUTHORIZATION_EXEMPTION_AUTHORIZATION_EXEMPTION_OCCUPANCY_CHECK:
    BACNET_AUTHORIZATION_EXEMPTION = 1;
pub const BACNET_AUTHORIZATION_EXEMPTION_AUTHORIZATION_EXEMPTION_ACCESS_RIGHTS:
    BACNET_AUTHORIZATION_EXEMPTION = 2;
pub const BACNET_AUTHORIZATION_EXEMPTION_AUTHORIZATION_EXEMPTION_LOCKOUT:
    BACNET_AUTHORIZATION_EXEMPTION = 3;
pub const BACNET_AUTHORIZATION_EXEMPTION_AUTHORIZATION_EXEMPTION_DENY:
    BACNET_AUTHORIZATION_EXEMPTION = 4;
pub const BACNET_AUTHORIZATION_EXEMPTION_AUTHORIZATION_EXEMPTION_VERIFICATION:
    BACNET_AUTHORIZATION_EXEMPTION = 5;
pub const BACNET_AUTHORIZATION_EXEMPTION_AUTHORIZATION_EXEMPTION_AUTHORIZATION_DELAY:
    BACNET_AUTHORIZATION_EXEMPTION = 6;
pub type BACNET_AUTHORIZATION_EXEMPTION = ::std::os::raw::c_uint;
pub const BACNET_NETWORK_REJECT_REASONS_NETWORK_REJECT_UNKNOWN_ERROR:
    BACNET_NETWORK_REJECT_REASONS = 0;
pub const BACNET_NETWORK_REJECT_REASONS_NETWORK_REJECT_NO_ROUTE: BACNET_NETWORK_REJECT_REASONS = 1;
pub const BACNET_NETWORK_REJECT_REASONS_NETWORK_REJECT_ROUTER_BUSY: BACNET_NETWORK_REJECT_REASONS =
    2;
pub const BACNET_NETWORK_REJECT_REASONS_NETWORK_REJECT_UNKNOWN_MESSAGE_TYPE:
    BACNET_NETWORK_REJECT_REASONS = 3;
pub const BACNET_NETWORK_REJECT_REASONS_NETWORK_REJECT_MESSAGE_TOO_LONG:
    BACNET_NETWORK_REJECT_REASONS = 4;
pub const BACNET_NETWORK_REJECT_REASONS_NETWORK_REJECT_BACNET_SECURITY:
    BACNET_NETWORK_REJECT_REASONS = 5;
pub const BACNET_NETWORK_REJECT_REASONS_NETWORK_REJECT_BAD_ADDRESS: BACNET_NETWORK_REJECT_REASONS =
    6;
pub const BACNET_NETWORK_REJECT_REASONS_NETWORK_REJECT_REASON_INVALID:
    BACNET_NETWORK_REJECT_REASONS = 7;
pub type BACNET_NETWORK_REJECT_REASONS = ::std::os::raw::c_uint;
pub const BACnetWriteStatus_BACNET_WRITE_STATUS_IDLE: BACnetWriteStatus = 0;
pub const BACnetWriteStatus_BACNET_WRITE_STATUS_IN_PROGRESS: BACnetWriteStatus = 1;
pub const BACnetWriteStatus_BACNET_WRITE_STATUS_SUCCESSFUL: BACnetWriteStatus = 2;
pub const BACnetWriteStatus_BACNET_WRITE_STATUS_FAILED: BACnetWriteStatus = 3;
pub type BACnetWriteStatus = ::std::os::raw::c_uint;
pub use self::BACnetWriteStatus as BACNET_WRITE_STATUS;
pub const BACNET_PORT_TYPE_PORT_TYPE_ETHERNET: BACNET_PORT_TYPE = 0;
pub const BACNET_PORT_TYPE_PORT_TYPE_ARCNET: BACNET_PORT_TYPE = 1;
pub const BACNET_PORT_TYPE_PORT_TYPE_MSTP: BACNET_PORT_TYPE = 2;
pub const BACNET_PORT_TYPE_PORT_TYPE_PTP: BACNET_PORT_TYPE = 3;
pub const BACNET_PORT_TYPE_PORT_TYPE_LONTALK: BACNET_PORT_TYPE = 4;
pub const BACNET_PORT_TYPE_PORT_TYPE_BIP: BACNET_PORT_TYPE = 5;
pub const BACNET_PORT_TYPE_PORT_TYPE_ZIGBEE: BACNET_PORT_TYPE = 6;
pub const BACNET_PORT_TYPE_PORT_TYPE_VIRTUAL: BACNET_PORT_TYPE = 7;
pub const BACNET_PORT_TYPE_PORT_TYPE_NON_BACNET: BACNET_PORT_TYPE = 8;
pub const BACNET_PORT_TYPE_PORT_TYPE_BIP6: BACNET_PORT_TYPE = 9;
pub const BACNET_PORT_TYPE_PORT_TYPE_SERIAL: BACNET_PORT_TYPE = 10;
pub const BACNET_PORT_TYPE_PORT_TYPE_BSC: BACNET_PORT_TYPE = 11;
pub const BACNET_PORT_TYPE_PORT_TYPE_RESERVED_FIRST: BACNET_PORT_TYPE = 12;
pub const BACNET_PORT_TYPE_PORT_TYPE_RESERVED_LAST: BACNET_PORT_TYPE = 63;
pub const BACNET_PORT_TYPE_PORT_TYPE_PROPRIETARY_FIRST: BACNET_PORT_TYPE = 64;
pub const BACNET_PORT_TYPE_PORT_TYPE_BSC_INTERIM: BACNET_PORT_TYPE = 64;
pub const BACNET_PORT_TYPE_PORT_TYPE_PROPRIETARY_LAST: BACNET_PORT_TYPE = 255;
pub const BACNET_PORT_TYPE_PORT_TYPE_MAX: BACNET_PORT_TYPE = 255;
pub type BACNET_PORT_TYPE = ::std::os::raw::c_uint;
pub const BACNET_PORT_QUALITY_PORT_QUALITY_UNKNOWN: BACNET_PORT_QUALITY = 0;
pub const BACNET_PORT_QUALITY_PORT_QUALITY_LEARNED: BACNET_PORT_QUALITY = 1;
pub const BACNET_PORT_QUALITY_PORT_QUALITY_LEARNED_CONFIGURED: BACNET_PORT_QUALITY = 2;
pub const BACNET_PORT_QUALITY_PORT_QUALITY_CONFIGURED: BACNET_PORT_QUALITY = 3;
pub type BACNET_PORT_QUALITY = ::std::os::raw::c_uint;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_IDLE: BACNET_PORT_COMMAND = 0;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_DISCARD_CHANGES: BACNET_PORT_COMMAND = 1;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_RENEW_FD_REGISTRATION: BACNET_PORT_COMMAND = 2;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_RESTART_SLAVE_DISCOVERY: BACNET_PORT_COMMAND = 3;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_RENEW_DHCP: BACNET_PORT_COMMAND = 4;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_RESTART_AUTONEGOTIATION: BACNET_PORT_COMMAND = 5;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_DISCONNECT: BACNET_PORT_COMMAND = 6;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_RESTART_PORT: BACNET_PORT_COMMAND = 7;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_GENERATE_CSR_FILE: BACNET_PORT_COMMAND = 8;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_VALIDATE_CHANGES: BACNET_PORT_COMMAND = 9;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_RESERVED_FIRST: BACNET_PORT_COMMAND = 10;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_RESERVED_LAST: BACNET_PORT_COMMAND = 127;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_PROPRIETARY_FIRST: BACNET_PORT_COMMAND = 128;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_PROPRIETARY_LAST: BACNET_PORT_COMMAND = 255;
pub const BACNET_PORT_COMMAND_PORT_COMMAND_MAX: BACNET_PORT_COMMAND = 255;
pub type BACNET_PORT_COMMAND = ::std::os::raw::c_uint;
pub const BACNET_SECURITY_LEVEL_BACNET_SECURITY_LEVEL_INCAPABLE: BACNET_SECURITY_LEVEL = 0;
pub const BACNET_SECURITY_LEVEL_BACNET_SECURITY_LEVEL_PLAIN: BACNET_SECURITY_LEVEL = 1;
pub const BACNET_SECURITY_LEVEL_BACNET_SECURITY_LEVEL_SIGNED: BACNET_SECURITY_LEVEL = 2;
pub const BACNET_SECURITY_LEVEL_BACNET_SECURITY_LEVEL_ENCRYPTED: BACNET_SECURITY_LEVEL = 3;
pub const BACNET_SECURITY_LEVEL_BACNET_SECURITY_LEVEL_SIGNED_END_TO_END: BACNET_SECURITY_LEVEL = 4;
pub const BACNET_SECURITY_LEVEL_BACNET_SECURITY_LEVEL_ENCRYPTED_END_TO_END: BACNET_SECURITY_LEVEL =
    5;
pub type BACNET_SECURITY_LEVEL = ::std::os::raw::c_uint;
pub const BACNET_SECURITY_POLICY_BACNET_SECURITY_POLICY_PLAIN_NOT_TRUSTED: BACNET_SECURITY_POLICY =
    0;
pub const BACNET_SECURITY_POLICY_BACNET_SECURITY_POLICY_PLAIN_TRUSTED: BACNET_SECURITY_POLICY = 1;
pub const BACNET_SECURITY_POLICY_BACNET_SECURITY_POLICY_SIGNED_TRUSTED: BACNET_SECURITY_POLICY = 2;
pub const BACNET_SECURITY_POLICY_BACNET_SECURITY_POLICY_ENCRYPTED_TRUSTED: BACNET_SECURITY_POLICY =
    3;
pub type BACNET_SECURITY_POLICY = ::std::os::raw::c_uint;
pub const BACNET_KEY_IDENTIFIER_ALGORITHM_KIA_AES_MD5: BACNET_KEY_IDENTIFIER_ALGORITHM = 0;
pub const BACNET_KEY_IDENTIFIER_ALGORITHM_KIA_AES_SHA256: BACNET_KEY_IDENTIFIER_ALGORITHM = 1;
pub const BACNET_KEY_IDENTIFIER_ALGORITHM_KIA_MAX_KEY_IDENTIFIER_ALGORITHM:
    BACNET_KEY_IDENTIFIER_ALGORITHM = 255;
pub type BACNET_KEY_IDENTIFIER_ALGORITHM = ::std::os::raw::c_uint;
pub const BACNET_KEY_IDENTIFIER_KEY_NUMBER_KIKN_NOT_USED: BACNET_KEY_IDENTIFIER_KEY_NUMBER = 0;
pub const BACNET_KEY_IDENTIFIER_KEY_NUMBER_KIKN_DEVICE_MASTER: BACNET_KEY_IDENTIFIER_KEY_NUMBER = 1;
pub const BACNET_KEY_IDENTIFIER_KEY_NUMBER_KIKN_DISTRIBUTION: BACNET_KEY_IDENTIFIER_KEY_NUMBER = 2;
pub const BACNET_KEY_IDENTIFIER_KEY_NUMBER_KIKN_INSTALLATION: BACNET_KEY_IDENTIFIER_KEY_NUMBER = 3;
pub const BACNET_KEY_IDENTIFIER_KEY_NUMBER_KIKN_GENERAL_NETWORK_ACCESS:
    BACNET_KEY_IDENTIFIER_KEY_NUMBER = 4;
pub const BACNET_KEY_IDENTIFIER_KEY_NUMBER_KIKN_USER_AUTHENTICATED:
    BACNET_KEY_IDENTIFIER_KEY_NUMBER = 5;
pub const BACNET_KEY_IDENTIFIER_KEY_NUMBER_KIKN_MIN_APPLICATION_SPECIFIC:
    BACNET_KEY_IDENTIFIER_KEY_NUMBER = 6;
pub const BACNET_KEY_IDENTIFIER_KEY_NUMBER_KIKN_MAX_APPLICATION_SPECIFIC:
    BACNET_KEY_IDENTIFIER_KEY_NUMBER = 127;
pub const BACNET_KEY_IDENTIFIER_KEY_NUMBER_KIKN_MAX_KEY_IDENTIFIER_KEY_NUMBER:
    BACNET_KEY_IDENTIFIER_KEY_NUMBER = 255;
pub type BACNET_KEY_IDENTIFIER_KEY_NUMBER = ::std::os::raw::c_uint;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_SUCCESS: BACNET_SECURITY_RESPONSE_CODE = 0;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_ACCESS_DENIED: BACNET_SECURITY_RESPONSE_CODE = 1;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_BAD_DESTINATION_ADDRESS:
    BACNET_SECURITY_RESPONSE_CODE = 2;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_BAD_DESTINATION_DEVICE_ID:
    BACNET_SECURITY_RESPONSE_CODE = 3;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_BAD_SIGNATURE: BACNET_SECURITY_RESPONSE_CODE = 4;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_BAD_SOURCE_ADDRESS: BACNET_SECURITY_RESPONSE_CODE =
    5;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_BAD_TIMESTAMP: BACNET_SECURITY_RESPONSE_CODE = 6;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_CANNOT_USE_KEY: BACNET_SECURITY_RESPONSE_CODE = 7;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_CANNOT_VERIFY_MESSAGE_ID:
    BACNET_SECURITY_RESPONSE_CODE = 8;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_CORRECT_KEY_REVISION:
    BACNET_SECURITY_RESPONSE_CODE = 9;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_DESTINATION_DEVICE_ID_REQUIRED:
    BACNET_SECURITY_RESPONSE_CODE = 10;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_DUPLICATE_MESSAGE: BACNET_SECURITY_RESPONSE_CODE =
    11;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_ENCRYPTION_NOT_CONFIGURED:
    BACNET_SECURITY_RESPONSE_CODE = 12;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_ENCRYPTION_REQUIRED:
    BACNET_SECURITY_RESPONSE_CODE = 13;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_INCORRECT_KEY: BACNET_SECURITY_RESPONSE_CODE = 14;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_INVALID_KEY_DATA: BACNET_SECURITY_RESPONSE_CODE =
    15;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_KEY_UPDATE_IN_PROGRESS:
    BACNET_SECURITY_RESPONSE_CODE = 16;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_MALFORMED_MESSAGE: BACNET_SECURITY_RESPONSE_CODE =
    17;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_NOT_KEY_SERVER: BACNET_SECURITY_RESPONSE_CODE = 18;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_SECURITY_NOT_CONFIGURED:
    BACNET_SECURITY_RESPONSE_CODE = 19;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_SOURCE_SECURITY_REQUIRED:
    BACNET_SECURITY_RESPONSE_CODE = 20;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_TOO_MANY_KEYS: BACNET_SECURITY_RESPONSE_CODE = 21;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_UNKNOWN_AUTHENTICATION_TYPE:
    BACNET_SECURITY_RESPONSE_CODE = 22;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_UNKNOWN_KEY: BACNET_SECURITY_RESPONSE_CODE = 23;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_UNKNOWN_KEY_REVISION:
    BACNET_SECURITY_RESPONSE_CODE = 24;
pub const BACNET_SECURITY_RESPONSE_CODE_SEC_RESP_UNKNOWN_SOURCE_MESSAGE:
    BACNET_SECURITY_RESPONSE_CODE = 25;
pub type BACNET_SECURITY_RESPONSE_CODE = ::std::os::raw::c_uint;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_ACCESS_CREDENTIAL_DISABLE_NONE:
    BACNET_ACCESS_CREDENTIAL_DISABLE = 0;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_ACCESS_CREDENTIAL_DISABLE:
    BACNET_ACCESS_CREDENTIAL_DISABLE = 1;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_ACCESS_CREDENTIAL_DISABLE_MANUAL:
    BACNET_ACCESS_CREDENTIAL_DISABLE = 2;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_ACCESS_CREDENTIAL_DISABLE_LOCKOUT:
    BACNET_ACCESS_CREDENTIAL_DISABLE = 3;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_ACCESS_CREDENTIAL_DISABLE_MAX:
    BACNET_ACCESS_CREDENTIAL_DISABLE = 4;
pub type BACNET_ACCESS_CREDENTIAL_DISABLE = ::std::os::raw::c_uint;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_REASON_CREDENTIAL_DISABLED:
    BACNET_ACCESS_CREDENTIAL_DISABLE_REASON = 0;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_REASON_CREDENTIAL_DISABLED_NEEDS_PROVISIONING:
    BACNET_ACCESS_CREDENTIAL_DISABLE_REASON = 1;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_REASON_CREDENTIAL_DISABLED_UNASSIGNED:
    BACNET_ACCESS_CREDENTIAL_DISABLE_REASON = 2;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_REASON_CREDENTIAL_DISABLED_NOT_YET_ACTIVE:
    BACNET_ACCESS_CREDENTIAL_DISABLE_REASON = 3;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_REASON_CREDENTIAL_DISABLED_EXPIRED:
    BACNET_ACCESS_CREDENTIAL_DISABLE_REASON = 4;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_REASON_CREDENTIAL_DISABLED_LOCKOUT:
    BACNET_ACCESS_CREDENTIAL_DISABLE_REASON = 5;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_REASON_CREDENTIAL_DISABLED_MAX_DAYS:
    BACNET_ACCESS_CREDENTIAL_DISABLE_REASON = 6;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_REASON_CREDENTIAL_DISABLED_MAX_USES:
    BACNET_ACCESS_CREDENTIAL_DISABLE_REASON = 7;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_REASON_CREDENTIAL_DISABLED_INACTIVITY:
    BACNET_ACCESS_CREDENTIAL_DISABLE_REASON = 8;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_REASON_CREDENTIAL_DISABLED_MANUAL:
    BACNET_ACCESS_CREDENTIAL_DISABLE_REASON = 9;
pub const BACNET_ACCESS_CREDENTIAL_DISABLE_REASON_CREDENTIAL_DISABLED_MAX:
    BACNET_ACCESS_CREDENTIAL_DISABLE_REASON = 10;
pub type BACNET_ACCESS_CREDENTIAL_DISABLE_REASON = ::std::os::raw::c_uint;
pub const BACNET_AUTHENTICATION_DISABLE_REASON_AUTHENTICATION_NONE:
    BACNET_AUTHENTICATION_DISABLE_REASON = 0;
pub const BACNET_AUTHENTICATION_DISABLE_REASON_AUTHENTICATION_DISABLED:
    BACNET_AUTHENTICATION_DISABLE_REASON = 1;
pub const BACNET_AUTHENTICATION_DISABLE_REASON_AUTHENTICATION_DISABLED_LOST:
    BACNET_AUTHENTICATION_DISABLE_REASON = 2;
pub const BACNET_AUTHENTICATION_DISABLE_REASON_AUTHENTICATION_DISABLED_STOLEN:
    BACNET_AUTHENTICATION_DISABLE_REASON = 3;
pub const BACNET_AUTHENTICATION_DISABLE_REASON_AUTHENTICATION_DISABLED_DAMAGED:
    BACNET_AUTHENTICATION_DISABLE_REASON = 4;
pub const BACNET_AUTHENTICATION_DISABLE_REASON_AUTHENTICATION_DISABLED_DESTROYED:
    BACNET_AUTHENTICATION_DISABLE_REASON = 5;
pub const BACNET_AUTHENTICATION_DISABLE_REASON_AUTHENTICATION_DISABLED_MAX:
    BACNET_AUTHENTICATION_DISABLE_REASON = 6;
pub type BACNET_AUTHENTICATION_DISABLE_REASON = ::std::os::raw::c_uint;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_UNDEFINED:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 0;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_ERROR:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 1;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_CUSTOM:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 2;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_SIMPLE_NUMBER16:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 3;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_SIMPLE_NUMBER32:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 4;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_SIMPLE_NUMBER56:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 5;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_SIMPLE_ALPHA_NUMERIC:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 6;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_ABA_TRACK2:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 7;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_WIEGAND26:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 8;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_WIEGAND37:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 9;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_WIEGAND37_FACILITY:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 10;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_FACILITY16_CARD32:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 11;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_FACILITY32_CARD32:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 12;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_FASC_N:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 13;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_FASC_N_BCD:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 14;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_FASC_N_LARGE:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 15;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_FASC_N_LARGE_BCD:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 16;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_GSA75:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 17;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_CHUID:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 18;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_CHUID_FULL:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 19;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_GUID:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 20;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_CBEFF_A:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 21;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_CBEFF_B:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 22;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_CBEFF_C:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 23;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_USER_PASSWORD:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 24;
pub const BACNET_AUTHENTICATION_FACTOR_TYPE_AUTHENTICATION_FACTOR_MAX:
    BACNET_AUTHENTICATION_FACTOR_TYPE = 25;
pub type BACNET_AUTHENTICATION_FACTOR_TYPE = ::std::os::raw::c_uint;
pub const BACnetProtocolLevel_T_BACNET_PROTOCOL_LEVEL_PHYSICAL: BACnetProtocolLevel_T = 0;
pub const BACnetProtocolLevel_T_BACNET_PROTOCOL_LEVEL_PROTOCOL: BACnetProtocolLevel_T = 1;
pub const BACnetProtocolLevel_T_BACNET_PROTOCOL_LEVEL_BACNET_APPLICATION: BACnetProtocolLevel_T = 2;
pub const BACnetProtocolLevel_T_BACNET_PROTOCOL_LEVEL_NON_BACNET_APPLICATION:
    BACnetProtocolLevel_T = 3;
pub type BACnetProtocolLevel_T = ::std::os::raw::c_uint;
pub use self::BACnetProtocolLevel_T as BACNET_PROTOCOL_LEVEL;
pub const BACnetIPMode_T_BACNET_IP_MODE_NORMAL: BACnetIPMode_T = 0;
pub const BACnetIPMode_T_BACNET_IP_MODE_FOREIGN: BACnetIPMode_T = 1;
pub const BACnetIPMode_T_BACNET_IP_MODE_BBMD: BACnetIPMode_T = 2;
pub type BACnetIPMode_T = ::std::os::raw::c_uint;
pub use self::BACnetIPMode_T as BACNET_IP_MODE;
extern "C" {
    pub fn abort_convert_error_code(error_code: BACNET_ERROR_CODE) -> BACNET_ABORT_REASON;
}
extern "C" {
    pub fn abort_convert_to_error_code(abort_code: BACNET_ABORT_REASON) -> BACNET_ERROR_CODE;
}
extern "C" {
    pub fn abort_encode_apdu(
        apdu: *mut u8,
        invoke_id: u8,
        abort_reason: u8,
        server: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn abort_decode_service_request(
        apdu: *mut u8,
        apdu_len: ::std::os::raw::c_uint,
        invoke_id: *mut u8,
        abort_reason: *mut u8,
    ) -> ::std::os::raw::c_int;
}
pub type rsize_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
pub type max_align_t = f64;
pub type BACNET_UNSIGNED_INTEGER = u64;
extern "C" {
    pub fn encode_unsigned16(apdu: *mut u8, value: u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn decode_unsigned16(apdu: *mut u8, value: *mut u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn encode_unsigned24(apdu: *mut u8, value: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn decode_unsigned24(apdu: *mut u8, value: *mut u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn encode_unsigned32(apdu: *mut u8, value: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn decode_unsigned32(apdu: *mut u8, value: *mut u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn encode_unsigned40(buffer: *mut u8, value: u64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn decode_unsigned40(buffer: *mut u8, value: *mut u64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn encode_unsigned48(buffer: *mut u8, value: u64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn decode_unsigned48(buffer: *mut u8, value: *mut u64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn encode_unsigned56(buffer: *mut u8, value: u64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn decode_unsigned56(buffer: *mut u8, value: *mut u64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn encode_unsigned64(buffer: *mut u8, value: u64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn decode_unsigned64(buffer: *mut u8, value: *mut u64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacnet_unsigned_length(value: BACNET_UNSIGNED_INTEGER) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacnet_signed_length(value: i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn encode_signed8(apdu: *mut u8, value: i8) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn decode_signed8(apdu: *mut u8, value: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn encode_signed16(apdu: *mut u8, value: i16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn decode_signed16(apdu: *mut u8, value: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn encode_signed24(apdu: *mut u8, value: i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn decode_signed24(apdu: *mut u8, value: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn encode_signed32(apdu: *mut u8, value: i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn decode_signed32(apdu: *mut u8, value: *mut i32) -> ::std::os::raw::c_int;
}
pub type BACNET_ARRAY_INDEX = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_Device_Address {
    pub mac_len: u8,
    pub mac: [u8; 7usize],
    pub net: u16,
    pub len: u8,
    pub adr: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_BACnet_Device_Address() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Device_Address> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Device_Address>(),
        18usize,
        concat!("Size of: ", stringify!(BACnet_Device_Address))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Device_Address>(),
        2usize,
        concat!("Alignment of ", stringify!(BACnet_Device_Address))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mac_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Device_Address),
            "::",
            stringify!(mac_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Device_Address),
            "::",
            stringify!(mac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).net) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Device_Address),
            "::",
            stringify!(net)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Device_Address),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).adr) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Device_Address),
            "::",
            stringify!(adr)
        )
    );
}
pub type BACNET_ADDRESS = BACnet_Device_Address;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_MAC_Address {
    pub len: u8,
    pub adr: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_BACnet_MAC_Address() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_MAC_Address> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_MAC_Address>(),
        8usize,
        concat!("Size of: ", stringify!(BACnet_MAC_Address))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_MAC_Address>(),
        1usize,
        concat!("Alignment of ", stringify!(BACnet_MAC_Address))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_MAC_Address),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).adr) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_MAC_Address),
            "::",
            stringify!(adr)
        )
    );
}
pub type BACNET_MAC_ADDRESS = BACnet_MAC_Address;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_Object_Id {
    pub type_: BACNET_OBJECT_TYPE,
    pub instance: u32,
}
#[test]
fn bindgen_test_layout_BACnet_Object_Id() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Object_Id> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Object_Id>(),
        8usize,
        concat!("Size of: ", stringify!(BACnet_Object_Id))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Object_Id>(),
        4usize,
        concat!("Alignment of ", stringify!(BACnet_Object_Id))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Object_Id),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).instance) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Object_Id),
            "::",
            stringify!(instance)
        )
    );
}
pub type BACNET_OBJECT_ID = BACnet_Object_Id;
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub type va_list = __darwin_va_list;
extern "C" {
    pub fn renameat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renamex_np(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameatx_np(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___sbuf() {
    const UNINIT: ::std::mem::MaybeUninit<__sbuf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sbuf>(),
        16usize,
        concat!("Size of: ", stringify!(__sbuf))
    );
    assert_eq!(
        ::std::mem::align_of::<__sbuf>(),
        8usize,
        concat!("Alignment of ", stringify!(__sbuf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[test]
fn bindgen_test_layout___sFILE() {
    const UNINIT: ::std::mem::MaybeUninit<__sFILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sFILE>(),
        152usize,
        concat!("Size of: ", stringify!(__sFILE))
    );
    assert_eq!(
        ::std::mem::align_of::<__sFILE>(),
        8usize,
        concat!("Alignment of ", stringify!(__sFILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_p)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._r) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._w) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._file) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._bf) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_bf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lbfsize) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lbfsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cookie) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_cookie)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._close) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_close)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._read) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._seek) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_seek)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._write) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ub) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ub)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._extra) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_extra)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ur) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ur)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ubuf) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ubuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._nbuf) as usize - ptr as usize },
        119usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_nbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lb) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._blksize) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_blksize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_offset)
        )
    );
}
pub type FILE = __sFILE;
extern "C" {
    pub static mut __stdinp: *mut FILE;
}
extern "C" {
    pub static mut __stdoutp: *mut FILE;
}
extern "C" {
    pub static mut __stderrp: *mut FILE;
}
extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gets(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn __srget(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __svfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __swbuf(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __prefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type off_t = __darwin_off_t;
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __offset: off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> off_t;
}
extern "C" {
    pub fn snprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __str: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdelim(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn getline(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut usize,
        __stream: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn fmemopen(
        __buf: *mut ::std::os::raw::c_void,
        __size: usize,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufp: *mut *mut ::std::os::raw::c_char,
        __sizep: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub static sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid_r(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fgetln(arg1: *mut FILE, arg2: *mut usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fmtcheck(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funopen(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: fpos_t,
                arg3: ::std::os::raw::c_int,
            ) -> fpos_t,
        >,
        arg5: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    ) -> *mut FILE;
}
extern "C" {
    pub fn __sprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __snprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: ::std::os::raw::c_int,
        arg4: usize,
        arg5: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __vsprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __vsnprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: ::std::os::raw::c_int,
        arg4: usize,
        arg5: *const ::std::os::raw::c_char,
        arg6: va_list,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_Bit_String {
    pub bits_used: u8,
    pub value: [u8; 15usize],
}
#[test]
fn bindgen_test_layout_BACnet_Bit_String() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Bit_String> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Bit_String>(),
        16usize,
        concat!("Size of: ", stringify!(BACnet_Bit_String))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Bit_String>(),
        1usize,
        concat!("Alignment of ", stringify!(BACnet_Bit_String))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bits_used) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Bit_String),
            "::",
            stringify!(bits_used)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Bit_String),
            "::",
            stringify!(value)
        )
    );
}
pub type BACNET_BIT_STRING = BACnet_Bit_String;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_Character_String {
    pub length: usize,
    pub encoding: u8,
    pub value: [::std::os::raw::c_char; 1470usize],
}
#[test]
fn bindgen_test_layout_BACnet_Character_String() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Character_String> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Character_String>(),
        1480usize,
        concat!("Size of: ", stringify!(BACnet_Character_String))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Character_String>(),
        8usize,
        concat!("Alignment of ", stringify!(BACnet_Character_String))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Character_String),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoding) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Character_String),
            "::",
            stringify!(encoding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Character_String),
            "::",
            stringify!(value)
        )
    );
}
pub type BACNET_CHARACTER_STRING = BACnet_Character_String;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_Octet_String {
    pub length: usize,
    pub value: [u8; 1470usize],
}
#[test]
fn bindgen_test_layout_BACnet_Octet_String() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Octet_String> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Octet_String>(),
        1480usize,
        concat!("Size of: ", stringify!(BACnet_Octet_String))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Octet_String>(),
        8usize,
        concat!("Alignment of ", stringify!(BACnet_Octet_String))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Octet_String),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Octet_String),
            "::",
            stringify!(value)
        )
    );
}
pub type BACNET_OCTET_STRING = BACnet_Octet_String;
extern "C" {
    pub fn bitstring_init(bit_string: *mut BACNET_BIT_STRING);
}
extern "C" {
    pub fn bitstring_set_bit(bit_string: *mut BACNET_BIT_STRING, bit_number: u8, value: bool);
}
extern "C" {
    pub fn bitstring_bit(bit_string: *mut BACNET_BIT_STRING, bit_number: u8) -> bool;
}
extern "C" {
    pub fn bitstring_bits_used(bit_string: *mut BACNET_BIT_STRING) -> u8;
}
extern "C" {
    pub fn bitstring_bytes_used(bit_string: *mut BACNET_BIT_STRING) -> u8;
}
extern "C" {
    pub fn bitstring_bits_capacity(bit_string: *mut BACNET_BIT_STRING) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn bitstring_octet(bit_string: *mut BACNET_BIT_STRING, octet_index: u8) -> u8;
}
extern "C" {
    pub fn bitstring_set_octet(bit_string: *mut BACNET_BIT_STRING, index: u8, octet: u8) -> bool;
}
extern "C" {
    pub fn bitstring_set_bits_used(
        bit_string: *mut BACNET_BIT_STRING,
        bytes_used: u8,
        unused_bits: u8,
    ) -> bool;
}
extern "C" {
    pub fn bitstring_copy(dest: *mut BACNET_BIT_STRING, src: *mut BACNET_BIT_STRING) -> bool;
}
extern "C" {
    pub fn bitstring_same(
        bitstring1: *mut BACNET_BIT_STRING,
        bitstring2: *mut BACNET_BIT_STRING,
    ) -> bool;
}
extern "C" {
    pub fn bitstring_init_ascii(
        bit_string: *mut BACNET_BIT_STRING,
        ascii: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn characterstring_init(
        char_string: *mut BACNET_CHARACTER_STRING,
        encoding: u8,
        value: *const ::std::os::raw::c_char,
        length: usize,
    ) -> bool;
}
extern "C" {
    pub fn characterstring_init_ansi(
        char_string: *mut BACNET_CHARACTER_STRING,
        value: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn characterstring_init_ansi_safe(
        char_string: *mut BACNET_CHARACTER_STRING,
        value: *const ::std::os::raw::c_char,
        tmax: usize,
    ) -> bool;
}
extern "C" {
    pub fn characterstring_copy(
        dest: *mut BACNET_CHARACTER_STRING,
        src: *mut BACNET_CHARACTER_STRING,
    ) -> bool;
}
extern "C" {
    pub fn characterstring_ansi_copy(
        dest: *mut ::std::os::raw::c_char,
        dest_max_len: usize,
        src: *mut BACNET_CHARACTER_STRING,
    ) -> bool;
}
extern "C" {
    pub fn characterstring_same(
        dest: *mut BACNET_CHARACTER_STRING,
        src: *mut BACNET_CHARACTER_STRING,
    ) -> bool;
}
extern "C" {
    pub fn characterstring_ansi_same(
        dest: *mut BACNET_CHARACTER_STRING,
        src: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn characterstring_append(
        char_string: *mut BACNET_CHARACTER_STRING,
        value: *const ::std::os::raw::c_char,
        length: usize,
    ) -> bool;
}
extern "C" {
    pub fn characterstring_truncate(
        char_string: *mut BACNET_CHARACTER_STRING,
        length: usize,
    ) -> bool;
}
extern "C" {
    pub fn characterstring_set_encoding(
        char_string: *mut BACNET_CHARACTER_STRING,
        encoding: u8,
    ) -> bool;
}
extern "C" {
    pub fn characterstring_value(
        char_string: *mut BACNET_CHARACTER_STRING,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn characterstring_length(char_string: *mut BACNET_CHARACTER_STRING) -> usize;
}
extern "C" {
    pub fn characterstring_encoding(char_string: *mut BACNET_CHARACTER_STRING) -> u8;
}
extern "C" {
    pub fn characterstring_capacity(char_string: *mut BACNET_CHARACTER_STRING) -> usize;
}
extern "C" {
    pub fn characterstring_printable(char_string: *mut BACNET_CHARACTER_STRING) -> bool;
}
extern "C" {
    pub fn characterstring_valid(char_string: *mut BACNET_CHARACTER_STRING) -> bool;
}
extern "C" {
    pub fn utf8_isvalid(str_: *const ::std::os::raw::c_char, length: usize) -> bool;
}
extern "C" {
    pub fn octetstring_init(
        octet_string: *mut BACNET_OCTET_STRING,
        value: *mut u8,
        length: usize,
    ) -> bool;
}
extern "C" {
    pub fn octetstring_init_ascii_hex(
        octet_string: *mut BACNET_OCTET_STRING,
        ascii_hex: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn octetstring_copy(dest: *mut BACNET_OCTET_STRING, src: *mut BACNET_OCTET_STRING) -> bool;
}
extern "C" {
    pub fn octetstring_copy_value(
        dest: *mut u8,
        length: usize,
        src: *mut BACNET_OCTET_STRING,
    ) -> usize;
}
extern "C" {
    pub fn octetstring_append(
        octet_string: *mut BACNET_OCTET_STRING,
        value: *mut u8,
        length: usize,
    ) -> bool;
}
extern "C" {
    pub fn octetstring_truncate(octet_string: *mut BACNET_OCTET_STRING, length: usize) -> bool;
}
extern "C" {
    pub fn octetstring_value(octet_string: *mut BACNET_OCTET_STRING) -> *mut u8;
}
extern "C" {
    pub fn octetstring_length(octet_string: *mut BACNET_OCTET_STRING) -> usize;
}
extern "C" {
    pub fn octetstring_capacity(octet_string: *mut BACNET_OCTET_STRING) -> usize;
}
extern "C" {
    pub fn octetstring_value_same(
        octet_string1: *mut BACNET_OCTET_STRING,
        octet_string2: *mut BACNET_OCTET_STRING,
    ) -> bool;
}
pub const BACnet_Weekday_BACNET_WEEKDAY_MONDAY: BACnet_Weekday = 1;
pub const BACnet_Weekday_BACNET_WEEKDAY_TUESDAY: BACnet_Weekday = 2;
pub const BACnet_Weekday_BACNET_WEEKDAY_WEDNESDAY: BACnet_Weekday = 3;
pub const BACnet_Weekday_BACNET_WEEKDAY_THURSDAY: BACnet_Weekday = 4;
pub const BACnet_Weekday_BACNET_WEEKDAY_FRIDAY: BACnet_Weekday = 5;
pub const BACnet_Weekday_BACNET_WEEKDAY_SATURDAY: BACnet_Weekday = 6;
pub const BACnet_Weekday_BACNET_WEEKDAY_SUNDAY: BACnet_Weekday = 7;
pub type BACnet_Weekday = ::std::os::raw::c_uint;
pub use self::BACnet_Weekday as BACNET_WEEKDAY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_Date {
    pub year: u16,
    pub month: u8,
    pub day: u8,
    pub wday: u8,
}
#[test]
fn bindgen_test_layout_BACnet_Date() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Date> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Date>(),
        6usize,
        concat!("Size of: ", stringify!(BACnet_Date))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Date>(),
        2usize,
        concat!("Alignment of ", stringify!(BACnet_Date))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).year) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Date),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).month) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Date),
            "::",
            stringify!(month)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).day) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Date),
            "::",
            stringify!(day)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wday) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Date),
            "::",
            stringify!(wday)
        )
    );
}
pub type BACNET_DATE = BACnet_Date;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_Time {
    pub hour: u8,
    pub min: u8,
    pub sec: u8,
    pub hundredths: u8,
}
#[test]
fn bindgen_test_layout_BACnet_Time() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Time> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Time>(),
        4usize,
        concat!("Size of: ", stringify!(BACnet_Time))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Time>(),
        1usize,
        concat!("Alignment of ", stringify!(BACnet_Time))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hour) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Time),
            "::",
            stringify!(hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Time),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sec) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Time),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hundredths) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Time),
            "::",
            stringify!(hundredths)
        )
    );
}
pub type BACNET_TIME = BACnet_Time;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_DateTime {
    pub date: BACNET_DATE,
    pub time: BACNET_TIME,
}
#[test]
fn bindgen_test_layout_BACnet_DateTime() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_DateTime> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_DateTime>(),
        10usize,
        concat!("Size of: ", stringify!(BACnet_DateTime))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_DateTime>(),
        2usize,
        concat!("Alignment of ", stringify!(BACnet_DateTime))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).date) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_DateTime),
            "::",
            stringify!(date)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_DateTime),
            "::",
            stringify!(time)
        )
    );
}
pub type BACNET_DATE_TIME = BACnet_DateTime;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_Date_Range {
    pub startdate: BACNET_DATE,
    pub enddate: BACNET_DATE,
}
#[test]
fn bindgen_test_layout_BACnet_Date_Range() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Date_Range> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Date_Range>(),
        12usize,
        concat!("Size of: ", stringify!(BACnet_Date_Range))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Date_Range>(),
        2usize,
        concat!("Alignment of ", stringify!(BACnet_Date_Range))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).startdate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Date_Range),
            "::",
            stringify!(startdate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enddate) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Date_Range),
            "::",
            stringify!(enddate)
        )
    );
}
pub type BACNET_DATE_RANGE = BACnet_Date_Range;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_Weeknday {
    pub month: u8,
    pub weekofmonth: u8,
    pub dayofweek: u8,
}
#[test]
fn bindgen_test_layout_BACnet_Weeknday() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Weeknday> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Weeknday>(),
        3usize,
        concat!("Size of: ", stringify!(BACnet_Weeknday))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Weeknday>(),
        1usize,
        concat!("Alignment of ", stringify!(BACnet_Weeknday))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).month) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Weeknday),
            "::",
            stringify!(month)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).weekofmonth) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Weeknday),
            "::",
            stringify!(weekofmonth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dayofweek) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Weeknday),
            "::",
            stringify!(dayofweek)
        )
    );
}
pub type BACNET_WEEKNDAY = BACnet_Weeknday;
pub type bacnet_time_t = u64;
extern "C" {
    pub fn datetime_set_date(bdate: *mut BACNET_DATE, year: u16, month: u8, day: u8);
}
extern "C" {
    pub fn datetime_set_time(
        btime: *mut BACNET_TIME,
        hour: u8,
        minute: u8,
        seconds: u8,
        hundredths: u8,
    );
}
extern "C" {
    pub fn datetime_set(
        bdatetime: *mut BACNET_DATE_TIME,
        bdate: *mut BACNET_DATE,
        btime: *mut BACNET_TIME,
    );
}
extern "C" {
    pub fn datetime_set_values(
        bdatetime: *mut BACNET_DATE_TIME,
        year: u16,
        month: u8,
        day: u8,
        hour: u8,
        minute: u8,
        seconds: u8,
        hundredths: u8,
    );
}
extern "C" {
    pub fn datetime_hms_to_seconds_since_midnight(hours: u8, minutes: u8, seconds: u8) -> u32;
}
extern "C" {
    pub fn datetime_hm_to_minutes_since_midnight(hours: u8, minutes: u8) -> u16;
}
extern "C" {
    pub fn datetime_hms_from_seconds_since_midnight(
        seconds: u32,
        pHours: *mut u8,
        pMinutes: *mut u8,
        pSeconds: *mut u8,
    );
}
extern "C" {
    pub fn datetime_is_valid(bdate: *mut BACNET_DATE, btime: *mut BACNET_TIME) -> bool;
}
extern "C" {
    pub fn datetime_time_is_valid(btime: *mut BACNET_TIME) -> bool;
}
extern "C" {
    pub fn datetime_date_is_valid(bdate: *mut BACNET_DATE) -> bool;
}
extern "C" {
    pub fn datetime_ymd_from_days_since_epoch(
        days: u32,
        pYear: *mut u16,
        pMonth: *mut u8,
        pDay: *mut u8,
    );
}
extern "C" {
    pub fn datetime_days_since_epoch(bdate: *mut BACNET_DATE) -> u32;
}
extern "C" {
    pub fn datetime_days_since_epoch_into_date(days: u32, bdate: *mut BACNET_DATE);
}
extern "C" {
    pub fn datetime_day_of_year(bdate: *mut BACNET_DATE) -> u32;
}
extern "C" {
    pub fn datetime_ymd_to_days_since_epoch(year: u16, month: u8, day: u8) -> u32;
}
extern "C" {
    pub fn datetime_day_of_year_into_date(days: u32, year: u16, bdate: *mut BACNET_DATE);
}
extern "C" {
    pub fn datetime_is_leap_year(year: u16) -> bool;
}
extern "C" {
    pub fn datetime_month_days(year: u16, month: u8) -> u8;
}
extern "C" {
    pub fn datetime_day_of_week(year: u16, month: u8, day: u8) -> u8;
}
extern "C" {
    pub fn datetime_ymd_is_valid(year: u16, month: u8, day: u8) -> bool;
}
extern "C" {
    pub fn datetime_ymd_day_of_year(year: u16, month: u8, day: u8) -> u32;
}
extern "C" {
    pub fn datetime_seconds_since_midnight_into_time(seconds: u32, btime: *mut BACNET_TIME);
}
extern "C" {
    pub fn datetime_seconds_since_midnight(btime: *mut BACNET_TIME) -> u32;
}
extern "C" {
    pub fn datetime_minutes_since_midnight(btime: *mut BACNET_TIME) -> u16;
}
extern "C" {
    pub fn datetime_compare_date(
        date1: *mut BACNET_DATE,
        date2: *mut BACNET_DATE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn datetime_compare_time(
        time1: *mut BACNET_TIME,
        time2: *mut BACNET_TIME,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn datetime_compare(
        datetime1: *mut BACNET_DATE_TIME,
        datetime2: *mut BACNET_DATE_TIME,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn datetime_wildcard_compare_date(
        date1: *mut BACNET_DATE,
        date2: *mut BACNET_DATE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn datetime_wildcard_compare_time(
        time1: *mut BACNET_TIME,
        time2: *mut BACNET_TIME,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn datetime_wildcard_compare(
        datetime1: *mut BACNET_DATE_TIME,
        datetime2: *mut BACNET_DATE_TIME,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn datetime_copy_date(dest: *mut BACNET_DATE, src: *mut BACNET_DATE);
}
extern "C" {
    pub fn datetime_copy_time(dest: *mut BACNET_TIME, src: *mut BACNET_TIME);
}
extern "C" {
    pub fn datetime_copy(dest: *mut BACNET_DATE_TIME, src: *mut BACNET_DATE_TIME);
}
extern "C" {
    pub fn datetime_add_minutes(bdatetime: *mut BACNET_DATE_TIME, minutes: i32);
}
extern "C" {
    pub fn datetime_seconds_since_epoch(bdatetime: *mut BACNET_DATE_TIME) -> bacnet_time_t;
}
extern "C" {
    pub fn datetime_since_epoch_seconds(bdatetime: *mut BACNET_DATE_TIME, seconds: bacnet_time_t);
}
extern "C" {
    pub fn datetime_seconds_since_epoch_max() -> bacnet_time_t;
}
extern "C" {
    pub fn datetime_wildcard_year(bdate: *mut BACNET_DATE) -> bool;
}
extern "C" {
    pub fn datetime_wildcard_year_set(bdate: *mut BACNET_DATE);
}
extern "C" {
    pub fn datetime_wildcard_month(bdate: *mut BACNET_DATE) -> bool;
}
extern "C" {
    pub fn datetime_wildcard_month_set(bdate: *mut BACNET_DATE);
}
extern "C" {
    pub fn datetime_wildcard_day(bdate: *mut BACNET_DATE) -> bool;
}
extern "C" {
    pub fn datetime_wildcard_day_set(bdate: *mut BACNET_DATE);
}
extern "C" {
    pub fn datetime_wildcard_weekday(bdate: *mut BACNET_DATE) -> bool;
}
extern "C" {
    pub fn datetime_wildcard_weekday_set(bdate: *mut BACNET_DATE);
}
extern "C" {
    pub fn datetime_wildcard_hour(btime: *mut BACNET_TIME) -> bool;
}
extern "C" {
    pub fn datetime_wildcard_hour_set(btime: *mut BACNET_TIME);
}
extern "C" {
    pub fn datetime_wildcard_minute(btime: *mut BACNET_TIME) -> bool;
}
extern "C" {
    pub fn datetime_wildcard_minute_set(btime: *mut BACNET_TIME);
}
extern "C" {
    pub fn datetime_wildcard_second(btime: *mut BACNET_TIME) -> bool;
}
extern "C" {
    pub fn datetime_wildcard_second_set(btime: *mut BACNET_TIME);
}
extern "C" {
    pub fn datetime_wildcard_hundredths(btime: *mut BACNET_TIME) -> bool;
}
extern "C" {
    pub fn datetime_wildcard_hundredths_set(btime: *mut BACNET_TIME);
}
extern "C" {
    pub fn datetime_wildcard(bdatetime: *mut BACNET_DATE_TIME) -> bool;
}
extern "C" {
    pub fn datetime_wildcard_present(bdatetime: *mut BACNET_DATE_TIME) -> bool;
}
extern "C" {
    pub fn datetime_wildcard_set(bdatetime: *mut BACNET_DATE_TIME);
}
extern "C" {
    pub fn datetime_date_wildcard_set(bdate: *mut BACNET_DATE);
}
extern "C" {
    pub fn datetime_time_wildcard_set(btime: *mut BACNET_TIME);
}
extern "C" {
    pub fn datetime_local_to_utc(
        utc_time: *mut BACNET_DATE_TIME,
        local_time: *mut BACNET_DATE_TIME,
        utc_offset_minutes: i16,
        dst_adjust_minutes: i8,
    ) -> bool;
}
extern "C" {
    pub fn datetime_utc_to_local(
        local_time: *mut BACNET_DATE_TIME,
        utc_time: *mut BACNET_DATE_TIME,
        utc_offset_minutes: i16,
        dst_adjust_minutes: i8,
    ) -> bool;
}
extern "C" {
    pub fn datetime_date_init_ascii(
        bdate: *mut BACNET_DATE,
        ascii: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn datetime_time_init_ascii(
        btime: *mut BACNET_TIME,
        ascii: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn bacapp_encode_datetime(
        apdu: *mut u8,
        value: *mut BACNET_DATE_TIME,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_encode_context_datetime(
        apdu: *mut u8,
        tag_number: u8,
        value: *mut BACNET_DATE_TIME,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_decode_datetime(
        apdu: *mut u8,
        value: *mut BACNET_DATE_TIME,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_decode_context_datetime(
        apdu: *mut u8,
        tag_number: u8,
        value: *mut BACNET_DATE_TIME,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn datetime_local(
        bdate: *mut BACNET_DATE,
        btime: *mut BACNET_TIME,
        utc_offset_minutes: *mut i16,
        dst_active: *mut bool,
    ) -> bool;
}
extern "C" {
    pub fn datetime_init();
}
pub const BACnet_Recipient_Tag_BACNET_RECIPIENT_TAG_DEVICE: BACnet_Recipient_Tag = 0;
pub const BACnet_Recipient_Tag_BACNET_RECIPIENT_TAG_ADDRESS: BACnet_Recipient_Tag = 1;
pub const BACnet_Recipient_Tag_BACNET_RECIPIENT_TAG_MAX: BACnet_Recipient_Tag = 2;
pub type BACnet_Recipient_Tag = ::std::os::raw::c_uint;
pub use self::BACnet_Recipient_Tag as BACNET_RECIPIENT_TAG;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct BACnet_Recipient {
    pub tag: u8,
    pub type_: BACnet_Recipient__bindgen_ty_1,
}
#[doc = "  BACnetRecipient ::= CHOICE {\n      device [0] BACnetObjectIdentifier,\n      address [1] BACnetAddress\n  }"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union BACnet_Recipient__bindgen_ty_1 {
    pub device: BACNET_OBJECT_ID,
    pub address: BACNET_ADDRESS,
}
#[test]
fn bindgen_test_layout_BACnet_Recipient__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Recipient__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Recipient__bindgen_ty_1>(),
        20usize,
        concat!("Size of: ", stringify!(BACnet_Recipient__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Recipient__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(BACnet_Recipient__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Recipient__bindgen_ty_1),
            "::",
            stringify!(device)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Recipient__bindgen_ty_1),
            "::",
            stringify!(address)
        )
    );
}
#[test]
fn bindgen_test_layout_BACnet_Recipient() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Recipient> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Recipient>(),
        24usize,
        concat!("Size of: ", stringify!(BACnet_Recipient))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Recipient>(),
        4usize,
        concat!("Alignment of ", stringify!(BACnet_Recipient))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Recipient),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Recipient),
            "::",
            stringify!(type_)
        )
    );
}
pub type BACNET_RECIPIENT = BACnet_Recipient;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct BACnet_Destination {
    #[doc = "  BACnetDestination ::= SEQUENCE {\n      valid-days                      BACnetDaysOfWeek,\n      from-time                       Time,\n      to-time                         Time,\n      recipient                       BACnetRecipient,\n      process-identifier              Unsigned32,\n      issue-confirmed-notifications   BOOLEAN,\n      transitions                     BACnetEventTransitionBits\n  }"]
    pub ValidDays: BACNET_BIT_STRING,
    pub FromTime: BACNET_TIME,
    pub ToTime: BACNET_TIME,
    pub Recipient: BACNET_RECIPIENT,
    pub ProcessIdentifier: u32,
    pub ConfirmedNotify: bool,
    pub Transitions: BACNET_BIT_STRING,
}
#[test]
fn bindgen_test_layout_BACnet_Destination() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Destination> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Destination>(),
        72usize,
        concat!("Size of: ", stringify!(BACnet_Destination))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Destination>(),
        4usize,
        concat!("Alignment of ", stringify!(BACnet_Destination))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ValidDays) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Destination),
            "::",
            stringify!(ValidDays)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FromTime) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Destination),
            "::",
            stringify!(FromTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ToTime) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Destination),
            "::",
            stringify!(ToTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Recipient) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Destination),
            "::",
            stringify!(Recipient)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProcessIdentifier) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Destination),
            "::",
            stringify!(ProcessIdentifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ConfirmedNotify) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Destination),
            "::",
            stringify!(ConfirmedNotify)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Transitions) as usize - ptr as usize },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Destination),
            "::",
            stringify!(Transitions)
        )
    );
}
pub type BACNET_DESTINATION = BACnet_Destination;
extern "C" {
    pub fn bacnet_destination_encode(
        apdu: *mut u8,
        destination: *mut BACNET_DESTINATION,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacnet_destination_context_encode(
        apdu: *mut u8,
        tag_number: u8,
        destination: *mut BACNET_DESTINATION,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacnet_destination_decode(
        apdu: *mut u8,
        apdu_len: ::std::os::raw::c_int,
        destination: *mut BACNET_DESTINATION,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacnet_destination_default_init(destination: *mut BACNET_DESTINATION);
}
extern "C" {
    pub fn bacnet_destination_default(destination: *mut BACNET_DESTINATION) -> bool;
}
extern "C" {
    pub fn bacnet_destination_same(
        dest1: *mut BACNET_DESTINATION,
        dest2: *mut BACNET_DESTINATION,
    ) -> bool;
}
extern "C" {
    pub fn bacnet_destination_copy(dest: *mut BACNET_DESTINATION, src: *mut BACNET_DESTINATION);
}
extern "C" {
    pub fn bacnet_recipient_copy(dest: *mut BACNET_RECIPIENT, src: *mut BACNET_RECIPIENT);
}
extern "C" {
    pub fn bacnet_recipient_same(r1: *mut BACNET_RECIPIENT, r2: *mut BACNET_RECIPIENT) -> bool;
}
extern "C" {
    pub fn bacnet_recipient_device_wildcard(recipient: *mut BACNET_RECIPIENT) -> bool;
}
extern "C" {
    pub fn bacnet_recipient_device_valid(recipient: *mut BACNET_RECIPIENT) -> bool;
}
extern "C" {
    pub fn bacnet_destination_to_ascii(
        bacdest: *const BACNET_DESTINATION,
        buf: *mut ::std::os::raw::c_char,
        buf_size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacnet_destination_from_ascii(
        bacdest: *mut BACNET_DESTINATION,
        buf: *const ::std::os::raw::c_char,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnetLightingCommand {
    pub operation: BACNET_LIGHTING_OPERATION,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub target_level: f32,
    pub ramp_rate: f32,
    pub step_increment: f32,
    pub fade_time: u32,
    pub priority: u8,
}
#[test]
fn bindgen_test_layout_BACnetLightingCommand() {
    const UNINIT: ::std::mem::MaybeUninit<BACnetLightingCommand> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnetLightingCommand>(),
        28usize,
        concat!("Size of: ", stringify!(BACnetLightingCommand))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnetLightingCommand>(),
        4usize,
        concat!("Alignment of ", stringify!(BACnetLightingCommand))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operation) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetLightingCommand),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_level) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetLightingCommand),
            "::",
            stringify!(target_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ramp_rate) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetLightingCommand),
            "::",
            stringify!(ramp_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step_increment) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetLightingCommand),
            "::",
            stringify!(step_increment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fade_time) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetLightingCommand),
            "::",
            stringify!(fade_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetLightingCommand),
            "::",
            stringify!(priority)
        )
    );
}
impl BACnetLightingCommand {
    #[inline]
    pub fn use_target_level(&self) -> bool {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_use_target_level(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn use_ramp_rate(&self) -> bool {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_use_ramp_rate(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn use_step_increment(&self) -> bool {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_use_step_increment(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn use_fade_time(&self) -> bool {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_use_fade_time(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn use_priority(&self) -> bool {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_use_priority(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        use_target_level: bool,
        use_ramp_rate: bool,
        use_step_increment: bool,
        use_fade_time: bool,
        use_priority: bool,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let use_target_level: u8 = unsafe { ::std::mem::transmute(use_target_level) };
            use_target_level as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let use_ramp_rate: u8 = unsafe { ::std::mem::transmute(use_ramp_rate) };
            use_ramp_rate as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let use_step_increment: u8 = unsafe { ::std::mem::transmute(use_step_increment) };
            use_step_increment as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let use_fade_time: u8 = unsafe { ::std::mem::transmute(use_fade_time) };
            use_fade_time as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let use_priority: u8 = unsafe { ::std::mem::transmute(use_priority) };
            use_priority as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type BACNET_LIGHTING_COMMAND = BACnetLightingCommand;
#[doc = " BACnetxyColor::= SEQUENCE {\n      x-coordinate REAL, --(0.0 to 1.0)\n      y-coordinate REAL --(0.0 to 1.0)\n }"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnetXYColor {
    pub x_coordinate: f32,
    pub y_coordinate: f32,
}
#[test]
fn bindgen_test_layout_BACnetXYColor() {
    const UNINIT: ::std::mem::MaybeUninit<BACnetXYColor> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnetXYColor>(),
        8usize,
        concat!("Size of: ", stringify!(BACnetXYColor))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnetXYColor>(),
        4usize,
        concat!("Alignment of ", stringify!(BACnetXYColor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x_coordinate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetXYColor),
            "::",
            stringify!(x_coordinate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y_coordinate) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetXYColor),
            "::",
            stringify!(y_coordinate)
        )
    );
}
#[doc = " BACnetxyColor::= SEQUENCE {\n      x-coordinate REAL, --(0.0 to 1.0)\n      y-coordinate REAL --(0.0 to 1.0)\n }"]
pub type BACNET_XY_COLOR = BACnetXYColor;
#[doc = "  BACnetColorCommand ::= SEQUENCE {\n      operation      [0] BACnetColorOperation,\n      target-color   [1] BACnetxyColor OPTIONAL,\n      target-color-temperature [2] Unsigned OPTIONAL,\n      fade-time      [3] Unsigned (100.. 86400000) OPTIONAL,\n      ramp-rate      [4] Unsigned (1..30000) OPTIONAL,\n      step-increment [5] Unsigned (1..30000) OPTIONAL\n  }"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct BACnetColorCommand {
    pub operation: BACNET_COLOR_OPERATION,
    pub target: BACnetColorCommand__bindgen_ty_1,
    pub transit: BACnetColorCommand__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union BACnetColorCommand__bindgen_ty_1 {
    pub color: BACNET_XY_COLOR,
    pub color_temperature: u16,
}
#[test]
fn bindgen_test_layout_BACnetColorCommand__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<BACnetColorCommand__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnetColorCommand__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(BACnetColorCommand__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnetColorCommand__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(BACnetColorCommand__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetColorCommand__bindgen_ty_1),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color_temperature) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetColorCommand__bindgen_ty_1),
            "::",
            stringify!(color_temperature)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union BACnetColorCommand__bindgen_ty_2 {
    pub fade_time: u32,
    pub ramp_rate: u16,
    pub step_increment: u16,
}
#[test]
fn bindgen_test_layout_BACnetColorCommand__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<BACnetColorCommand__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnetColorCommand__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(BACnetColorCommand__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnetColorCommand__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(BACnetColorCommand__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fade_time) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetColorCommand__bindgen_ty_2),
            "::",
            stringify!(fade_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ramp_rate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetColorCommand__bindgen_ty_2),
            "::",
            stringify!(ramp_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step_increment) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetColorCommand__bindgen_ty_2),
            "::",
            stringify!(step_increment)
        )
    );
}
#[test]
fn bindgen_test_layout_BACnetColorCommand() {
    const UNINIT: ::std::mem::MaybeUninit<BACnetColorCommand> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnetColorCommand>(),
        16usize,
        concat!("Size of: ", stringify!(BACnetColorCommand))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnetColorCommand>(),
        4usize,
        concat!("Alignment of ", stringify!(BACnetColorCommand))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operation) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetColorCommand),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetColorCommand),
            "::",
            stringify!(target)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transit) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetColorCommand),
            "::",
            stringify!(transit)
        )
    );
}
#[doc = "  BACnetColorCommand ::= SEQUENCE {\n      operation      [0] BACnetColorOperation,\n      target-color   [1] BACnetxyColor OPTIONAL,\n      target-color-temperature [2] Unsigned OPTIONAL,\n      fade-time      [3] Unsigned (100.. 86400000) OPTIONAL,\n      ramp-rate      [4] Unsigned (1..30000) OPTIONAL,\n      step-increment [5] Unsigned (1..30000) OPTIONAL\n  }"]
pub type BACNET_COLOR_COMMAND = BACnetColorCommand;
extern "C" {
    pub fn lighting_command_encode(
        apdu: *mut u8,
        data: *mut BACNET_LIGHTING_COMMAND,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lighting_command_encode_context(
        apdu: *mut u8,
        tag_number: u8,
        value: *mut BACNET_LIGHTING_COMMAND,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lighting_command_decode(
        apdu: *mut u8,
        apdu_max_len: ::std::os::raw::c_uint,
        data: *mut BACNET_LIGHTING_COMMAND,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lighting_command_copy(
        dst: *mut BACNET_LIGHTING_COMMAND,
        src: *mut BACNET_LIGHTING_COMMAND,
    ) -> bool;
}
extern "C" {
    pub fn lighting_command_same(
        dst: *mut BACNET_LIGHTING_COMMAND,
        src: *mut BACNET_LIGHTING_COMMAND,
    ) -> bool;
}
extern "C" {
    pub fn xy_color_encode(apdu: *mut u8, value: *mut BACNET_XY_COLOR) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xy_color_context_encode(
        apdu: *mut u8,
        tag_number: u8,
        value: *mut BACNET_XY_COLOR,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xy_color_decode(
        apdu: *mut u8,
        apdu_size: u32,
        value: *mut BACNET_XY_COLOR,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xy_color_context_decode(
        apdu: *mut u8,
        apdu_size: u32,
        tag_number: u8,
        value: *mut BACNET_XY_COLOR,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xy_color_copy(
        dst: *mut BACNET_XY_COLOR,
        src: *mut BACNET_XY_COLOR,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xy_color_same(value1: *mut BACNET_XY_COLOR, value2: *mut BACNET_XY_COLOR) -> bool;
}
extern "C" {
    pub fn color_command_encode(
        apdu: *mut u8,
        address: *mut BACNET_COLOR_COMMAND,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn color_command_context_encode(
        apdu: *mut u8,
        tag_number: u8,
        address: *mut BACNET_COLOR_COMMAND,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn color_command_decode(
        apdu: *mut u8,
        apdu_len: u16,
        error_code: *mut BACNET_ERROR_CODE,
        address: *mut BACNET_COLOR_COMMAND,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn color_command_copy(
        dst: *mut BACNET_COLOR_COMMAND,
        src: *mut BACNET_COLOR_COMMAND,
    ) -> bool;
}
extern "C" {
    pub fn color_command_same(
        dst: *mut BACNET_COLOR_COMMAND,
        src: *mut BACNET_COLOR_COMMAND,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnetDeviceObjectPropertyReference {
    pub arrayIndex: BACNET_UNSIGNED_INTEGER,
    pub objectIdentifier: BACNET_OBJECT_ID,
    pub propertyIdentifier: BACNET_PROPERTY_ID,
    pub deviceIdentifier: BACNET_OBJECT_ID,
}
#[test]
fn bindgen_test_layout_BACnetDeviceObjectPropertyReference() {
    const UNINIT: ::std::mem::MaybeUninit<BACnetDeviceObjectPropertyReference> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnetDeviceObjectPropertyReference>(),
        32usize,
        concat!("Size of: ", stringify!(BACnetDeviceObjectPropertyReference))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnetDeviceObjectPropertyReference>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(BACnetDeviceObjectPropertyReference)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arrayIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetDeviceObjectPropertyReference),
            "::",
            stringify!(arrayIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objectIdentifier) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetDeviceObjectPropertyReference),
            "::",
            stringify!(objectIdentifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).propertyIdentifier) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetDeviceObjectPropertyReference),
            "::",
            stringify!(propertyIdentifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deviceIdentifier) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetDeviceObjectPropertyReference),
            "::",
            stringify!(deviceIdentifier)
        )
    );
}
pub type BACNET_DEVICE_OBJECT_PROPERTY_REFERENCE = BACnetDeviceObjectPropertyReference;
#[doc = " BACnetDeviceObjectReference structure.\n If the optional deviceIdentifier is not provided, then this refers\n to an object inside this Device."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnetDeviceObjectReference {
    #[doc = "< Optional, for external device."]
    pub deviceIdentifier: BACNET_OBJECT_ID,
    pub objectIdentifier: BACNET_OBJECT_ID,
}
#[test]
fn bindgen_test_layout_BACnetDeviceObjectReference() {
    const UNINIT: ::std::mem::MaybeUninit<BACnetDeviceObjectReference> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnetDeviceObjectReference>(),
        16usize,
        concat!("Size of: ", stringify!(BACnetDeviceObjectReference))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnetDeviceObjectReference>(),
        4usize,
        concat!("Alignment of ", stringify!(BACnetDeviceObjectReference))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deviceIdentifier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetDeviceObjectReference),
            "::",
            stringify!(deviceIdentifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objectIdentifier) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnetDeviceObjectReference),
            "::",
            stringify!(objectIdentifier)
        )
    );
}
#[doc = " BACnetDeviceObjectReference structure.\n If the optional deviceIdentifier is not provided, then this refers\n to an object inside this Device."]
pub type BACNET_DEVICE_OBJECT_REFERENCE = BACnetDeviceObjectReference;
#[doc = "  BACnetObjectPropertyReference ::= SEQUENCE {\n      object-identifier [0] BACnetObjectIdentifier,\n      property-identifier [1] BACnetPropertyIdentifier,\n      property-array-index [2] Unsigned OPTIONAL\n      -- used only with array datatype\n      -- if omitted with an array the entire array is referenced\n }"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_Object_Property_Reference {
    pub object_identifier: BACNET_OBJECT_ID,
    pub property_identifier: BACNET_PROPERTY_ID,
    pub property_array_index: BACNET_ARRAY_INDEX,
}
#[test]
fn bindgen_test_layout_BACnet_Object_Property_Reference() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_Object_Property_Reference> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_Object_Property_Reference>(),
        16usize,
        concat!("Size of: ", stringify!(BACnet_Object_Property_Reference))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_Object_Property_Reference>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(BACnet_Object_Property_Reference)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).object_identifier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Object_Property_Reference),
            "::",
            stringify!(object_identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_identifier) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Object_Property_Reference),
            "::",
            stringify!(property_identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_array_index) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_Object_Property_Reference),
            "::",
            stringify!(property_array_index)
        )
    );
}
#[doc = "  BACnetObjectPropertyReference ::= SEQUENCE {\n      object-identifier [0] BACnetObjectIdentifier,\n      property-identifier [1] BACnetPropertyIdentifier,\n      property-array-index [2] Unsigned OPTIONAL\n      -- used only with array datatype\n      -- if omitted with an array the entire array is referenced\n }"]
pub type BACNET_OBJECT_PROPERTY_REFERENCE = BACnet_Object_Property_Reference;
extern "C" {
    pub fn bacapp_encode_device_obj_property_ref(
        apdu: *mut u8,
        value: *mut BACNET_DEVICE_OBJECT_PROPERTY_REFERENCE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_encode_context_device_obj_property_ref(
        apdu: *mut u8,
        tag_number: u8,
        value: *mut BACNET_DEVICE_OBJECT_PROPERTY_REFERENCE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_decode_device_obj_property_ref(
        apdu: *mut u8,
        value: *mut BACNET_DEVICE_OBJECT_PROPERTY_REFERENCE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_decode_context_device_obj_property_ref(
        apdu: *mut u8,
        tag_number: u8,
        value: *mut BACNET_DEVICE_OBJECT_PROPERTY_REFERENCE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_encode_device_obj_ref(
        apdu: *mut u8,
        value: *mut BACNET_DEVICE_OBJECT_REFERENCE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_encode_context_device_obj_ref(
        apdu: *mut u8,
        tag_number: u8,
        value: *mut BACNET_DEVICE_OBJECT_REFERENCE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_decode_device_obj_ref(
        apdu: *mut u8,
        value: *mut BACNET_DEVICE_OBJECT_REFERENCE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_decode_context_device_obj_ref(
        apdu: *mut u8,
        tag_number: u8,
        value: *mut BACNET_DEVICE_OBJECT_REFERENCE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_encode_obj_property_ref(
        apdu: *mut u8,
        value: *mut BACNET_OBJECT_PROPERTY_REFERENCE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_encode_context_obj_property_ref(
        apdu: *mut u8,
        tag_number: u8,
        value: *mut BACNET_OBJECT_PROPERTY_REFERENCE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_decode_obj_property_ref(
        apdu: *mut u8,
        apdu_len_max: u16,
        value: *mut BACNET_OBJECT_PROPERTY_REFERENCE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacapp_decode_context_obj_property_ref(
        apdu: *mut u8,
        apdu_len_max: u16,
        tag_number: u8,
        value: *mut BACNET_OBJECT_PROPERTY_REFERENCE,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bacnet_npdu_data_t {
    pub protocol_version: u8,
    pub data_expecting_reply: bool,
    pub network_layer_message: bool,
    pub priority: BACNET_MESSAGE_PRIORITY,
    pub network_message_type: BACNET_NETWORK_MESSAGE_TYPE,
    pub vendor_id: u16,
    pub hop_count: u8,
}
#[test]
fn bindgen_test_layout_bacnet_npdu_data_t() {
    const UNINIT: ::std::mem::MaybeUninit<bacnet_npdu_data_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bacnet_npdu_data_t>(),
        16usize,
        concat!("Size of: ", stringify!(bacnet_npdu_data_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bacnet_npdu_data_t>(),
        4usize,
        concat!("Alignment of ", stringify!(bacnet_npdu_data_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).protocol_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bacnet_npdu_data_t),
            "::",
            stringify!(protocol_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_expecting_reply) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bacnet_npdu_data_t),
            "::",
            stringify!(data_expecting_reply)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).network_layer_message) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bacnet_npdu_data_t),
            "::",
            stringify!(network_layer_message)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bacnet_npdu_data_t),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).network_message_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bacnet_npdu_data_t),
            "::",
            stringify!(network_message_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vendor_id) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bacnet_npdu_data_t),
            "::",
            stringify!(vendor_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hop_count) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(bacnet_npdu_data_t),
            "::",
            stringify!(hop_count)
        )
    );
}
pub type BACNET_NPDU_DATA = bacnet_npdu_data_t;
#[doc = " Port Info structure used by Routers for their routing table."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct router_port_t {
    #[doc = "< The DNET number that identifies this port."]
    pub dnet: u16,
    #[doc = "< Either 0 or some ill-defined, meaningless value."]
    pub id: u8,
    #[doc = "< Info like 'modem dialing string'"]
    pub info: [u8; 2usize],
    #[doc = "< Length of info[]."]
    pub info_len: u8,
    #[doc = "< Point to next in linked list"]
    pub next: *mut router_port_t,
}
#[test]
fn bindgen_test_layout_router_port_t() {
    const UNINIT: ::std::mem::MaybeUninit<router_port_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<router_port_t>(),
        16usize,
        concat!("Size of: ", stringify!(router_port_t))
    );
    assert_eq!(
        ::std::mem::align_of::<router_port_t>(),
        8usize,
        concat!("Alignment of ", stringify!(router_port_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dnet) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(router_port_t),
            "::",
            stringify!(dnet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(router_port_t),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(router_port_t),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info_len) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(router_port_t),
            "::",
            stringify!(info_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(router_port_t),
            "::",
            stringify!(next)
        )
    );
}
#[doc = " Port Info structure used by Routers for their routing table."]
pub type BACNET_ROUTER_PORT = router_port_t;
extern "C" {
    pub fn npdu_encode_max_seg_max_apdu(
        max_segs: ::std::os::raw::c_int,
        max_apdu: ::std::os::raw::c_int,
    ) -> u8;
}
extern "C" {
    pub fn npdu_encode_pdu(
        npdu: *mut u8,
        dest: *mut BACNET_ADDRESS,
        src: *mut BACNET_ADDRESS,
        npdu_data: *mut BACNET_NPDU_DATA,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn npdu_encode_npdu_data(
        npdu: *mut BACNET_NPDU_DATA,
        data_expecting_reply: bool,
        priority: BACNET_MESSAGE_PRIORITY,
    );
}
extern "C" {
    pub fn npdu_encode_npdu_network(
        npdu_data: *mut BACNET_NPDU_DATA,
        network_message_type: BACNET_NETWORK_MESSAGE_TYPE,
        data_expecting_reply: bool,
        priority: BACNET_MESSAGE_PRIORITY,
    );
}
extern "C" {
    pub fn npdu_copy_data(dest: *mut BACNET_NPDU_DATA, src: *mut BACNET_NPDU_DATA);
}
extern "C" {
    pub fn npdu_decode(
        npdu: *mut u8,
        dest: *mut BACNET_ADDRESS,
        src: *mut BACNET_ADDRESS,
        npdu_data: *mut BACNET_NPDU_DATA,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bacnet_npdu_decode(
        npdu: *mut u8,
        pdu_len: u16,
        dest: *mut BACNET_ADDRESS,
        src: *mut BACNET_ADDRESS,
        npdu_data: *mut BACNET_NPDU_DATA,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn npdu_confirmed_service(pdu: *mut u8, pdu_len: u16) -> bool;
}
#[doc = " BACnet IPv4 Address\n\n Data link layer addressing between B/IPv4 nodes consists of a 32-bit\n IPv4 address followed by a two-octet UDP port number (both of which\n shall be transmitted with the most significant octet first).\n This address shall be referred to as a B/IPv4 address.\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_IP_Address {
    pub address: [u8; 4usize],
    pub port: u16,
}
#[test]
fn bindgen_test_layout_BACnet_IP_Address() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_IP_Address> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_IP_Address>(),
        6usize,
        concat!("Size of: ", stringify!(BACnet_IP_Address))
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_IP_Address>(),
        2usize,
        concat!("Alignment of ", stringify!(BACnet_IP_Address))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_IP_Address),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_IP_Address),
            "::",
            stringify!(port)
        )
    );
}
#[doc = " BACnet IPv4 Address\n\n Data link layer addressing between B/IPv4 nodes consists of a 32-bit\n IPv4 address followed by a two-octet UDP port number (both of which\n shall be transmitted with the most significant octet first).\n This address shall be referred to as a B/IPv4 address.\n @{"]
pub type BACNET_IP_ADDRESS = BACnet_IP_Address;
#[doc = " BACnet IPv4 Broadcast Distribution Mask\n\n The Broadcast Distribution Mask is a 4-octet field that\n indicates how broadcast messages are to be distributed on\n the IP subnet served by the BBMD.\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_IP_Broadcast_Distribution_Mask {
    pub address: [u8; 4usize],
}
#[test]
fn bindgen_test_layout_BACnet_IP_Broadcast_Distribution_Mask() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_IP_Broadcast_Distribution_Mask> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_IP_Broadcast_Distribution_Mask>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(BACnet_IP_Broadcast_Distribution_Mask)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_IP_Broadcast_Distribution_Mask>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(BACnet_IP_Broadcast_Distribution_Mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_IP_Broadcast_Distribution_Mask),
            "::",
            stringify!(address)
        )
    );
}
#[doc = " BACnet IPv4 Broadcast Distribution Mask\n\n The Broadcast Distribution Mask is a 4-octet field that\n indicates how broadcast messages are to be distributed on\n the IP subnet served by the BBMD.\n @{"]
pub type BACNET_IP_BROADCAST_DISTRIBUTION_MASK = BACnet_IP_Broadcast_Distribution_Mask;
#[doc = " BACnet/IP Broadcast Distribution Table (BDT)\n\n The BDT consists of one entry for the address of the BBMD\n for the local IP subnet and an entry for the BBMD on each\n remote IP subnet to which broadcasts are to be forwarded.\n Each entry consists of the 6-octet B/IP address with which\n the BBMD is accessed and a 4-octet broadcast distribution mask.\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_IP_Broadcast_Distribution_Table_Entry {
    pub valid: bool,
    pub dest_address: BACNET_IP_ADDRESS,
    pub broadcast_mask: BACNET_IP_BROADCAST_DISTRIBUTION_MASK,
    pub next: *mut BACnet_IP_Broadcast_Distribution_Table_Entry,
}
#[test]
fn bindgen_test_layout_BACnet_IP_Broadcast_Distribution_Table_Entry() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_IP_Broadcast_Distribution_Table_Entry> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_IP_Broadcast_Distribution_Table_Entry>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(BACnet_IP_Broadcast_Distribution_Table_Entry)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_IP_Broadcast_Distribution_Table_Entry>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(BACnet_IP_Broadcast_Distribution_Table_Entry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).valid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_IP_Broadcast_Distribution_Table_Entry),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dest_address) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_IP_Broadcast_Distribution_Table_Entry),
            "::",
            stringify!(dest_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).broadcast_mask) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_IP_Broadcast_Distribution_Table_Entry),
            "::",
            stringify!(broadcast_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_IP_Broadcast_Distribution_Table_Entry),
            "::",
            stringify!(next)
        )
    );
}
#[doc = " BACnet/IP Broadcast Distribution Table (BDT)\n\n The BDT consists of one entry for the address of the BBMD\n for the local IP subnet and an entry for the BBMD on each\n remote IP subnet to which broadcasts are to be forwarded.\n Each entry consists of the 6-octet B/IP address with which\n the BBMD is accessed and a 4-octet broadcast distribution mask.\n @{"]
pub type BACNET_IP_BROADCAST_DISTRIBUTION_TABLE_ENTRY =
    BACnet_IP_Broadcast_Distribution_Table_Entry;
#[doc = " Foreign Device Table (FDT)\n\n Each device that registers as a foreign device shall be placed\n in an entry in the BBMD's Foreign Device Table (FDT). Each\n entry shall consist of the 6-octet B/IP address of the registrant;\n the 2-octet Time-to-Live value supplied at the time of\n registration; and a 2-octet value representing the number of\n seconds remaining before the BBMD will purge the registrant's FDT\n entry if no re-registration occurs. This value will be initialized\n to the 2-octet Time-to-Live value supplied at the time of\n registration.\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BACnet_IP_Foreign_Device_Table_Entry {
    pub valid: bool,
    pub dest_address: BACNET_IP_ADDRESS,
    pub ttl_seconds: u16,
    pub ttl_seconds_remaining: u16,
    pub next: *mut BACnet_IP_Foreign_Device_Table_Entry,
}
#[test]
fn bindgen_test_layout_BACnet_IP_Foreign_Device_Table_Entry() {
    const UNINIT: ::std::mem::MaybeUninit<BACnet_IP_Foreign_Device_Table_Entry> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BACnet_IP_Foreign_Device_Table_Entry>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(BACnet_IP_Foreign_Device_Table_Entry)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<BACnet_IP_Foreign_Device_Table_Entry>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(BACnet_IP_Foreign_Device_Table_Entry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).valid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_IP_Foreign_Device_Table_Entry),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dest_address) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_IP_Foreign_Device_Table_Entry),
            "::",
            stringify!(dest_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ttl_seconds) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_IP_Foreign_Device_Table_Entry),
            "::",
            stringify!(ttl_seconds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ttl_seconds_remaining) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_IP_Foreign_Device_Table_Entry),
            "::",
            stringify!(ttl_seconds_remaining)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BACnet_IP_Foreign_Device_Table_Entry),
            "::",
            stringify!(next)
        )
    );
}
